acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
/******************************************************************************
 *
 * Copyright(c) 2007 - 2012 Realtek Corporation. All rights reserved.
 *
 * This program is free software; you can redistribute it and/or modify it
 * under the terms of version 2 of the GNU General Public License as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for
 * more details.
 *
 * You should have received a copy of the GNU General Public License along with
 * this program; if not, write to the Free Software Foundation, Inc.,
 * 51 Franklin Street, Fifth Floor, Boston, MA 02110, USA
 *
 *
 ******************************************************************************/
#include <drv_types.h>
#include <rtl8723a_hal.h>


#ifdef bEnable
#undef bEnable
#endif

//#define BT_DEBUG

#define CHECK_BT_EXIST_FROM_REG
#define DIS_PS_RX_BCN


#ifdef CONFIG_BT_COEXIST
#ifdef PLATFORM_LINUX

u32 BTCoexDbgLevel = _bt_dbg_off_;

#define RTPRINT(_Comp, _Level, Fmt)\
do {\
	if((BTCoexDbgLevel ==_bt_dbg_on_)) {\
		printk("%s", DRIVER_PREFIX);\
		printk Fmt;\
	}\
}while(0)

#define RTPRINT_ADDR(dbgtype, dbgflag, printstr, _Ptr)\
if((BTCoexDbgLevel ==_bt_dbg_on_) ){\
	u32 __i;						\
	u8 *ptr = (u8*)_Ptr;	\
	printk printstr;				\
	printk(" ");					\
	for( __i=0; __i<6; __i++ )		\
		printk("%02X%s", ptr[__i], (__i==5)?"":"-");		\
	printk("\n");							\
}
#define RTPRINT_DATA(dbgtype, dbgflag, _TitleString, _HexData, _HexDataLen)\
if((BTCoexDbgLevel ==_bt_dbg_on_) ){\
	u32 __i;									\
	u8 *ptr = (u8*)_HexData;			\
	printk(_TitleString);					\
	for( __i=0; __i<(u32)_HexDataLen; __i++ )	\
	{										\
		printk("%02X%s", ptr[__i], (((__i + 1) % 4) == 0)?"  ":" ");\
		if (((__i + 1) % 16) == 0)	printk("\n");\
	}										\
	printk("\n");							\
}
// Added by Annie, 2005-11-22.
#define MAX_STR_LEN	64
#define PRINTABLE(_ch)	(_ch>=' ' &&_ch<='~')	// I want to see ASCII 33 to 126 only. Otherwise, I print '?'. Annie, 2005-11-22.
#define RT_PRINT_STR(_Comp, _Level, _TitleString, _Ptr, _Len)					\
{\
/*	if (((_Comp) & GlobalDebugComponents) && (_Level <= GlobalDebugLevel))	*/\
	{									\
		u32 __i;						\
		u8 buffer[MAX_STR_LEN];					\
		u32	length = (_Len<MAX_STR_LEN)? _Len : (MAX_STR_LEN-1) ;	\
		_rtw_memset(buffer, 0, MAX_STR_LEN);			\
		_rtw_memcpy(buffer, (u8*)_Ptr, length);		\
		for (__i=0; __i<length; __i++)					\
		{								\
			if (!PRINTABLE(buffer[__i]))	buffer[__i] = '?';	\
		}								\
		buffer[length] = '\0';						\
		printk("Rtl819x: ");						\
		printk(_TitleString);						\
		printk(": %d, <%s>\n", _Len, buffer);				\
	}\
}
#endif // PLATFORM_LINUX

#else // !BT_DEBUG

#define RTPRINT(...)
#define RTPRINT_ADDR(...)
#define RTPRINT_DATA(...)
#define RT_PRINT_STR(...)

#endif // !BT_DEBUG

#define DCMD_Printf(...)
#define RT_ASSERT(...)

#ifdef PLATFORM_LINUX
#define rsprintf snprintf
#elif defined(PLATFORM_WINDOWS)
#define rsprintf sprintf_s
#endif

#define GET_BT_INFO(padapter)	(&GET_HAL_DATA(padapter)->BtInfo)

#define GetDefaultAdapter(padapter)	padapter

#define PlatformZeroMemory(ptr, sz)	_rtw_memset(ptr, 0, sz)

#ifdef PLATFORM_LINUX
#define PlatformProcessHCICommands(...)
#define PlatformTxBTQueuedPackets(...)
#define PlatformIndicateBTACLData(...)	(RT_STATUS_SUCCESS)
#endif
#define PlatformAcquireSpinLock(padapter, type)
#define PlatformReleaseSpinLock(padapter, type)

// timer
#define PlatformInitializeTimer(padapter, ptimer, pfunc, cntx, szID) \
	_init_timer(ptimer, padapter->pnetdev, pfunc, padapter)
#define PlatformSetTimer(a, ptimer, delay)	_set_timer(ptimer, delay)
static u8 PlatformCancelTimer(PADAPTER a, _timer *ptimer)
{
	u8 bcancelled;
	_cancel_timer(ptimer, &bcancelled);
	return bcancelled;
}
#define PlatformReleaseTimer(...)

// workitem
// already define in hal/OUTSRC/odm_interface.h
//typedef void (*RT_WORKITEM_CALL_BACK)(void *pContext);
#define PlatformInitializeWorkItem(padapter, pwi, pfunc, cntx, szID) \
	_init_workitem(pwi, pfunc, padapter)
#define PlatformFreeWorkItem(...)
#define PlatformScheduleWorkItem(pwork) _set_workitem(pwork)
#if 0
#define GET_UNDECORATED_AVERAGE_RSSI(padapter)	\
		(check_fwstate(&padapter->mlmepriv, WIFI_AP_STATE|WIFI_ADHOC_STATE|WIFI_ADHOC_MASTER_STATE) == _TRUE) ?		\
			(GET_HAL_DATA(padapter)->dmpriv.EntryMinUndecoratedSmoothedPWDB):	\
			(GET_HAL_DATA(padapter)->dmpriv.UndecoratedSmoothedPWDB)
#else
#define GET_UNDECORATED_AVERAGE_RSSI(padapter)	\
			(GET_HAL_DATA(padapter)->dmpriv.EntryMinUndecoratedSmoothedPWDB)
#endif
#define RT_RF_CHANGE_SOURCE u32

typedef enum _RT_JOIN_ACTION{
	RT_JOIN_INFRA   = 1,
	RT_JOIN_IBSS  = 2,
	RT_START_IBSS = 3,
	RT_NO_ACTION  = 4,
} RT_JOIN_ACTION;

// power saving
#ifdef CONFIG_IPS
#define IPSReturn(padapter, b)		ips_enter(padapter)
#define IPSDisable(padapter, b, c)	ips_leave(padapter)
#else
#define IPSReturn(...)
#define IPSDisable(...)
#endif
#ifdef CONFIG_LPS
#define LeisurePSLeave(padapter, b)	LPS_Leave(padapter)
#else
#define LeisurePSLeave(...)
#endif

#ifdef __BT_C__ // COMMOM/BT.c
// ===== Below this line is sync from SD7 driver COMMOM/BT.c =====

u8 BT_Operation(PADAPTER padapter)
{
	PBT30Info	pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT	pBtMgnt = &pBTInfo->BtMgnt;

	if (pBtMgnt->BtOperationOn)
		return _TRUE;
	else
		return _FALSE;
}

u8 BT_IsLegalChannel(PADAPTER padapter, u8 channel)
{
	PRT_CHANNEL_INFO pChanneList = NULL;
	u8 channelLen, i;


	pChanneList = padapter->mlmeextpriv.channel_set;
	channelLen = padapter->mlmeextpriv.max_chan_nums;

	for (i = 0; i < channelLen; i++)
	{
		RTPRINT(FIOCTL, IOCTL_STATE, ("Check if chnl(%d) in channel plan contains bt target chnl(%d) for BT connection\n", pChanneList[i].ChannelNum, channel));
		if ((channel == pChanneList[i].ChannelNum) ||
			(channel == pChanneList[i].ChannelNum + 2))
		{
			return channel;
		}
	}
	return 0;
}

void BT_WifiScanNotify(PADAPTER padapter, u8 scanType)
{
	BTHCI_WifiScanNotify(padapter, scanType);
	BTDM_CheckAntSelMode(padapter);
	BTDM_WifiScanNotify(padapter, scanType);
}

