acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
void BT_WifiAssociateNotify(PADAPTER padapter, u8 action)
{
	// action :
	// TRUE = associate start
	// FALSE = associate finished
	if (action)
		BTDM_CheckAntSelMode(padapter);

	BTDM_WifiAssociateNotify(padapter, action);
}

void BT_WifiMediaStatusNotify(PADAPTER padapter, RT_MEDIA_STATUS mstatus)
{
	BTDM_MediaStatusNotify(padapter, mstatus);
}

void BT_SpecialPacketNotify(PADAPTER padapter)
{
	BTDM_ForDhcp(padapter);
}

void BT_HaltProcess(PADAPTER padapter)
{
	BTDM_ForHalt(padapter);
}

void BT_LpsLeave(PADAPTER padapter)
{
	BTDM_LpsLeave(padapter);
}

// ===== End of sync from SD7 driver COMMOM/BT.c =====
#endif

#ifdef __BT_HANDLEPACKET_C__ // COMMOM/bt_handlepacket.c
// ===== Below this line is sync from SD7 driver COMMOM/bt_handlepacket.c =====

void btpkt_SendBeacon(PADAPTER padapter)
{
#if 0 // not implement yet
	PRT_TCB					pTcb;
	PRT_TX_LOCAL_BUFFER 	pBuf;

	PlatformAcquireSpinLock(padapter, RT_TX_SPINLOCK);

	if (MgntGetBuffer(padapter, &pTcb, &pBuf))
	{
		btpkt_ConstructBeaconFrame(
			padapter,
			pBuf->Buffer.VirtualAddress,
			&pTcb->PacketLength);

		MgntSendPacket(padapter, pTcb, pBuf, pTcb->PacketLength, NORMAL_QUEUE, MGN_1M);

	}

	PlatformReleaseSpinLock(padapter, RT_TX_SPINLOCK);
#endif
}

void BTPKT_WPAAuthINITIALIZE(PADAPTER padapter, u8 EntryNum)
{
#if 0
//	PMGNT_INFO 	pMgntInfo = &padapter->MgntInfo;
	PBT30Info			pBTinfo = GET_BT_INFO(padapter);
	PBT_SECURITY		pBtSec = &pBTinfo->BtSec;
	PBT_DBG				pBtDbg = &pBTinfo->BtDbg;
	PHAL_DATA_TYPE		pHalData = GET_HAL_DATA(padapter);

	RTPRINT(FIOCTL, IOCTL_STATE, ("BTPKT_WPAAuthINITIALIZE() EntryNum = %d\n",EntryNum));

	if (pHalData->bBTMode)
	{
//		if (padapter->MgntInfo.OpMode == RT_OP_MODE_IBSS)
		if (check_fwstate(&padapter->mlmepriv, WIFI_ADHOC_STATE|WIFI_ADHOC_MASTER_STATE) == _TRUE)
		{
			pBtSec->bUsedHwEncrypt = _FALSE;
		}
		else
		{
			pBtSec->bUsedHwEncrypt = _TRUE;
		}
	}
	else
		pBtSec->bUsedHwEncrypt = _FALSE;

	pBTinfo->BtAsocEntry[EntryNum].WPAAuthReplayCount = 0;

	if (pBTinfo->BtAsocEntry[EntryNum].AMPRole == AMP_BTAP_CREATOR)
	{
		u8			RdmBuf[20], NonceBuf[KEY_NONCE_LEN];
		u8			index;
		u64			KeyReplayCounter = 0;
		u8			temp[8] = {0};

		// Gene Creator Nonce
		GetRandomBuffer(RdmBuf);
		for (index = 0; index < 16; index++)
		{
			NonceBuf[index] = RdmBuf[index];
			NonceBuf[16+index] = RdmBuf[19-index];
		}
		_rtw_memcpy(pBTinfo->BtAsocEntry[EntryNum].ANonce, NonceBuf, KEY_NONCE_LEN);

		// Set ReplayCounter
		pBTinfo->BtAsocEntry[EntryNum].KeyReplayCounter ++;

		for( index = 0 ; index < 8 ; index++)
			temp[index] =  (u8)((pBTinfo->BtAsocEntry[EntryNum].KeyReplayCounter >>( (7-index) *8)) &0xff);

		_rtw_memcpy(&KeyReplayCounter, temp, 8);
		RTPRINT(FIOCTL, IOCTL_STATE, ("[BT pkt], 4-way packet, send 1st and wait for 2nd pkt\n"));

		pBtDbg->dbgBtPkt.btPktTx4way1st++;

		// Send 1st packet of 4-way
		btpkt_SendEapolKeyPacket(
						padapter,
						pBTinfo->BtAsocEntry[EntryNum].BTRemoteMACAddr, //Sta MAC address
						NULL, // Pointer to KCK (EAPOL-Key Confirmation Key).
						NULL, //
						type_Pairwise, // EAPOL-Key Information field: Key Type bit: type_Group or type_Pairwise.
						_FALSE, // EAPOL-Key Information field: Install Flag.
						_TRUE, // EAPOL-Key Information field: Key Ack bit.
						_FALSE, // EAPOL-Key Information field: Key MIC bit. If true, we will calculate EAPOL MIC and fill it into Key MIC field.
						_FALSE, // EAPOL-Key Information field: Secure bit.
						_FALSE, // EAPOL-Key Information field: Error bit. True for MIC failure report.
						_FALSE, // EAPOL-Key Information field: Requst bit.
						KeyReplayCounter, // EAPOL-KEY Replay Counter field.  //pSTA->perSTAKeyInfo.KeyReplayCounter
						pBTinfo->BtAsocEntry[EntryNum].ANonce, // EAPOL-Key Key Nonce field (32-byte).
						0, // EAPOL-Key Key RSC field (8-byte).
						NULL, // Key Data field: Pointer to RSN IE, NULL if
						NULL, // Key Data field: Pointer to GTK, NULL if Key Data Length = 0.
						EntryNum
						);
		pBTinfo->BtAsocEntry[EntryNum].BTWPAAuthState = STATE_WPA_AUTH_WAIT_PACKET_2;

		PlatformSetTimer(padapter, &pBtSec->BTWPAAuthTimer , BT_WPA_AUTH_TIMEOUT_PERIOD);
		// Set WPA Auth State

		RTPRINT(FIOCTL, IOCTL_STATE, ("Initial BT WPA Creat mode  successful !!\n"));
	}
	else if (pBTinfo->BtAsocEntry[EntryNum].AMPRole == AMP_BTAP_JOINER)
	{
		RTPRINT(FIOCTL, IOCTL_STATE, ("BT Joiner BTPKT_WPAAuthINITIALIZE\n"));
		// Set WPA Auth State
		pBTinfo->BtAsocEntry[EntryNum].BTWPAAuthState = STATE_WPA_AUTH_WAIT_PACKET_1;
		RTPRINT(FIOCTL, IOCTL_STATE, ("Initial BT WPA Joiner mode  successful !!\n"));
	}
	else
	{
		pBTinfo->BtAsocEntry[EntryNum].BTWPAAuthState = STATE_WPA_AUTH_UNINITIALIZED;
		RTPRINT(FIOCTL, IOCTL_STATE, ("=====> BT unknown mode\n"));
	}
#endif
}

void BTPKT_TimerCallbackWPAAuth(PRT_TIMER pTimer)
{
#if 0
//	PADAPTER		padapter = (PADAPTER)pTimer->padapter;
	PADAPTER		padapter = (PADAPTER)pTimer;
	PBT30Info		pBTinfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTinfo->BtMgnt;
	PBT_SECURITY		pBtSec = &pBTinfo->BtSec;
	u8			EntryNum = pBtMgnt->CurrentConnectEntryNum;
	u32			index;


	//
	//	Now we check all BT entry !!
	//
	for (index = 0; index < MAX_BT_ASOC_ENTRY_NUM; index++)
	{
		// Check bUsed
		if (!pBTinfo->BtAsocEntry[index].bUsed)
			continue;

		// Check state
		if (pBTinfo->BtAsocEntry[EntryNum].BTWPAAuthState == STATE_WPA_AUTH_SUCCESSED)
			continue;

		if (pBTinfo->BtAsocEntry[EntryNum].BTWPAAuthState == STATE_WPA_AUTH_UNINITIALIZED)
		{
			RTPRINT(FIOCTL, IOCTL_STATE, ("====> BTPKT_TimerCallbackWPAAuth(), BTPKT_WPAAuthINITIALIZE!!\n"));
			BTPKT_WPAAuthINITIALIZE(padapter,EntryNum);
			continue;
		}

		// Add Re-play counter !!
		pBTinfo->BtAsocEntry[EntryNum].WPAAuthReplayCount++;

		if (pBTinfo->BtAsocEntry[EntryNum].WPAAuthReplayCount > BTMaxWPAAuthReTransmitCoun)
		{
			BTHCI_SM_WITH_INFO(padapter,HCI_STATE_AUTHENTICATING,STATE_CMD_4WAY_FAILED,EntryNum);
			RTPRINT(FIOCTL, IOCTL_STATE, ("====> BTPKT_TimerCallbackWPAAuth(), Retry too much times !!\n"));
				continue;
		}
		else if (pBTinfo->BtAsocEntry[EntryNum].BTWPAAuthState == STATE_WPA_AUTH_WAIT_PACKET_1)
		{
			// We may be remove PlatformSetTimer , after check all station !!
			PlatformSetTimer(padapter, &pBtSec->BTWPAAuthTimer, BT_WPA_AUTH_TIMEOUT_PERIOD);
			RTPRINT(FIOCTL, IOCTL_STATE, ("====> Retry STATE_WPA_AUTH_WAIT_PACKET_1 !!\n"));
				continue;
		}
		else if (pBTinfo->BtAsocEntry[EntryNum].BTWPAAuthState == STATE_WPA_AUTH_WAIT_PACKET_2)
		{
			RTPRINT(FIOCTL, IOCTL_STATE, ("====> Re-Send 1st of 4-way, STATE_WPA_AUTH_WAIT_PACKET_2 !!\n"));
			// Re-Send 1st of 4-way !!
			{
				u64			KeyReplayCounter = 0;
				u8			temp[8] = {0};
				u8			indexi = 0;
				// Set ReplayCounter
				pBTinfo->BtAsocEntry[EntryNum].KeyReplayCounter ++;

				for (indexi = 0; indexi < 8; indexi++)
					temp[indexi] = (u8)((pBTinfo->BtAsocEntry[EntryNum].KeyReplayCounter >>((7-indexi)*8))&0xff);

				// Send 1st packet of 4-way
				btpkt_SendEapolKeyPacket(
								padapter,
								pBTinfo->BtAsocEntry[EntryNum].BTRemoteMACAddr, //Sta MAC address
								NULL, // Pointer to KCK (EAPOL-Key Confirmation Key).
								NULL, //
								type_Pairwise, // EAPOL-Key Information field: Key Type bit: type_Group or type_Pairwise.
								_FALSE, // EAPOL-Key Information field: Install Flag.
								_TRUE, // EAPOL-Key Information field: Key Ack bit.
								_FALSE, // EAPOL-Key Information field: Key MIC bit. If true, we will calculate EAPOL MIC and fill it into Key MIC field.
								_FALSE, // EAPOL-Key Information field: Secure bit.
								_FALSE, // EAPOL-Key Information field: Error bit. True for MIC failure report.
								_FALSE, // EAPOL-Key Information field: Requst bit.
								KeyReplayCounter, // EAPOL-KEY Replay Counter field.  //pSTA->perSTAKeyInfo.KeyReplayCounter
								pBTinfo->BtAsocEntry[EntryNum].ANonce, // EAPOL-Key Key Nonce field (32-byte).
								0, // EAPOL-Key Key RSC field (8-byte).
								NULL, // Key Data field: Pointer to RSN IE, NULL if
								NULL, // Key Data field: Pointer to GTK, NULL if Key Data Length = 0.
								EntryNum
								);
			}
			// We may be remove PlatformSetTimer BTWPAAuthTimer , after check all station !!
			PlatformSetTimer(padapter, &pBtSec->BTWPAAuthTimer , BT_WPA_AUTH_TIMEOUT_PERIOD);
			//RTPRINT(FIOCTL, IOCTL_STATE, ("====> Re-Send 1st of 4-way, STATE_WPA_AUTH_WAIT_PACKET_2 !!\n"));
			continue;
		}
		else if (pBTinfo->BtAsocEntry[EntryNum].BTWPAAuthState == STATE_WPA_AUTH_WAIT_PACKET_3)
		{
			// We may be remove PlatformSetTimer , after check all station !!
			PlatformSetTimer(padapter, &pBtSec->BTWPAAuthTimer , BT_WPA_AUTH_TIMEOUT_PERIOD);
			RTPRINT(FIOCTL, IOCTL_STATE, ("====> Re-Send 2nd of 4-way, STATE_WPA_AUTH_WAIT_PACKET_3 !!\n"));
			continue;
		}
		else if (pBTinfo->BtAsocEntry[EntryNum].BTWPAAuthState == STATE_WPA_AUTH_WAIT_PACKET_4)
		{
			// Re-Send 3th of 4-way !!
			{
				u64			KeyReplayCounter = 0;
				u8			temp[8] = {0};
				u8			indexi = 0;
				// Set ReplayCounter
				pBTinfo->BtAsocEntry[EntryNum].KeyReplayCounter ++;

				for (indexi = 0; indexi < 8; indexi++)
					temp[indexi] = (u8)((pBTinfo->BtAsocEntry[EntryNum].KeyReplayCounter >> ((7-indexi)*8))&0xff);

				btpkt_SendEapolKeyPacket(
						padapter,
						pBTinfo->BtAsocEntry[EntryNum].BTRemoteMACAddr,
						pBTinfo->BtAsocEntry[EntryNum].PTK, // Pointer to KCK (EAPOL-Key Confirmation Key).
						NULL,//pBTinfo->BtAsocEntry[EntryNum].PTK + 16,
						type_Pairwise, // EAPOL-Key Information field: Key Type bit: type_Group or type_Pairwise.
						_TRUE, // EAPOL-Key Information field: Install Flag.
						_TRUE, // EAPOL-Key Information field: Key Ack bit.
						_TRUE, // EAPOL-Key Information field: Key MIC bit. If true, we will calculate EAPOL MIC and fill it into Key MIC field.
						_TRUE, // EAPOL-Key Information field: Secure bit.
						_FALSE, // EAPOL-Key Information field: Error bit. True for MIC failure report.
						_FALSE, // EAPOL-Key Information field: Requst bit.
						KeyReplayCounter,//pSTA->perSTAKeyInfo.KeyReplayCounter, // EAPOL-KEY Replay Counter field.
						pBTinfo->BtAsocEntry[EntryNum].ANonce, // EAPOL-Key Key Nonce field (32-byte).
						0, // perSTA EAPOL-Key Key RSC field (8-byte).
						&(pBtSec->RSNIE), // Key Data field: Pointer to RSN IE, NULL if
						NULL,//pBTinfo->BtAsocEntry[EntryNum].GTK,  // Key Data field: Pointer to GTK, NULL if Key Data Length = 0.
						EntryNum
						);
			}
			// We may be remove PlatformSetTimer , after check all station !!
			PlatformSetTimer(padapter, &pBtSec->BTWPAAuthTimer, BT_WPA_AUTH_TIMEOUT_PERIOD);
			RTPRINT(FIOCTL, IOCTL_STATE, ("====> Re-Send 3th of 4-way, STATE_WPA_AUTH_WAIT_PACKET_4 !!\n"));
			continue;
		}
		else
		{
			RTPRINT(FIOCTL, IOCTL_STATE, ("====> BTPKT_TimerCallbackWPAAuth(), Error State !!%d\n",pBTinfo->BtAsocEntry[EntryNum].BTWPAAuthState ));
			continue;
		}
	}
#endif
}

void BTPKT_TimerCallbackBeacon(PRT_TIMER pTimer)
{
//	PADAPTER	padapter = (PADAPTER)pTimer->padapter;
	PADAPTER	padapter = (PADAPTER)pTimer;
//	PMGNT_INFO	pMgntInfo = &(padapter->MgntInfo);
	PBT30Info		pBTinfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTinfo->BtMgnt;

	RTPRINT(FIOCTL, IOCTL_CALLBACK_FUN, ("=====> BTPKT_TimerCallbackBeacon\n"));
//	if (RT_CANNOT_IO(padapter))
//		return;
	//pMgntInfo->BtInfo.BTBeaconTmrOn = _TRUE;

	if (!pBTinfo->BTBeaconTmrOn)
		return;

