acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
	if (pBtMgnt->BtOperationOn)
	{
		RTPRINT(FIOCTL, IOCTL_CALLBACK_FUN, ("btpkt_SendBeacon\n"));
		btpkt_SendBeacon(GetDefaultAdapter(padapter));
		PlatformSetTimer(padapter, &pBTinfo->BTBeaconTimer, 100);
	}
	else
	{
		RTPRINT(FIOCTL, IOCTL_CALLBACK_FUN, ("<===== BTPKT_TimerCallbackBeacon\n"));
	}
}


// ===== End of sync from SD7 driver COMMOM/bt_handlepacket.c =====
#endif

#ifdef __BT_HCI_C__ // COMMOM/bt_hci.c

#define i64fmt		"ll"
#define UINT64_C(v)  (v)

#define FillOctetString(_os,_octet,_len)		\
	(_os).Octet=(u8*)(_octet);			\
	(_os).Length=(_len);

static RT_STATUS PlatformIndicateBTEvent(
	PADAPTER 					padapter,
	void						*pEvntData,
	u32						dataLen
	)
{
	RT_STATUS	rt_status = RT_STATUS_FAILURE;
#ifdef PLATFORM_WINDOWS
	NTSTATUS	nt_status = STATUS_SUCCESS;
	PIRP		pIrp = NULL;
	u32			BytesTransferred = 0;
#endif

	RTPRINT(FIOCTL, IOCTL_BT_EVENT_DETAIL, ("BT event start, %d bytes data to Transferred!!\n", dataLen));
	RTPRINT_DATA(FIOCTL, IOCTL_BT_EVENT_DETAIL, "To transfer Hex Data :\n",
		pEvntData, dataLen);

//	if (pGBTDeviceExtension==NULL || pGBTDeviceExtension->padapter!=padapter)
//		return rt_status;

	BT_EventParse(padapter, pEvntData, dataLen);

#ifdef PLATFORM_LINUX

	printk(KERN_WARNING "%s: Linux has no way to report BT event!!\n", __FUNCTION__);

#elif defined(PLATFORM_WINDOWS)

	pIrp = IOCTL_BtIrpDequeue(pGBTDeviceExtension, IRP_HCI_EVENT_Q);

	if(pIrp)
	{
		PVOID	outbuf;
		ULONG	outlen;
		ULONG	offset;

		outbuf = MmGetSystemAddressForMdlSafe(pIrp->MdlAddress, HighPagePriority);
		if(outbuf == NULL)
		{
			RTPRINT(FIOCTL, IOCTL_IRP, ("PlatformIndicateBTEvent(), error!! MdlAddress = NULL!!\n"));
			BytesTransferred = 0;
			nt_status = STATUS_UNSUCCESSFUL;
		}
		else
		{
			outlen = MmGetMdlByteCount(pIrp->MdlAddress);
			offset = MmGetMdlByteOffset(pIrp->MdlAddress);

			if(dataLen <= outlen)
				BytesTransferred = dataLen;
			else
				BytesTransferred = outlen;
			_rtw_memcpy(outbuf, pEvntData, BytesTransferred);
			nt_status = STATUS_SUCCESS;
		}
		RTPRINT(FIOCTL, IOCTL_BT_EVENT_DETAIL, ("BT event, %d bytes data Transferred!!\n", BytesTransferred));
		RTPRINT_DATA(FIOCTL, (IOCTL_BT_EVENT_DETAIL|IOCTL_BT_LOGO), "BT EVENT Hex Data :\n",
			outbuf, BytesTransferred);

		IOCTL_CompleteSingleIRP(pIrp, nt_status, BytesTransferred);
		if (nt_status == STATUS_SUCCESS)
			rt_status = RT_STATUS_SUCCESS;
	}

#endif // PLATFORM_WINDOWS

	RTPRINT(FIOCTL, IOCTL_BT_EVENT_DETAIL, ("BT event end, %s\n",
		(rt_status == RT_STATUS_SUCCESS)? "SUCCESS":"FAIL"));

	return rt_status;
}

// ===== Below this line is sync from SD7 driver COMMOM/bt_hci.c =====

u8	testPMK[PMK_LEN] = {2,2,3,3,4,4,5,5,6,6,
							7,7,8,8,9,9,2,2,3,3,
							4,4,2,2,8,8,9,9,2,2,
							5,5};

u8 bthci_GetLocalChannel(PADAPTER padapter)
{
	return padapter->mlmeextpriv.cur_channel;
}

u8 bthci_GetCurrentEntryNum(PADAPTER padapter, u8 PhyHandle)
{
	PBT30Info pBTInfo = GET_BT_INFO(padapter);
	u8 i;

	for (i = 0; i < MAX_BT_ASOC_ENTRY_NUM; i++)
	{
		if ((pBTInfo->BtAsocEntry[i].bUsed == _TRUE) && (pBTInfo->BtAsocEntry[i].PhyLinkCmdData.BtPhyLinkhandle == PhyHandle))
		{
			return i;
		}
	}

	return 0xFF;
}

void bthci_DecideBTChannel(PADAPTER padapter, u8 EntryNum)
{
//	PMGNT_INFO pMgntInfo = &padapter->MgntInfo;
	struct mlme_priv *pmlmepriv;
	PBT30Info pBTInfo;
	PBT_MGNT pBtMgnt;
	PBT_HCI_INFO pBtHciInfo;
	PCHNL_TXPOWER_TRIPLE pTriple_subband = NULL;
	PCOMMON_TRIPLE pTriple;
	u8 i, j, localchnl, firstRemoteLegalChnlInTriplet=0, regulatory_skipLen=0;
	u8 subbandTripletCnt = 0;


	pmlmepriv = &padapter->mlmepriv;
	pBTInfo = GET_BT_INFO(padapter);
	pBtMgnt = &pBTInfo->BtMgnt;
	pBtHciInfo = &pBTInfo->BtHciInfo;

	pBtMgnt->CheckChnlIsSuit = _TRUE;
	localchnl = bthci_GetLocalChannel(padapter);

	{
#if 0	// for debug only
		pTriple = (PCOMMON_TRIPLE)&(pBtHciInfo->BTPreChnllist[COUNTRY_STR_LEN]);

		// contains country string len is 3
		for (i=0; i<(pBtHciInfo->BtPreChnlListLen-COUNTRY_STR_LEN); i+=3, pTriple++)
		{
			DbgPrint("pTriple->byte_1st = %d, pTriple->byte_2nd = %d, pTriple->byte_3rd = %d\n",
				pTriple->byte_1st, pTriple->byte_2nd, pTriple->byte_3rd);
		}
#endif
		pTriple = (PCOMMON_TRIPLE)&(pBtHciInfo->BTPreChnllist[COUNTRY_STR_LEN]);

		// contains country string, len is 3
		for (i = 0; i < (pBtHciInfo->BtPreChnlListLen-COUNTRY_STR_LEN); i+=3, pTriple++)
		{
			//
			// check every triplet, an triplet may be
			// regulatory extension identifier or sub-band triplet
			//
			if (pTriple->byte_1st == 0xc9)	// Regulatory Extension Identifier, skip it
			{
				RTPRINT(FIOCTL, (IOCTL_BT_HCICMD|IOCTL_BT_LOGO), ("Find Regulatory ID, regulatory class = %d\n", pTriple->byte_2nd));
				regulatory_skipLen += 3;
				pTriple_subband = NULL;
				continue;
			}
			else							// Sub-band triplet
			{
				RTPRINT(FIOCTL, (IOCTL_BT_HCICMD|IOCTL_BT_LOGO), ("Find Sub-band triplet \n"));
				subbandTripletCnt++;
				pTriple_subband = (PCHNL_TXPOWER_TRIPLE)pTriple;
				//
				// if remote first legal channel not found, then find first remote channel
				// and it's legal for our channel plan.
				//

				// search the sub-band triplet and find if remote channel is legal to our channel plan.
				for (j = pTriple_subband->FirstChnl; j < (pTriple_subband->FirstChnl+pTriple_subband->NumChnls); j++)
				{
					RTPRINT(FIOCTL, (IOCTL_BT_HCICMD|IOCTL_BT_LOGO), (" Check if chnl(%d) is legal\n", j));
					if (BT_IsLegalChannel(padapter, j))	// remote channel is legal for our channel plan.
					{
						firstRemoteLegalChnlInTriplet = j;
						RTPRINT(FIOCTL, (IOCTL_BT_HCICMD|IOCTL_BT_LOGO), ("Find first remote legal channel : %d\n", firstRemoteLegalChnlInTriplet));

						//
						// If we find a remote legal channel in the sub-band triplet
						// and only BT connection is established(local not connect to any AP or IBSS),
						// then we just switch channel to remote channel.
						//
					#if 0
						if (!MgntRoamingInProgress(pMgntInfo) &&
							!MgntIsLinkInProgress(pMgntInfo) &&
							!MgntScanInProgress(pMgntInfo))
					#endif
						{
#if 0
							if (!(pMgntInfo->mAssoc ||
								pMgntInfo->mIbss ||
								IsAPModeExist(padapter)||
								BTHCI_HsConnectionEstablished(padapter)))
#else
							if (!(check_fwstate(pmlmepriv, WIFI_ASOC_STATE|WIFI_ADHOC_STATE|WIFI_AP_STATE) == _TRUE ||
								BTHCI_HsConnectionEstablished(padapter)))
#endif
							{
								pBtMgnt->BTChannel = firstRemoteLegalChnlInTriplet;
								RTPRINT(FIOCTL, (IOCTL_BT_HCICMD|IOCTL_BT_LOGO), ("Remote legal channel (%d) is selected, Local not connect to any!!\n", pBtMgnt->BTChannel));
								return;
							}
							else
							{
								if ((localchnl >= firstRemoteLegalChnlInTriplet) &&
									(localchnl < (pTriple_subband->FirstChnl+pTriple_subband->NumChnls)))
								{
									pBtMgnt->BTChannel = localchnl;
									RTPRINT(FIOCTL, (IOCTL_BT_HCICMD|IOCTL_BT_LOGO), ("Local channel (%d) is selected, wifi or BT connection exists\n", pBtMgnt->BTChannel));
									return;
								}
							}
						}
						break;
					}
				}
			}
		}

