acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
			}
			break;
		}
		case 3:
		{
			 if ((ServiceType == BT_LL_GU) && (MaxSDUSize == 1492))
			{
				match=_TRUE;
				RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("Logical Link Type =  TX guaranteed latency flowspec\n"));
			}
			else if ((ServiceType==BT_LL_GU) && (MaxSDUSize==2500))
			{
				RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("Logical Link Type =  TX guaranteed Large latency flowspec\n"));
			}
			break;
		}
		case 4:
		{
			if (ServiceType == BT_LL_BE)
			{
				if ((SDUInterArrivatime == 0xffffffff) && (ServiceType == BT_LL_BE) && (MaxSDUSize == 1492))
				{
					match = _TRUE;
					RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("Logical Link Type =  TX/RX aggregated best effort flowspec\n"));
				}
			}
			else if (ServiceType == BT_LL_GU)
			{
				if ((SDUInterArrivatime == 100) && 10000)
				{
					match = _TRUE;
					RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("Logical Link Type =  TX/RX guaranteed bandwidth flowspec\n"));
				}
			}
			break;
		}
		default:
		{
			RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("Logical Link Type =  Unknow Type !!!!!!!!\n"));
			break;
		}
	}

#if 0
	RTPRINT(FIOCTL, (IOCTL_BT_HCICMD|IOCTL_BT_LOGO), ("ID = 0x%x,	ServiceType = 0x%x, MaximumSDUSize = 0x%x, SDUInterArrivalTime  = 0x%lx, AccessLatency = 0x%lx, FlushTimeout = 0x%lx\n",
	TxFlowSpec.Identifier, TxFlowSpec.ServiceType, MaxSDUSize,SDUInterArrivatime, TxFlowSpec.AccessLatency, TxFlowSpec.FlushTimeout));
#else
	RTPRINT(FIOCTL, (IOCTL_BT_HCICMD|IOCTL_BT_LOGO), ("ID=0x%x, ServiceType=0x%x, MaximumSDUSize=0x%x, SDUInterArrivalTime=0x%x, AccessLatency=0x%x, FlushTimeout=0x%x\n",
	TxFlowSpec.Identifier, TxFlowSpec.ServiceType, MaxSDUSize, SDUInterArrivatime, TxFlowSpec.AccessLatency, TxFlowSpec.FlushTimeout));
#endif
	return match;
}

void
bthci_SelectFlowType(
	PADAPTER 					padapter,
	BT_LL_FLOWSPEC			TxLLFlowSpec,
	BT_LL_FLOWSPEC			RxLLFlowSpec,
	PHCI_FLOW_SPEC		TxFlowSpec,
	PHCI_FLOW_SPEC		RxFlowSpec
	)
{
	switch (TxLLFlowSpec)
	{
		case BT_TX_BE_FS:
		{
			TxFlowSpec->Identifier = 0x1;
			TxFlowSpec->ServiceType = BT_LL_BE;
			TxFlowSpec->MaximumSDUSize = 0xffff;
			TxFlowSpec->SDUInterArrivalTime = 0xffffffff;
			TxFlowSpec->AccessLatency = 0xffffffff;
			TxFlowSpec->FlushTimeout = 0xffffffff;
			break;
		}
		case BT_RX_BE_FS:
		{
			RxFlowSpec->Identifier = 0x2;
			RxFlowSpec->ServiceType = BT_LL_BE;
			RxFlowSpec->MaximumSDUSize = 0xffff;
			RxFlowSpec->SDUInterArrivalTime = 0xffffffff;
			RxFlowSpec->AccessLatency = 0xffffffff;
			RxFlowSpec->FlushTimeout = 0xffffffff;
			break;
		}
		case BT_TX_GU_FS:
		{
			TxFlowSpec->Identifier = 0x3;
			TxFlowSpec->ServiceType = BT_LL_GU;
			TxFlowSpec->MaximumSDUSize = 1492;
			TxFlowSpec->SDUInterArrivalTime = 0xffffffff;
			TxFlowSpec->AccessLatency = 10000;
			TxFlowSpec->FlushTimeout = 10000;
			break;
		}
		case BT_RX_GU_FS:
		{
			RxFlowSpec->Identifier = 0x1;
			RxFlowSpec->ServiceType = BT_LL_GU;
			RxFlowSpec->MaximumSDUSize = 0xffff;
			RxFlowSpec->SDUInterArrivalTime = 0xffffffff;
			RxFlowSpec->AccessLatency = 10000;
			RxFlowSpec->FlushTimeout = 10000;
			break;
		}
		case BT_TX_BE_AGG_FS:
		{
			TxFlowSpec->Identifier = 0x4;
			TxFlowSpec->ServiceType = BT_LL_BE;
			TxFlowSpec->MaximumSDUSize = 1492;
			TxFlowSpec->SDUInterArrivalTime = 0xffffffff;
			TxFlowSpec->AccessLatency = 0xffffffff;
			TxFlowSpec->FlushTimeout = 0xffffffff;
			break;
		}
		case BT_RX_BE_AGG_FS:
		{
			RxFlowSpec->Identifier = 0x4;
			RxFlowSpec->ServiceType = BT_LL_BE;
			RxFlowSpec->MaximumSDUSize = 1492;
			RxFlowSpec->SDUInterArrivalTime = 0xffffffff;
			RxFlowSpec->AccessLatency = 0xffffffff;
			RxFlowSpec->FlushTimeout = 0xffffffff;
			break;
		}
		case BT_TX_GU_BW_FS:
		{
			TxFlowSpec->Identifier = 0x4;
			TxFlowSpec->ServiceType = BT_LL_GU;
			TxFlowSpec->MaximumSDUSize = 1492;
			TxFlowSpec->SDUInterArrivalTime = 100;
			TxFlowSpec->AccessLatency = 0xffffffff;
			TxFlowSpec->FlushTimeout = 0xffffffff;
			break;
		}
		case BT_RX_GU_BW_FS:
		{
			RxFlowSpec->Identifier = 0x4;
			RxFlowSpec->ServiceType = BT_LL_GU;
			RxFlowSpec->MaximumSDUSize = 1492;
			RxFlowSpec->SDUInterArrivalTime = 100;
			RxFlowSpec->AccessLatency = 0xffffffff;
			RxFlowSpec->FlushTimeout = 0xffffffff;
			break;
		}
		case BT_TX_GU_LARGE_FS:
		{
			TxFlowSpec->Identifier = 0x3;
			TxFlowSpec->ServiceType = BT_LL_GU;
			TxFlowSpec->MaximumSDUSize = 2500;
			TxFlowSpec->SDUInterArrivalTime = 0x1;
			TxFlowSpec->AccessLatency = 10000;
			TxFlowSpec->FlushTimeout = 10000;
			break;
		}
		case BT_RX_GU_LARGE_FS:
		{
			RxFlowSpec->Identifier = 0x1;
			RxFlowSpec->ServiceType = BT_LL_GU;
			RxFlowSpec->MaximumSDUSize = 2500;
			RxFlowSpec->SDUInterArrivalTime = 0x1;
			RxFlowSpec->AccessLatency = 10000;
			RxFlowSpec->FlushTimeout = 10000;
			break;
		}
		default:
			break;
	}

	switch (RxLLFlowSpec)
	{
		case BT_TX_BE_FS:
		{
			TxFlowSpec->Identifier = 0x1;
			TxFlowSpec->ServiceType = BT_LL_BE;
			TxFlowSpec->MaximumSDUSize = 0xffff;
			TxFlowSpec->SDUInterArrivalTime = 0xffffffff;
			TxFlowSpec->AccessLatency = 0xffffffff;
			TxFlowSpec->FlushTimeout = 0xffffffff;
			break;
		}
		case BT_RX_BE_FS:
		{
			RxFlowSpec->Identifier = 0x2;
			RxFlowSpec->ServiceType = BT_LL_BE;
			RxFlowSpec->MaximumSDUSize = 0xffff;
			RxFlowSpec->SDUInterArrivalTime = 0xffffffff;
			RxFlowSpec->AccessLatency = 0xffffffff;
			RxFlowSpec->FlushTimeout = 0xffffffff;
			break;
		}
		case BT_TX_GU_FS:
		{
			TxFlowSpec->Identifier = 0x3;
			TxFlowSpec->ServiceType = BT_LL_GU;
			TxFlowSpec->MaximumSDUSize = 1492;
			TxFlowSpec->SDUInterArrivalTime = 0xffffffff;
			TxFlowSpec->AccessLatency = 10000;
			TxFlowSpec->FlushTimeout = 10000;
			break;
		}
		case BT_RX_GU_FS:
		{
			RxFlowSpec->Identifier = 0x1;
			RxFlowSpec->ServiceType = BT_LL_GU;
			RxFlowSpec->MaximumSDUSize = 0xffff;
			RxFlowSpec->SDUInterArrivalTime = 0xffffffff;
			RxFlowSpec->AccessLatency = 10000;
			RxFlowSpec->FlushTimeout = 10000;
			break;
		}
		case BT_TX_BE_AGG_FS:
		{
			TxFlowSpec->Identifier = 0x4;
			TxFlowSpec->ServiceType = BT_LL_BE;
			TxFlowSpec->MaximumSDUSize = 1492;
			TxFlowSpec->SDUInterArrivalTime = 0xffffffff;
			TxFlowSpec->AccessLatency = 0xffffffff;
			TxFlowSpec->FlushTimeout = 0xffffffff;
			break;
		}
		case BT_RX_BE_AGG_FS:
		{
			RxFlowSpec->Identifier = 0x4;
			RxFlowSpec->ServiceType = BT_LL_BE;
			RxFlowSpec->MaximumSDUSize = 1492;
			RxFlowSpec->SDUInterArrivalTime = 0xffffffff;
			RxFlowSpec->AccessLatency = 0xffffffff;
			RxFlowSpec->FlushTimeout = 0xffffffff;
			break;
		}
		case BT_TX_GU_BW_FS:
		{
			TxFlowSpec->Identifier = 0x4;
			TxFlowSpec->ServiceType = BT_LL_GU;
			TxFlowSpec->MaximumSDUSize = 1492;
			TxFlowSpec->SDUInterArrivalTime = 100;
			TxFlowSpec->AccessLatency = 0xffffffff;
			TxFlowSpec->FlushTimeout = 0xffffffff;
			break;
		}
		case BT_RX_GU_BW_FS:
		{
			RxFlowSpec->Identifier = 0x4;
			RxFlowSpec->ServiceType = BT_LL_GU;
			RxFlowSpec->MaximumSDUSize = 1492;
			RxFlowSpec->SDUInterArrivalTime = 100;
			RxFlowSpec->AccessLatency = 0xffffffff;
			RxFlowSpec->FlushTimeout = 0xffffffff;
			break;
		}
		case BT_TX_GU_LARGE_FS:
		{
			TxFlowSpec->Identifier = 0x3;
			TxFlowSpec->ServiceType = BT_LL_GU;
			TxFlowSpec->MaximumSDUSize = 2500;
			TxFlowSpec->SDUInterArrivalTime = 0x1;
			TxFlowSpec->AccessLatency = 10000;
			TxFlowSpec->FlushTimeout = 10000;
			break;
		}
		case BT_RX_GU_LARGE_FS:
		{
			RxFlowSpec->Identifier = 0x1;
			RxFlowSpec->ServiceType = BT_LL_GU;
			RxFlowSpec->MaximumSDUSize = 2500;
			RxFlowSpec->SDUInterArrivalTime = 0x1;
			RxFlowSpec->AccessLatency = 10000;
			RxFlowSpec->FlushTimeout = 10000;
			break;
		}
		default:
			break;
	}
}

u16
bthci_AssocMACAddr(
	PADAPTER	padapter,
	void	*pbuf
	)
{
	PAMP_ASSOC_STRUCTURE pAssoStrc = (PAMP_ASSOC_STRUCTURE)pbuf;
/*
	u8	FakeAddress[6],i;

	for (i=0;i<6;i++)
	{
		FakeAddress[i]=i;
	}
*/
	pAssoStrc->TypeID = AMP_MAC_ADDR;
	pAssoStrc->Length = 0x06;
	//	_rtw_memcpy(&pAssoStrc->Data[0], Adapter->CurrentAddress, 6);
	_rtw_memcpy(&pAssoStrc->Data[0], padapter->eeprompriv.mac_addr, 6);
	//_rtw_memcpy(&pAssoStrc->Data[0], FakeAddress, 6);
	RTPRINT_DATA(FIOCTL, (IOCTL_BT_HCICMD|IOCTL_BT_HCICMD_DETAIL|IOCTL_BT_LOGO), ("AssocMACAddr : \n"), pAssoStrc, pAssoStrc->Length+3);

	return (pAssoStrc->Length+3);
}

u16
bthci_PALCapabilities(
	PADAPTER	padapter,
	void	*pbuf
	)
{
	PAMP_ASSOC_STRUCTURE pAssoStrc = (PAMP_ASSOC_STRUCTURE)pbuf;

