acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
u16 bthci_AssocPALVer(PADAPTER padapter, void *pbuf)
{
	PAMP_ASSOC_STRUCTURE pAssoStrc = (PAMP_ASSOC_STRUCTURE)pbuf;
	u8 *pu1Tmp;
	u16	*pu2Tmp;

	pAssoStrc->TypeID = AMP_80211_PAL_VISION;
	pAssoStrc->Length = 0x5;
	pu1Tmp = &pAssoStrc->Data[0];
	*pu1Tmp = 0x1;	// PAL Version
	pu2Tmp = (u16*)&pAssoStrc->Data[1];
	*pu2Tmp = 0x5D;	// SIG Company identifier of 802.11 PAL vendor
	pu2Tmp = (u16*)&pAssoStrc->Data[3];
	*pu2Tmp = 0x1;	// PAL Sub-version specifier

	RTPRINT_DATA(FIOCTL, IOCTL_BT_HCICMD_DETAIL, ("AssocPALVer : \n"), pAssoStrc, pAssoStrc->Length+3);
	RTPRINT(FIOCTL, IOCTL_BT_LOGO, ("AssocPALVer \n"));

	RTPRINT(FIOCTL, IOCTL_BT_LOGO, (" TypeID = 0x%x,\n Length = 0x%x,\n PAL Version = 0x01,\n PAL vendor = 0x01,\n PAL Sub-version specifier = 0x01\n",
		pAssoStrc->TypeID,
		pAssoStrc->Length));
	return (pAssoStrc->Length+3);
}

u16
bthci_ReservedForTestingPLV(
	PADAPTER	padapter,
	void	*pbuf
	)
{
	PAMP_ASSOC_STRUCTURE pAssoStrc = (PAMP_ASSOC_STRUCTURE)pbuf;

	pAssoStrc->TypeID = AMP_RESERVED_FOR_TESTING;
	pAssoStrc->Length = 0x10;

	pAssoStrc->Data[0] = 0x00;
	pAssoStrc->Data[1] = 0x01;
	pAssoStrc->Data[2] = 0x02;
	pAssoStrc->Data[3] = 0x03;
	pAssoStrc->Data[4] = 0x04;
	pAssoStrc->Data[5] = 0x05;
	pAssoStrc->Data[6] = 0x06;
	pAssoStrc->Data[7] = 0x07;
	pAssoStrc->Data[8] = 0x08;
	pAssoStrc->Data[9] = 0x09;
	pAssoStrc->Data[10] = 0x0a;
	pAssoStrc->Data[11] = 0x0b;
	pAssoStrc->Data[12] = 0x0c;
	pAssoStrc->Data[13] = 0x0d;
	pAssoStrc->Data[14] = 0x0e;
	pAssoStrc->Data[15] = 0x0f;

	return (pAssoStrc->Length+3);
}

u8 bthci_CheckRfStateBeforeConnect(PADAPTER padapter)
{
	PBT30Info				pBTInfo;
	rt_rf_power_state 		RfState;


	pBTInfo = GET_BT_INFO(padapter);

//	rtw_hal_get_hwreg(padapter, HW_VAR_RF_STATE, (u8*)(&RfState));
	RfState = padapter->pwrctrlpriv.rf_pwrstate;

	if (RfState != rf_on)
	{
		PlatformSetTimer(padapter, &pBTInfo->BTPsDisableTimer, 50);
		return _FALSE;
	}

	return _TRUE;
}

u8
bthci_ConstructScanList(
	PBT30Info		pBTInfo,
	u8			*pChannels,
	u8			*pNChannels,
	PRT_SCAN_TYPE	pScanType,
	u16			*pDuration
	)
{
	PADAPTER				padapter;
	PBT_HCI_INFO				pBtHciInfo;
	PCHNL_TXPOWER_TRIPLE	pTriple_subband;
	PCOMMON_TRIPLE			pTriple;
	u8					chnl, i, j, tripleLetsCnt=0;


	padapter = pBTInfo->padapter;
	pBtHciInfo = &pBTInfo->BtHciInfo;
	*pNChannels = 0;
	*pScanType = SCAN_ACTIVE;
	*pDuration = 200;

	pTriple = (PCOMMON_TRIPLE)&(pBtHciInfo->BTPreChnllist[COUNTRY_STR_LEN]);

	// contains country string, len is 3
	for (i = 0; i < (pBtHciInfo->BtPreChnlListLen-COUNTRY_STR_LEN); i+=3, pTriple++)
	{
		if (pTriple->byte_1st == 0xc9)	// Regulatory Extension Identifier, skip it
			continue;
		else							// Sub-band triplet
		{
			tripleLetsCnt++;
			pTriple_subband = (PCHNL_TXPOWER_TRIPLE)pTriple;

			// search the sub-band triplet and find if remote channel is legal to our channel plan.
			for (chnl = pTriple_subband->FirstChnl; chnl < (pTriple_subband->FirstChnl+pTriple_subband->NumChnls); chnl++)
			{
				if (BT_IsLegalChannel(padapter, chnl))	// remote channel is legal for our channel plan.
				{
					//DbgPrint("cosa insert chnl(%d) into scan list\n", chnl);
					pChannels[*pNChannels] = chnl;
					(*pNChannels)++;
				}
			}
		}
	}

	if (tripleLetsCnt == 0)
	{
		// Fill chnl 1~ chnl 11
		for (chnl=1; chnl<12; chnl++)
		{
			//DbgPrint("cosa insert chnl(%d) into scan list\n", chnl);
			pChannels[*pNChannels] = chnl;
			(*pNChannels)++;
		}
	}

	if (*pNChannels == 0)
		return _FALSE;
	else
		return _TRUE;
}

void bthci_ResponderStartToScan(PADAPTER padapter)
{
#if 0
	static u8		Buf[512];
	PMGNT_INFO		pMgntInfo = &(padapter->MgntInfo);
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	u8			*pProbeReq = Buf + FIELD_OFFSET(CUSTOMIZED_SCAN_REQUEST, ProbeReqBuf);
	u16			*pProbeReqLen = (u16*)(Buf + FIELD_OFFSET(CUSTOMIZED_SCAN_REQUEST, ProbeReqLen));
	PCUSTOMIZED_SCAN_REQUEST pScanReq = (PCUSTOMIZED_SCAN_REQUEST)Buf;
	u8			i;

	pBtMgnt->JoinerNeedSendAuth=_TRUE;
	pMgntInfo->SettingBeforeScan.WirelessMode = pMgntInfo->dot11CurrentWirelessMode;
	pMgntInfo->SettingBeforeScan.ChannelNumber = pMgntInfo->dot11CurrentChannelNumber;
	pMgntInfo->SettingBeforeScan.ChannelBandwidth = (HT_CHANNEL_WIDTH)pMgntInfo->pHTInfo->bCurBW40MHz;
	pMgntInfo->SettingBeforeScan.ExtChnlOffset = pMgntInfo->pHTInfo->CurSTAExtChnlOffset;
	RTPRINT(FIOCTL, IOCTL_STATE, ("[Bt scan], responder start the scan process!!\n"));

	pScanReq->bEnabled = _TRUE;
	pScanReq->DataRate = MGN_6M;

	BTPKT_ConstructProbeRequest(
			padapter,
			pProbeReq,
			pProbeReqLen);

	bthci_ConstructScanList(pBTInfo,
		pScanReq->Channels,
		&pScanReq->nChannels,
		&pScanReq->ScanType,
		&pScanReq->Duration);

	RTPRINT(FIOCTL, IOCTL_STATE, ("[Bt scan], scan channel list =["));
	for (i=0; i<pScanReq->nChannels; i++)
	{
		if (i == pScanReq->nChannels-1)
		{
			RTPRINT(FIOCTL, IOCTL_STATE, ("%d", pScanReq->Channels[i]));
		}
		else
		{
			RTPRINT(FIOCTL, IOCTL_STATE, ("%d, \n", pScanReq->Channels[i]));
		}
	}
	RTPRINT(FIOCTL, IOCTL_STATE, ("]\n"));

	RTPRINT(FIOCTL, IOCTL_STATE, ("[Bt scan], customized scan started!!\n"));
	pBtMgnt->bBtScan = _TRUE;
	MgntActSet_802_11_CustomizedScanRequest((GetDefaultAdapter(padapter)), pScanReq);
#endif
}

u8
bthci_PhyLinkConnectionInProgress(
	PADAPTER	padapter,
	u8		PhyLinkHandle
	)
{
	PBT30Info	pBTInfo;
	PBT_MGNT	pBtMgnt;


	pBTInfo = GET_BT_INFO(padapter);
	pBtMgnt = &pBTInfo->BtMgnt;

	if (pBtMgnt->bPhyLinkInProgress &&
		(pBtMgnt->BtCurrentPhyLinkhandle == PhyLinkHandle))
	{
		return _TRUE;
	}
	return _FALSE;
}

void
bthci_ResetFlowSpec(
	PADAPTER	padapter,
	u8	EntryNum,
	u8	index
	)
{
	PBT30Info	pBTinfo;


	pBTinfo = GET_BT_INFO(padapter);

	pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[index].BtLogLinkhandle = 0;
	pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[index].BtPhyLinkhandle = 0;
	pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[index].bLLCompleteEventIsSet = _FALSE;
	pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[index].bLLCancelCMDIsSetandComplete = _FALSE;
	pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[index].BtTxFlowSpecID = 0;
	pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[index].TxPacketCount = 0;

	pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[index].Tx_Flow_Spec.Identifier = 0x01;
	pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[index].Tx_Flow_Spec.ServiceType = SERVICE_BEST_EFFORT;
	pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[index].Tx_Flow_Spec.MaximumSDUSize = 0xffff;
	pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[index].Tx_Flow_Spec.SDUInterArrivalTime = 0xffffffff;
	pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[index].Tx_Flow_Spec.AccessLatency = 0xffffffff;
	pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[index].Tx_Flow_Spec.FlushTimeout = 0xffffffff;

	pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[index].Rx_Flow_Spec.Identifier = 0x01;
	pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[index].Rx_Flow_Spec.ServiceType = SERVICE_BEST_EFFORT;
	pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[index].Rx_Flow_Spec.MaximumSDUSize = 0xffff;
	pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[index].Rx_Flow_Spec.SDUInterArrivalTime = 0xffffffff;
	pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[index].Rx_Flow_Spec.AccessLatency = 0xffffffff;
	pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[index].Rx_Flow_Spec.FlushTimeout = 0xffffffff;
}

void bthci_ResetEntry(PADAPTER padapter, u8 EntryNum)
{
	PBT30Info		pBTinfo;
	PBT_MGNT		pBtMgnt;
	u8	j;


	pBTinfo = GET_BT_INFO(padapter);
	pBtMgnt = &pBTinfo->BtMgnt;

	pBTinfo->BtAsocEntry[EntryNum].bUsed=_FALSE;
	pBTinfo->BtAsocEntry[EntryNum].BtCurrentState=HCI_STATE_DISCONNECTED;
	pBTinfo->BtAsocEntry[EntryNum].BtNextState=HCI_STATE_DISCONNECTED;

	pBTinfo->BtAsocEntry[EntryNum].AmpAsocCmdData.AMPAssocRemLen=0;
	pBTinfo->BtAsocEntry[EntryNum].AmpAsocCmdData.BtPhyLinkhandle = 0;
	if (pBTinfo->BtAsocEntry[EntryNum].AmpAsocCmdData.AMPAssocfragment != NULL)
	{
		_rtw_memset(pBTinfo->BtAsocEntry[EntryNum].AmpAsocCmdData.AMPAssocfragment, 0, TOTAL_ALLOCIATE_ASSOC_LEN);
	}
	pBTinfo->BtAsocEntry[EntryNum].AmpAsocCmdData.LenSoFar=0;

	pBTinfo->BtAsocEntry[EntryNum].PhyLinkCmdData.BtAMPKeyType = 0;
	pBTinfo->BtAsocEntry[EntryNum].PhyLinkCmdData.BtPhyLinkhandle = 0;
	_rtw_memset(pBTinfo->BtAsocEntry[EntryNum].PhyLinkCmdData.BtAMPKey, 0, pBTinfo->BtAsocEntry[EntryNum].PhyLinkCmdData.BtAMPKeyLen);
	pBTinfo->BtAsocEntry[EntryNum].PhyLinkCmdData.BtAMPKeyLen=0;

	pBTinfo->BtAsocEntry[EntryNum].PhyLinkCmdData.LinkSuperversionTimeout=0x3e80;//0x640; //0.625ms*1600=1000ms, 0.625ms*16000=10000ms

	pBTinfo->BtAsocEntry[EntryNum].AMPRole = AMP_BTAP_NONE;

	pBTinfo->BtAsocEntry[EntryNum].mAssoc=_FALSE;
	pBTinfo->BtAsocEntry[EntryNum].b4waySuccess = _FALSE;

	// Reset BT WPA
	pBTinfo->BtAsocEntry[EntryNum].KeyReplayCounter = 0;
	pBTinfo->BtAsocEntry[EntryNum].BTWPAAuthState = STATE_WPA_AUTH_UNINITIALIZED;

	pBTinfo->BtAsocEntry[EntryNum].bSendSupervisionPacket=_FALSE;
	pBTinfo->BtAsocEntry[EntryNum].NoRxPktCnt=0;
	pBTinfo->BtAsocEntry[EntryNum].ShortRangeMode = 0;
	pBTinfo->BtAsocEntry[EntryNum].rxSuvpPktCnt = 0;

	for (j=0; j<MAX_LOGICAL_LINK_NUM; j++)
	{
		bthci_ResetFlowSpec(padapter, EntryNum, j);
	}

	pBtMgnt->BTAuthCount = 0;
	pBtMgnt->BTAsocCount = 0;
	pBtMgnt->BTCurrentConnectType = BT_DISCONNECT;
	pBtMgnt->BTReceiveConnectPkt = BT_DISCONNECT;

	HALBT_RemoveKey(padapter, EntryNum);
}

void
bthci_RemoveEntryByEntryNum(
	PADAPTER 	padapter,
	u8		EntryNum
	)
{
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;

	bthci_ResetEntry(padapter, EntryNum);

	if (pBtMgnt->CurrentBTConnectionCnt>0)
		pBtMgnt->CurrentBTConnectionCnt--;

	RTPRINT(FIOCTL, IOCTL_STATE, ("[BT Flag], CurrentBTConnectionCnt = %d!!\n",
		pBtMgnt->CurrentBTConnectionCnt));

