acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
		bthci_IndicateEvent(padapter, PPacketIrpEvent, len+2);
	}
	return status;
}

//
// BT 3.0+HS [Vol 2] 7.4.1
//
HCI_STATUS
bthci_CmdReadLocalVersionInformation(
	PADAPTER 	padapter
	)
{
	HCI_STATUS status = HCI_STATUS_SUCCESS;

	//send command complete event here when all data are received.
	{
		//PVOID buffer = padapter->IrpHCILocalbuf.Ptr;
		u8 localBuf[TmpLocalBufSize] = "";
		u8 *pRetPar;
		u8 len = 0;
		PPACKET_IRP_HCIEVENT_DATA PPacketIrpEvent;
		u16 *pu2Temp;

		PlatformZeroMemory(&localBuf[0], TmpLocalBufSize);
		//PPacketIrpEvent = (PPACKET_IRP_HCIEVENT_DATA)(buffer);
		PPacketIrpEvent = (PPACKET_IRP_HCIEVENT_DATA)(&localBuf[0]);

		len += bthci_CommandCompleteHeader(&localBuf[0],
			OGF_INFORMATIONAL_PARAMETERS,
			HCI_READ_LOCAL_VERSION_INFORMATION,
			status);

		// Return parameters starts from here
		pRetPar = &PPacketIrpEvent->Data[len];
		pRetPar[0] = status;		//status
		pRetPar[1] = 0x05;					// HCI_Version
		pu2Temp = (u16*)&pRetPar[2];		// HCI_Revision
		*pu2Temp = 0x0001;
		pRetPar[4] = 0x05;					// LMP/PAL_Version
		pu2Temp = (u16*)&pRetPar[5];		// Manufacturer_Name
		*pu2Temp = 0x005d;
		pu2Temp = (u16*)&pRetPar[7];		// LMP/PAL_Subversion
		*pu2Temp = 0x0001;
		len += 9;
		PPacketIrpEvent->Length = len;

		RTPRINT(FIOCTL, (IOCTL_BT_HCICMD_DETAIL|IOCTL_BT_LOGO), ("LOCAL_VERSION_INFORMATION\n"));
		RTPRINT(FIOCTL, (IOCTL_BT_HCICMD_DETAIL|IOCTL_BT_LOGO), ("Status  %x\n",status));
		RTPRINT(FIOCTL, (IOCTL_BT_HCICMD_DETAIL|IOCTL_BT_LOGO), ("HCI_Version = 0x05\n"));
		RTPRINT(FIOCTL, (IOCTL_BT_HCICMD_DETAIL|IOCTL_BT_LOGO), ("HCI_Revision = 0x0001\n"));
		RTPRINT(FIOCTL, (IOCTL_BT_HCICMD_DETAIL|IOCTL_BT_LOGO), ("LMP/PAL_Version = 0x05\n"));
		RTPRINT(FIOCTL, (IOCTL_BT_HCICMD_DETAIL|IOCTL_BT_LOGO), ("Manufacturer_Name = 0x0001\n"));
		RTPRINT(FIOCTL, (IOCTL_BT_HCICMD_DETAIL|IOCTL_BT_LOGO), ("LMP/PAL_Subversion = 0x0001\n"));

		bthci_IndicateEvent(padapter, PPacketIrpEvent, len+2);
	}

	return status;
}

//7.4.7
HCI_STATUS bthci_CmdReadDataBlockSize(PADAPTER padapter)
{
	HCI_STATUS			status = HCI_STATUS_SUCCESS;

	{
		//PVOID buffer = padapter->IrpHCILocalbuf.Ptr;
		u8 localBuf[TmpLocalBufSize] = "";
		u8 *pRetPar;
		u8 len = 0;
		PPACKET_IRP_HCIEVENT_DATA PPacketIrpEvent;
		u16 *pu2Temp;

		PlatformZeroMemory(&localBuf[0], TmpLocalBufSize);
		//PPacketIrpEvent = (PPACKET_IRP_HCIEVENT_DATA)(buffer);
		PPacketIrpEvent = (PPACKET_IRP_HCIEVENT_DATA)(&localBuf[0]);

		len += bthci_CommandCompleteHeader(&localBuf[0],
			OGF_INFORMATIONAL_PARAMETERS,
			HCI_READ_DATA_BLOCK_SIZE,
			status);

		// Return parameters starts from here
		pRetPar = &PPacketIrpEvent->Data[len];
		pRetPar[0] = HCI_STATUS_SUCCESS;		//status
		pu2Temp = (u16*)&pRetPar[1];		// Max_ACL_Data_Packet_Length
		*pu2Temp = Max80211PALPDUSize;

		pu2Temp = (u16*)&pRetPar[3];		// Data_Block_Length
		*pu2Temp = Max80211PALPDUSize;
		pu2Temp = (u16*)&pRetPar[5];		// Total_Num_Data_Blocks
		*pu2Temp = BTTotalDataBlockNum;
		len += 7;
		PPacketIrpEvent->Length = len;

		bthci_IndicateEvent(padapter, PPacketIrpEvent, len+2);
	}

	return status;
}

// 7.4.5
HCI_STATUS
bthci_CmdReadBufferSize(
	PADAPTER 					padapter
	)
{
	HCI_STATUS			status = HCI_STATUS_SUCCESS;

	{
		//PVOID buffer = padapter->IrpHCILocalbuf.Ptr;
		u8 localBuf[TmpLocalBufSize] = "";
		u8 *pRetPar;
		u8 len = 0;
		PPACKET_IRP_HCIEVENT_DATA PPacketIrpEvent;
		u16 *pu2Temp;

		PlatformZeroMemory(&localBuf[0], TmpLocalBufSize);
		//PPacketIrpEvent = (PPACKET_IRP_HCIEVENT_DATA)(buffer);
		PPacketIrpEvent = (PPACKET_IRP_HCIEVENT_DATA)(&localBuf[0]);

		len += bthci_CommandCompleteHeader(&localBuf[0],
			OGF_INFORMATIONAL_PARAMETERS,
			HCI_READ_BUFFER_SIZE,
			status);
		RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("Synchronous_Data_Packet_Length = 0x%x\n", BTSynDataPacketLength));
		RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("Total_Num_ACL_Data_Packets = 0x%x\n", BTTotalDataBlockNum));
		RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("Total_Num_Synchronous_Data_Packets = 0x%x\n", BTTotalDataBlockNum));
		// Return parameters starts from here
		pRetPar = &PPacketIrpEvent->Data[len];
		pRetPar[0] = status;		//status
		pu2Temp = (u16*)&pRetPar[1];		// HC_ACL_Data_Packet_Length
		*pu2Temp = Max80211PALPDUSize;

		pRetPar[3] = BTSynDataPacketLength;	// HC_Synchronous_Data_Packet_Length
		pu2Temp = (u16*)&pRetPar[4];		// HC_Total_Num_ACL_Data_Packets
		*pu2Temp = BTTotalDataBlockNum;
		pu2Temp = (u16*)&pRetPar[6];		// HC_Total_Num_Synchronous_Data_Packets
		*pu2Temp = BTTotalDataBlockNum;
		len += 8;
		PPacketIrpEvent->Length = len;

		bthci_IndicateEvent(padapter, PPacketIrpEvent, len+2);
	}

	return status;
}

HCI_STATUS
bthci_CmdReadLocalAMPInfo(
	PADAPTER 					padapter
	)
{
	HCI_STATUS			status = HCI_STATUS_SUCCESS;

	{
//		PMGNT_INFO pMgntInfo = &padapter->MgntInfo;
		struct pwrctrl_priv *ppwrctrl = &padapter->pwrctrlpriv;
		u8 localBuf[TmpLocalBufSize] = "";
		u8 *pRetPar;
		u8 len = 0;
		PPACKET_IRP_HCIEVENT_DATA PPacketIrpEvent;
		u16 *pu2Temp;
		u32 *pu4Temp;
		u32	TotalBandwidth=BTTOTALBANDWIDTH, MaxBandGUBandwidth=BTMAXBANDGUBANDWIDTH;
		u8	ControlType=0x01, AmpStatus=0x01;
		u32	MaxFlushTimeout=10000, BestEffortFlushTimeout=5000;
		u16 MaxPDUSize=Max80211PALPDUSize, PalCap=0x1, AmpAssocLen=Max80211AMPASSOCLen, MinLatency=20;

		if ((ppwrctrl->rfoff_reason & RF_CHANGE_BY_HW) ||
			(ppwrctrl->rfoff_reason & RF_CHANGE_BY_SW))
		{
			AmpStatus = AMP_STATUS_NO_CAPACITY_FOR_BT;
		}

		PlatformZeroMemory(&localBuf[0], TmpLocalBufSize);
		//PPacketIrpEvent = (PPACKET_IRP_HCIEVENT_DATA)(buffer);
		PPacketIrpEvent = (PPACKET_IRP_HCIEVENT_DATA)(&localBuf[0]);

		len += bthci_CommandCompleteHeader(&localBuf[0],
			OGF_STATUS_PARAMETERS,
			HCI_READ_LOCAL_AMP_INFO,
			status);

		// Return parameters starts from here
		pRetPar = &PPacketIrpEvent->Data[len];
		pRetPar[0] = status;		//status
		pRetPar[1] = AmpStatus;						// AMP_Status
		pu4Temp = (u32*)&pRetPar[2];		// Total_Bandwidth
		*pu4Temp = TotalBandwidth;//0x19bfcc00;//0x7530;
		pu4Temp = (u32*)&pRetPar[6];		// Max_Guaranteed_Bandwidth
		*pu4Temp = MaxBandGUBandwidth;//0x19bfcc00;//0x4e20;
		pu4Temp = (u32*)&pRetPar[10];		// Min_Latency
		*pu4Temp = MinLatency;//150;
		pu4Temp = (u32*)&pRetPar[14];		// Max_PDU_Size
		*pu4Temp = MaxPDUSize;
		pRetPar[18] = ControlType;					// Controller_Type
		pu2Temp = (u16*)&pRetPar[19];		// PAL_Capabilities
		*pu2Temp = PalCap;
		pu2Temp = (u16*)&pRetPar[21];		// AMP_ASSOC_Length
		*pu2Temp = AmpAssocLen;
		pu4Temp = (u32*)&pRetPar[23];		// Max_Flush_Timeout
		*pu4Temp = MaxFlushTimeout;
		pu4Temp = (u32*)&pRetPar[27];		// Best_Effort_Flush_Timeout
		*pu4Temp = BestEffortFlushTimeout;
		len += 31;
		PPacketIrpEvent->Length = len;
		RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("AmpStatus = 0x%x\n",
			AmpStatus));
		RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("TotalBandwidth = 0x%x, MaxBandGUBandwidth = 0x%x, MinLatency = 0x%x, \n MaxPDUSize = 0x%x, ControlType = 0x%x\n",
			TotalBandwidth,MaxBandGUBandwidth,MinLatency,MaxPDUSize,ControlType));
		RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("PalCap = 0x%x, AmpAssocLen = 0x%x, MaxFlushTimeout = 0x%x, BestEffortFlushTimeout = 0x%x\n",
			PalCap,AmpAssocLen,MaxFlushTimeout,BestEffortFlushTimeout));
		bthci_IndicateEvent(padapter, PPacketIrpEvent, len+2);
	}

