acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
	}
	BTHCI_UpdateBTProfileRTKToMoto(padapter);
	{
		u8 localBuf[6] = "";
		u8 *pRetPar;
		u8 len = 0;
		PPACKET_IRP_HCIEVENT_DATA PPacketIrpEvent;

		PPacketIrpEvent = (PPACKET_IRP_HCIEVENT_DATA)(&localBuf[0]);

		len += bthci_CommandCompleteHeader(&localBuf[0],
			OGF_EXTENSION,
			HCI_LINK_STATUS_NOTIFY,
			status);

		// Return parameters starts from here
		pRetPar = &PPacketIrpEvent->Data[len];
		pRetPar[0] = status;		//status

		len += 1;
		PPacketIrpEvent->Length = len;

		bthci_IndicateEvent(padapter, PPacketIrpEvent, len+2);
	}

	return status;
}

HCI_STATUS
bthci_CmdBtOperationNotify(
	PADAPTER	padapter,
	PPACKET_IRP_HCICMD_DATA 	pHciCmd
	)
{
	HCI_STATUS	status = HCI_STATUS_SUCCESS;
	PBT30Info	pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT	pBtMgnt = &pBTInfo->BtMgnt;

	RTPRINT_DATA(FIOCTL, IOCTL_BT_HCICMD_EXT, "Bt Operation notify, Hex Data :\n",
			&pHciCmd->Data[0], pHciCmd->Length);

	pBtMgnt->ExtConfig.btOperationCode = *((u8*)pHciCmd->Data);
	RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("btOperationCode = 0x%x\n", pBtMgnt->ExtConfig.btOperationCode));
	switch (pBtMgnt->ExtConfig.btOperationCode)
	{
		case HCI_BT_OP_NONE:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[bt operation] : Operation None!!\n"));
			break;
		case HCI_BT_OP_INQUIRY_START:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[bt operation] : Inquire start!!\n"));
			break;
		case HCI_BT_OP_INQUIRY_FINISH:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[bt operation] : Inquire finished!!\n"));
			break;
		case HCI_BT_OP_PAGING_START:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[bt operation] : Paging is started!!\n"));
			break;
		case HCI_BT_OP_PAGING_SUCCESS:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[bt operation] : Paging complete successfully!!\n"));
			break;
		case HCI_BT_OP_PAGING_UNSUCCESS:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[bt operation] : Paging complete unsuccessfully!!\n"));
			break;
		case HCI_BT_OP_PAIRING_START:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[bt operation] : Pairing start!!\n"));
			break;
		case HCI_BT_OP_PAIRING_FINISH:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[bt operation] : Pairing finished!!\n"));
			break;
		case HCI_BT_OP_BT_DEV_ENABLE:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[bt operation] : BT Device is enabled!!\n"));
			break;
		case HCI_BT_OP_BT_DEV_DISABLE:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[bt operation] : BT Device is disabled!!\n"));
			break;
		default:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[bt operation] : Unknown, error!!\n"));
			break;
	}
	BTDM_AdjustForBtOperation(padapter);
	{
		u8 localBuf[6] = "";
		u8 *pRetPar;
		u8 len = 0;
		PPACKET_IRP_HCIEVENT_DATA PPacketIrpEvent;

		PPacketIrpEvent = (PPACKET_IRP_HCIEVENT_DATA)(&localBuf[0]);

		len += bthci_CommandCompleteHeader(&localBuf[0],
			OGF_EXTENSION,
			HCI_BT_OPERATION_NOTIFY,
			status);

		// Return parameters starts from here
		pRetPar = &PPacketIrpEvent->Data[len];
		pRetPar[0] = status;		//status

		len += 1;
		PPacketIrpEvent->Length = len;

		bthci_IndicateEvent(padapter, PPacketIrpEvent, len+2);
	}

	return status;
}

HCI_STATUS
bthci_CmdEnableWifiScanNotify(
	PADAPTER	padapter,
	PPACKET_IRP_HCICMD_DATA 	pHciCmd
	)
{
	HCI_STATUS	status = HCI_STATUS_SUCCESS;
	PBT30Info	pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT	pBtMgnt = &pBTInfo->BtMgnt;

	RTPRINT_DATA(FIOCTL, IOCTL_BT_HCICMD_EXT, "Enable Wifi scan notify, Hex Data :\n",
			&pHciCmd->Data[0], pHciCmd->Length);

	pBtMgnt->ExtConfig.bEnableWifiScanNotify = *((u8*)pHciCmd->Data);
	RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("bEnableWifiScanNotify = %d\n", pBtMgnt->ExtConfig.bEnableWifiScanNotify));

	{
		u8 localBuf[6] = "";
		u8 *pRetPar;
		u8 len = 0;
		PPACKET_IRP_HCIEVENT_DATA PPacketIrpEvent;

		PPacketIrpEvent = (PPACKET_IRP_HCIEVENT_DATA)(&localBuf[0]);

		len += bthci_CommandCompleteHeader(&localBuf[0],
			OGF_EXTENSION,
			HCI_ENABLE_WIFI_SCAN_NOTIFY,
			status);

		// Return parameters starts from here
		pRetPar = &PPacketIrpEvent->Data[len];
		pRetPar[0] = status;		//status

		len += 1;
		PPacketIrpEvent->Length = len;

		bthci_IndicateEvent(padapter, PPacketIrpEvent, len+2);
	}

	return status;
}

HCI_STATUS
bthci_CmdWIFICurrentChannel(
	PADAPTER 	padapter,
	PPACKET_IRP_HCICMD_DATA		pHciCmd
	)
{
	HCI_STATUS status = HCI_STATUS_SUCCESS;
//	PMGNT_INFO pMgntInfo = &padapter->MgntInfo;
	struct mlme_ext_priv *pmlmeext = &padapter->mlmeextpriv;
//	u8		chnl = pMgntInfo->dot11CurrentChannelNumber;
	u8		chnl = pmlmeext->cur_channel;

//	if (pMgntInfo->pHTInfo->bCurBW40MHz == HT_CHANNEL_WIDTH_20_40)
	if (pmlmeext->cur_bwmode == HT_CHANNEL_WIDTH_40)
	{
//		if (pMgntInfo->pHTInfo->CurSTAExtChnlOffset == HT_EXTCHNL_OFFSET_UPPER)
		if (pmlmeext->cur_ch_offset == HAL_PRIME_CHNL_OFFSET_UPPER)
		{
			chnl += 2;
		}
//		else if (pMgntInfo->pHTInfo->CurSTAExtChnlOffset == HT_EXTCHNL_OFFSET_LOWER)
		else if (pmlmeext->cur_ch_offset == HAL_PRIME_CHNL_OFFSET_LOWER)
		{
			chnl -= 2;
		}
	}

	RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("Current Channel  = 0x%x\n", chnl));

	{
		u8 localBuf[8] = "";
		u8 *pRetPar;
		u8 len = 0;
		PPACKET_IRP_HCIEVENT_DATA PPacketIrpEvent;

		PPacketIrpEvent = (PPACKET_IRP_HCIEVENT_DATA)(&localBuf[0]);

		len += bthci_CommandCompleteHeader(&localBuf[0],
			OGF_EXTENSION,
			HCI_WIFI_CURRENT_CHANNEL,
			status);

		// Return parameters starts from here
		pRetPar = &PPacketIrpEvent->Data[len];
		pRetPar[0] = status;		//status
		pRetPar[1] = chnl;			//current channel
		len += 2;
		PPacketIrpEvent->Length = len;

		bthci_IndicateEvent(padapter, PPacketIrpEvent, len+2);
	}

	return status;
}

HCI_STATUS
bthci_CmdWIFICurrentBandwidth(
	PADAPTER 	padapter,
	PPACKET_IRP_HCICMD_DATA		pHciCmd
	)
{
	HCI_STATUS status = HCI_STATUS_SUCCESS;
	HT_CHANNEL_WIDTH bw;
	u8	CurrentBW = 0;


//	rtw_hal_get_hwreg(padapter, HW_VAR_BW_MODE, (u8*)(&bw));
	bw = padapter->mlmeextpriv.cur_bwmode;

	if (bw == HT_CHANNEL_WIDTH_20)
	{
		CurrentBW = 0;
	}
	else if (bw == HT_CHANNEL_WIDTH_40)
	{
		CurrentBW = 1;
	}

	RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("Current BW = 0x%x\n",
		CurrentBW));

	{
		u8 localBuf[8] = "";
		u8 *pRetPar;
		u8 len = 0;
		PPACKET_IRP_HCIEVENT_DATA PPacketIrpEvent;

		PPacketIrpEvent = (PPACKET_IRP_HCIEVENT_DATA)(&localBuf[0]);

		len += bthci_CommandCompleteHeader(&localBuf[0],
			OGF_EXTENSION,
			HCI_WIFI_CURRENT_BANDWIDTH,
			status);

		// Return parameters starts from here
		pRetPar = &PPacketIrpEvent->Data[len];
		pRetPar[0] = status;		//status
		pRetPar[1] = CurrentBW;		//current BW
		len += 2;
		PPacketIrpEvent->Length = len;

