acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
		case HCI_EXTENSION_VERSION_NOTIFY:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("HCI_EXTENSION_VERSION_NOTIFY\n"));
			status = bthci_CmdExtensionVersionNotify(padapter,pHciCmd);
			break;
		case HCI_LINK_STATUS_NOTIFY:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("HCI_LINK_STATUS_NOTIFY\n"));
			status = bthci_CmdLinkStatusNotify(padapter,pHciCmd);
			break;
		case HCI_BT_OPERATION_NOTIFY:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("HCI_BT_OPERATION_NOTIFY\n"));
			status = bthci_CmdBtOperationNotify(padapter,pHciCmd);
			break;
		case HCI_ENABLE_WIFI_SCAN_NOTIFY:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("HCI_ENABLE_WIFI_SCAN_NOTIFY\n"));
			status = bthci_CmdEnableWifiScanNotify(padapter,pHciCmd);
			break;

		//The following is for IVT
		case HCI_WIFI_CURRENT_CHANNEL:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("HCI_WIFI_CURRENT_CHANNEL\n"));
			status = bthci_CmdWIFICurrentChannel(padapter,pHciCmd);
			break;
		case HCI_WIFI_CURRENT_BANDWIDTH:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("HCI_WIFI_CURRENT_BANDWIDTH\n"));
			status = bthci_CmdWIFICurrentBandwidth(padapter,pHciCmd);
			break;
		case HCI_WIFI_CONNECTION_STATUS:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("HCI_WIFI_CONNECTION_STATUS\n"));
			status = bthci_CmdWIFIConnectionStatus(padapter,pHciCmd);
			break;

		default:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("HCI_UNKNOWN_COMMAND\n"));
			status = bthci_UnknownCMD(padapter, pHciCmd);
			break;
	}
	return status;
}

void
bthci_FakeCommand(
	PADAPTER 	padapter,
	u16	OGF,
	u16	OCF
	)
{
#define MAX_TMP_BUF_SIZE	200
	u8	buffer[MAX_TMP_BUF_SIZE];
	PPACKET_IRP_HCICMD_DATA pCmd=(PPACKET_IRP_HCICMD_DATA)buffer;

	PlatformZeroMemory(buffer, MAX_TMP_BUF_SIZE);

	pCmd->OGF = OGF;
	pCmd->OCF = OCF;

	if (OGF == OGF_LINK_CONTROL_COMMANDS && OCF == HCI_LOGICAL_LINK_CANCEL)
	{
		pCmd->Length = 2;
		pCmd->Data[0] = 1;		//physical link handle
		pCmd->Data[1] = 0x16;		//Tx_Flow_Spec_ID
		BTHCI_HandleHCICMD(padapter, (PPACKET_IRP_HCICMD_DATA)buffer);
	}
}

void
bthci_StateStarting(
	PADAPTER 					padapter,
	HCI_STATE_WITH_CMD		StateCmd,
	u8					EntryNum
	)
{
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;

	RTPRINT(FIOCTL, IOCTL_STATE, ("[BT state], [Starting], "));
	switch (StateCmd)
	{
		case STATE_CMD_CONNECT_ACCEPT_TIMEOUT:
		{
			RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_CONNECT_ACCEPT_TIMEOUT\n"));
			pBTInfo->BtAsocEntry[EntryNum].PhysLinkCompleteStatus=HCI_STATUS_CONNECT_ACCEPT_TIMEOUT;
			pBtMgnt->bNeedNotifyAMPNoCap = _TRUE;
			BTHCI_DisconnectPeer(padapter,EntryNum);
			break;
		}

		case STATE_CMD_DISCONNECT_PHY_LINK:
		{
			RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_DISCONNECT_PHY_LINK\n"));

			bthci_EventDisconnectPhyLinkComplete(padapter,
			HCI_STATUS_SUCCESS,
			pBTInfo->BtAsocEntry[EntryNum].PhyLinkDisconnectReason,
			EntryNum);

			PlatformCancelTimer(padapter,&pBTInfo->BTHCIJoinTimeoutTimer);

			pBTInfo->BtAsocEntry[EntryNum].PhysLinkCompleteStatus=HCI_STATUS_UNKNOW_CONNECT_ID;

			BTHCI_DisconnectPeer(padapter, EntryNum);
			break;
		}

		case STATE_CMD_MAC_START_COMPLETE:
		{
			RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_MAC_START_COMPLETE\n"));
			if (pBTInfo->BtAsocEntry[EntryNum].AMPRole == AMP_BTAP_JOINER)
			{
			}
			else if (pBTInfo->BtAsocEntry[EntryNum].AMPRole == AMP_BTAP_CREATOR)
			{
				bthci_EventChannelSelected(padapter,EntryNum);
			}

			break;
		}

		default:
			RTPRINT(FIOCTL, IOCTL_STATE, ("State command(%d) is Wrong !!!\n", StateCmd));
			break;
	}
}

void
bthci_StateConnecting(
	PADAPTER 					padapter,
	HCI_STATE_WITH_CMD		StateCmd,
	u8					EntryNum
	)
{
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;

	RTPRINT(FIOCTL, IOCTL_STATE, ("[BT state], [Connecting], "));
	switch (StateCmd)
	{
		case STATE_CMD_CONNECT_ACCEPT_TIMEOUT:
		{
			RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_CONNECT_ACCEPT_TIMEOUT\n"));
			pBTInfo->BtAsocEntry[EntryNum].PhysLinkCompleteStatus=HCI_STATUS_CONNECT_ACCEPT_TIMEOUT;
			pBtMgnt->bNeedNotifyAMPNoCap = _TRUE;
			BTHCI_DisconnectPeer(padapter, EntryNum);
			break;
		}

		case STATE_CMD_MAC_CONNECT_COMPLETE:
		{
			RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_MAC_CONNECT_COMPLETE\n"));

			if (pBTInfo->BtAsocEntry[EntryNum].AMPRole == AMP_BTAP_JOINER)
			{
				RT_TRACE(COMP_TEST, DBG_LOUD , ("StateConnecting \n"));
//				BTPKT_WPAAuthINITIALIZE(padapter,EntryNum); // Not implement yet
			}
			break;
		}

		case STATE_CMD_DISCONNECT_PHY_LINK:
		{
			RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_DISCONNECT_PHY_LINK\n"));

			bthci_EventDisconnectPhyLinkComplete(padapter,
			HCI_STATUS_SUCCESS,
			pBTInfo->BtAsocEntry[EntryNum].PhyLinkDisconnectReason,
			EntryNum);

			pBTInfo->BtAsocEntry[EntryNum].PhysLinkCompleteStatus=HCI_STATUS_UNKNOW_CONNECT_ID;

			PlatformCancelTimer(padapter,&pBTInfo->BTHCIJoinTimeoutTimer);

			BTHCI_DisconnectPeer(padapter, EntryNum);

			break;
		}

		case STATE_CMD_MAC_CONNECT_CANCEL_INDICATE:
		{
			RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_MAC_CONNECT_CANCEL_INDICATE\n"));
			pBTInfo->BtAsocEntry[EntryNum].PhysLinkCompleteStatus=HCI_STATUS_CONTROLLER_BUSY;
			// Because this state cmd is caused by the BTHCI_EventAMPStatusChange(),
			// we don't need to send event in the following BTHCI_DisconnectPeer() again.
			pBtMgnt->bNeedNotifyAMPNoCap = _FALSE;
			BTHCI_DisconnectPeer(padapter, EntryNum);
			break;
		}

		default:
			RTPRINT(FIOCTL, IOCTL_STATE, ("State command(%d) is Wrong !!!\n", StateCmd));
			break;
	}
}

void
bthci_StateConnected(
	PADAPTER 					padapter,
	HCI_STATE_WITH_CMD		StateCmd,
	u8					EntryNum
	)
{
//	PMGNT_INFO pMgntInfo = &padapter->MgntInfo;
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;

	RTPRINT(FIOCTL, IOCTL_STATE, ("[BT state], [Connected], "));
	switch (StateCmd)
	{
		case STATE_CMD_DISCONNECT_PHY_LINK:
		{
			RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_DISCONNECT_PHY_LINK\n"));

			//
			//When we are trying to disconnect the phy link, we should disconnect log link first,
			//
			{
				u8 i;
				u16 logicHandle = 0;
				for (i=0; i<MAX_LOGICAL_LINK_NUM; i++)
				{
					if (pBTInfo->BtAsocEntry[EntryNum].LogLinkCmdData->BtLogLinkhandle != 0)
					{
						logicHandle=pBTInfo->BtAsocEntry[EntryNum].LogLinkCmdData->BtLogLinkhandle;

						bthci_EventDisconnectLogicalLinkComplete(padapter, HCI_STATUS_SUCCESS,
							logicHandle, pBTInfo->BtAsocEntry[EntryNum].PhyLinkDisconnectReason);

						pBTInfo->BtAsocEntry[EntryNum].LogLinkCmdData->BtLogLinkhandle = 0;
					}
				}
			}

			bthci_EventDisconnectPhyLinkComplete(padapter,
			HCI_STATUS_SUCCESS,
			pBTInfo->BtAsocEntry[EntryNum].PhyLinkDisconnectReason,
			EntryNum);

			PlatformCancelTimer(padapter, &pBTInfo->BTHCIJoinTimeoutTimer);

			BTHCI_DisconnectPeer(padapter, EntryNum);
			break;
		}

		case STATE_CMD_MAC_DISCONNECT_INDICATE:
		{
			RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_MAC_DISCONNECT_INDICATE\n"));

			bthci_EventDisconnectPhyLinkComplete(padapter,
			HCI_STATUS_SUCCESS,
			// TODO: Remote Host not local host
			HCI_STATUS_CONNECT_TERMINATE_LOCAL_HOST,
			EntryNum);
			BTHCI_DisconnectPeer(padapter, EntryNum);

			break;
		}

		case STATE_CMD_ENTER_STATE:
		{
			RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_ENTER_STATE\n"));

