acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
			case HCI_STATE_CONNECTED:
				{
					pBTInfo->BtAsocEntry[EntryNum].BtNextState = HCI_STATE_CONNECTED | HCI_STATE_DISCONNECTING;
					bthci_StateConnected(padapter,StateCmd,EntryNum);
					break;
				}

			case HCI_STATE_DISCONNECTING:
				{
					pBTInfo->BtAsocEntry[EntryNum].BtNextState = HCI_STATE_DISCONNECTED | HCI_STATE_DISCONNECTING;
					bthci_StateDisconnecting(padapter,StateCmd,EntryNum);
					break;
				}

			case HCI_STATE_DISCONNECTED:
				{
					pBTInfo->BtAsocEntry[EntryNum].BtNextState = HCI_STATE_DISCONNECTED | HCI_STATE_STARTING | HCI_STATE_CONNECTING;
					bthci_StateDisconnected(padapter,StateCmd,EntryNum);
					break;
				}

			default:
				RTPRINT(FIOCTL, IOCTL_STATE, (" StateMachine, Unknown state to enter!!!\n"));
				break;
		}
	}
	else
	{
		RTPRINT(FIOCTL, IOCTL_STATE, (" StateMachine, Wrong state to enter\n"));
	}

	// 20100325 Joseph: Disable/Enable IPS/LPS according to BT status.
	if (!pBtMgnt->bBTConnectInProgress && !pBtMgnt->BtOperationOn)
	{
		RTPRINT(FIOCTL, IOCTL_STATE, ("[BT PS], IPSReturn()\n"));
		IPSReturn(padapter, IPS_DISABLE_BT_ON);
	}
}

void BTHCI_DisconnectPeer(PADAPTER padapter, u8 EntryNum)
{
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;

	RTPRINT(FIOCTL, IOCTL_BT_HCICMD, (" BTHCI_DisconnectPeer()\n"));

	BTHCI_SM_WITH_INFO(padapter,HCI_STATE_DISCONNECTING,STATE_CMD_MAC_CONNECT_CANCEL_INDICATE,EntryNum);

	if (pBTInfo->BtAsocEntry[EntryNum].bUsed)
	{
//		BTPKT_SendDeauthentication(padapter, pBTInfo->BtAsocEntry[EntryNum].BTRemoteMACAddr, unspec_reason); // not porting yet
	}

	if (pBtMgnt->bBTConnectInProgress)
	{
		pBtMgnt->bBTConnectInProgress = _FALSE;
		RTPRINT(FIOCTL, IOCTL_STATE, ("[BT Flag], BT Connect in progress OFF!!\n"));
	}

	bthci_RemoveEntryByEntryNum(padapter,EntryNum);

	if (pBtMgnt->bNeedNotifyAMPNoCap)
	{
		RTPRINT(FIOCTL, IOCTL_STATE, ("[BT AMPStatus], set to invalid in BTHCI_DisconnectPeer()\n"));
		BTHCI_EventAMPStatusChange(padapter, AMP_STATUS_NO_CAPACITY_FOR_BT);
	}
}

void BTHCI_EventNumOfCompletedDataBlocks(PADAPTER padapter)
{
//	PMGNT_INFO pMgntInfo = &padapter->MgntInfo;
	PBT30Info	pBTInfo = GET_BT_INFO(padapter);
	PBT_HCI_INFO		pBtHciInfo = &pBTInfo->BtHciInfo;
	u8 localBuf[TmpLocalBufSize] = "";
	u8 *pRetPar, *pTriple;
	u8 len=0, i, j, handleNum=0;
	PPACKET_IRP_HCIEVENT_DATA PPacketIrpEvent;
	u16 *pu2Temp, *pPackets, *pHandle, *pDblocks;
	u8 sent = 0;

#if 0
	PlatformZeroMemory(padapter->IrpHCILocalbuf.Ptr, padapter->IrpHCILocalbuf.Length);
	PPacketIrpEvent = (PPACKET_IRP_HCIEVENT_DATA)(buffer);
#else
	PPacketIrpEvent = (PPACKET_IRP_HCIEVENT_DATA)(&localBuf[0]);
#endif

	if (!(pBtHciInfo->BTEventMaskPage2 & EMP2_HCI_EVENT_NUM_OF_COMPLETE_DATA_BLOCKS))
	{
		RTPRINT(FIOCTL, IOCTL_BT_EVENT, ("[BT event], Num Of Completed DataBlocks, Ignore to send NumOfCompletedDataBlocksEvent due to event mask page 2\n"));
		return;
	}

	// Return parameters starts from here
	pRetPar = &PPacketIrpEvent->Data[0];
	pTriple = &pRetPar[3];
	for (j=0; j<MAX_BT_ASOC_ENTRY_NUM; j++)
	{

		for (i=0; i<MAX_LOGICAL_LINK_NUM; i++)
		{
			if (pBTInfo->BtAsocEntry[j].LogLinkCmdData[i].BtLogLinkhandle)
			{
				handleNum++;
				pHandle = (u16*)&pTriple[0];	// Handle[i]
				pPackets = (u16*)&pTriple[2];	// Num_Of_Completed_Packets[i]
				pDblocks = (u16*)&pTriple[4];	// Num_Of_Completed_Blocks[i]
#if (SENDTXMEHTOD == 0 || SENDTXMEHTOD == 2)
				PlatformAcquireSpinLock(padapter, RT_TX_SPINLOCK);
#endif
				*pHandle = pBTInfo->BtAsocEntry[j].LogLinkCmdData[i].BtLogLinkhandle;
				*pPackets = (u16)pBTInfo->BtAsocEntry[j].LogLinkCmdData[i].TxPacketCount;
				*pDblocks = (u16)pBTInfo->BtAsocEntry[j].LogLinkCmdData[i].TxPacketCount;
				if (pBTInfo->BtAsocEntry[j].LogLinkCmdData[i].TxPacketCount)
				{
					sent = 1;
					RTPRINT(FIOCTL, IOCTL_BT_EVENT_DETAIL, ("[BT event], Num Of Completed DataBlocks, Handle = 0x%x, Num_Of_Completed_Packets = 0x%x, Num_Of_Completed_Blocks = 0x%x\n",
					*pHandle, *pPackets, *pDblocks));
				}
				pBTInfo->BtAsocEntry[j].LogLinkCmdData[i].TxPacketCount = 0;
#if (SENDTXMEHTOD == 0 || SENDTXMEHTOD == 2)
				PlatformReleaseSpinLock(padapter, RT_TX_SPINLOCK);
#endif
				len += 6;
				pTriple += len;
			}
		}
	}

	pRetPar[2] = handleNum;				// Number_of_Handles
	len += 1;
	pu2Temp = (u16*)&pRetPar[0];
	*pu2Temp = BTTotalDataBlockNum;
	len += 2;

	PPacketIrpEvent->EventCode = HCI_EVENT_NUM_OF_COMPLETE_DATA_BLOCKS;
	PPacketIrpEvent->Length = len;
	if (handleNum && sent)
	{
		bthci_IndicateEvent(padapter, PPacketIrpEvent, len+2);
	}
}

void BTHCI_EventNumOfCompletedPackets(PADAPTER padapter)
{
//	PMGNT_INFO pMgntInfo = &padapter->MgntInfo;
	PBT30Info	pBTInfo = GET_BT_INFO(padapter);
	u8 localBuf[TmpLocalBufSize] = "";
	u8 *pRetPar, *pDouble;
	u8 len=0, i, j, handleNum=0;
	PPACKET_IRP_HCIEVENT_DATA PPacketIrpEvent;
	u16 *pPackets, *pHandle;
	u8 sent = 0;

	PPacketIrpEvent = (PPACKET_IRP_HCIEVENT_DATA)(&localBuf[0]);
	// Return parameters starts from here
	pRetPar = &PPacketIrpEvent->Data[0];
	pDouble = &pRetPar[1];
	for (j=0; j<MAX_BT_ASOC_ENTRY_NUM; j++)
	{
		for (i=0; i<MAX_LOGICAL_LINK_NUM; i++)
		{
			if (pBTInfo->BtAsocEntry[j].LogLinkCmdData[i].BtLogLinkhandle)
			{
				handleNum++;
				pHandle = (u16*)&pDouble[0];	// Handle[i]
				pPackets = (u16*)&pDouble[2];	// Num_Of_Completed_Packets[i]
				PlatformAcquireSpinLock(padapter, RT_TX_SPINLOCK);
				*pHandle = pBTInfo->BtAsocEntry[j].LogLinkCmdData[i].BtLogLinkhandle;
				*pPackets = (u16)pBTInfo->BtAsocEntry[j].LogLinkCmdData[i].TxPacketCount;
				if (pBTInfo->BtAsocEntry[j].LogLinkCmdData[i].TxPacketCount)
					sent = 1;
				pBTInfo->BtAsocEntry[j].LogLinkCmdData[i].TxPacketCount = 0;
				PlatformReleaseSpinLock(padapter, RT_TX_SPINLOCK);
				len += 4;
				pDouble += len;
			}
		}
	}

	pRetPar[0] = handleNum;				// Number_of_Handles
	len += 1;

	PPacketIrpEvent->EventCode = HCI_EVENT_NUMBER_OF_COMPLETE_PACKETS;
	PPacketIrpEvent->Length = len;
	if (handleNum && sent)
	{
		RTPRINT(FIOCTL, IOCTL_BT_EVENT, ("BTHCI_EventNumOfCompletedPackets \n"));
		bthci_IndicateEvent(padapter, PPacketIrpEvent, len+2);
	}
}

void
BTHCI_EventAMPStatusChange(
	PADAPTER 					padapter,
	u8						AMP_Status
	)
{
//	PMGNT_INFO pMgntInfo = &padapter->MgntInfo;
	PBT30Info	pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	u8 len = 0;
	u8 localBuf[7] = "";
	u8 *pRetPar;
	PPACKET_IRP_HCIEVENT_DATA PPacketIrpEvent;

