acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
#if 0
	if (!(pBtHciInfo->BTEventMaskPage2 & EMP2_HCI_EVENT_AMP_STATUS_CHANGE))
	{
		RTPRINT(FIOCTL, IOCTL_BT_EVENT, ("Ignore to send this event due to event mask page 2\n"));
		return;
	}
#endif

	if (AMP_Status==AMP_STATUS_NO_CAPACITY_FOR_BT)
	{
		pBtMgnt->BTNeedAMPStatusChg = _TRUE;
		pBtMgnt->bNeedNotifyAMPNoCap = _FALSE;

		BTHCI_DisconnectAll(padapter);
	}
	else if (AMP_Status == AMP_STATUS_FULL_CAPACITY_FOR_BT)
	{
		pBtMgnt->BTNeedAMPStatusChg = _FALSE;
	}

	PPacketIrpEvent = (PPACKET_IRP_HCIEVENT_DATA)(&localBuf[0]);
	// Return parameters starts from here
	pRetPar = &PPacketIrpEvent->Data[0];

	pRetPar[0] = 0;	// Status
	len += 1;
	pRetPar[1] = AMP_Status;	// AMP_Status
	len += 1;

	PPacketIrpEvent->EventCode = HCI_EVENT_AMP_STATUS_CHANGE;
	PPacketIrpEvent->Length = len;
	if (bthci_IndicateEvent(padapter, PPacketIrpEvent, len+2) == RT_STATUS_SUCCESS)
	{
		RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_STATE), ("[BT event], AMP Status Change, AMP_Status = %d\n", AMP_Status));
	}
}

void BTHCI_DisconnectAll(PADAPTER padapter)
{
	PADAPTER		pDefaultAdapter = GetDefaultAdapter(padapter);
//	PMGNT_INFO		pMgntInfo = &(pDefaultAdapter->MgntInfo);
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);

	u8 i;

	RTPRINT(FIOCTL, IOCTL_STATE, (" DisconnectALL()\n"));

	for (i=0; i<MAX_BT_ASOC_ENTRY_NUM; i++)
	{
		if (pBTInfo->BtAsocEntry[i].b4waySuccess == _TRUE)
		{
			BTHCI_SM_WITH_INFO(padapter, HCI_STATE_CONNECTED, STATE_CMD_DISCONNECT_PHY_LINK, i);
		}
		else if (pBTInfo->BtAsocEntry[i].bUsed == _TRUE)
		{
			if (pBTInfo->BtAsocEntry[i].BtCurrentState == HCI_STATE_CONNECTING)
			{
				BTHCI_SM_WITH_INFO(padapter, HCI_STATE_CONNECTING, STATE_CMD_MAC_CONNECT_CANCEL_INDICATE, i);
			}
			else if (pBTInfo->BtAsocEntry[i].BtCurrentState == HCI_STATE_DISCONNECTING)
			{
				BTHCI_SM_WITH_INFO(padapter, HCI_STATE_DISCONNECTING, STATE_CMD_MAC_CONNECT_CANCEL_INDICATE, i);
			}
		}
	}
}

HCI_STATUS
BTHCI_HandleHCICMD(
	PADAPTER 					padapter,
	PPACKET_IRP_HCICMD_DATA	pHciCmd
	)
{
	HCI_STATUS	status = HCI_STATUS_SUCCESS;
	PBT30Info	pBTInfo = GET_BT_INFO(padapter);
	PBT_DBG		pBtDbg = &pBTInfo->BtDbg;

	RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("\n"));
	RTPRINT(FIOCTL, (IOCTL_BT_HCICMD_DETAIL|IOCTL_BT_LOGO), ("HCI Command start, OGF=0x%x, OCF=0x%x, Length=0x%x\n",
		pHciCmd->OGF, pHciCmd->OCF, pHciCmd->Length));
#if 0 //for logo special test case only
	bthci_UseFakeData(padapter, pHciCmd);
#endif
	if (pHciCmd->Length)
	{
		RTPRINT_DATA(FIOCTL, (IOCTL_BT_HCICMD_DETAIL|IOCTL_BT_LOGO), "HCI Command, Hex Data :\n",
			&pHciCmd->Data[0], pHciCmd->Length);
	}
	if (pHciCmd->OGF == OGF_EXTENSION)
	{
		if (pHciCmd->OCF == HCI_SET_RSSI_VALUE)
		{
			RTPRINT(FIOCTL, IOCTL_BT_EVENT_PERIODICAL, ("[BT cmd], "));
		}
		else
		{
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[BT cmd], "));
		}
	}
	else
	{
		RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("[BT cmd], "));
	}

	pBtDbg->dbgHciInfo.hciCmdCnt++;

	switch (pHciCmd->OGF)
	{
		case OGF_LINK_CONTROL_COMMANDS:
			status = bthci_HandleOGFLinkControlCMD(padapter, pHciCmd);
			break;
		case OGF_HOLD_MODE_COMMAND:
			break;
		case OGF_SET_EVENT_MASK_COMMAND:
			status = bthci_HandleOGFSetEventMaskCMD(padapter, pHciCmd);
			break;
		case OGF_INFORMATIONAL_PARAMETERS:
			status = bthci_HandleOGFInformationalParameters(padapter, pHciCmd);
			break;
		case OGF_STATUS_PARAMETERS:
			status = bthci_HandleOGFStatusParameters(padapter, pHciCmd);
			break;
		case OGF_TESTING_COMMANDS:
			status = bthci_HandleOGFTestingCMD(padapter, pHciCmd);
			break;
		case OGF_EXTENSION:
			status = bthci_HandleOGFExtension(padapter,pHciCmd);
			break;
		default:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("HCI Command(), Unknown OGF = 0x%x\n", pHciCmd->OGF));
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("HCI_UNKNOWN_COMMAND\n"));
			status = bthci_UnknownCMD(padapter, pHciCmd);
			break;
	}
	RTPRINT(FIOCTL, IOCTL_BT_HCICMD_DETAIL, ("HCI Command execution end!!\n"));

	return status;
}

void
BTHCI_SetLinkStatusNotify(
	PADAPTER 					padapter,
	PPACKET_IRP_HCICMD_DATA	pHciCmd
	)
{
	bthci_CmdLinkStatusNotify(padapter, pHciCmd);
}

// ===== End of sync from SD7 driver COMMOM/bt_hci.c =====
#endif

#ifdef __HALBTC87231ANT_C__ // HAL/BTCoexist/HalBtc87231Ant.c

const char *const BtStateString[] =
{
	"BT_DISABLED",
	"BT_NO_CONNECTION",
	"BT_CONNECT_IDLE",
	"BT_INQ_OR_PAG",
	"BT_ACL_ONLY_BUSY",
	"BT_SCO_ONLY_BUSY",
	"BT_ACL_SCO_BUSY",
	"BT_ACL_INQ_OR_PAG",
	"BT_STATE_NOT_DEFINED"
};

extern s32 FillH2CCmd(PADAPTER padapter, u8 ElementID, u32 CmdLen, u8 *pCmdBuffer);

// ===== Below this line is sync from SD7 driver HAL/BTCoexist/HalBtc87231Ant.c =====

void
btdm_SetFw50(
	PADAPTER	padapter,
	u8		byte1,
	u8		byte2,
	u8		byte3
	)
{
	u8			H2C_Parameter[3] = {0};

	H2C_Parameter[0] = byte1;
	H2C_Parameter[1] = byte2;
	H2C_Parameter[2] = byte3;

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], FW write 0x50=0x%06x\n",
		H2C_Parameter[0]<<16|H2C_Parameter[1]<<8|H2C_Parameter[2]));

	FillH2CCmd(padapter, 0x50, 3, H2C_Parameter);
}

void btdm_SetFwIgnoreWlanAct(PADAPTER padapter, u8 bEnable)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u8			H2C_Parameter[1] = {0};

	if (bEnable)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT Ignore Wlan_Act !!\n"));
		H2C_Parameter[0] |= BIT(0);		// function enable
		pHalData->bt_coexist.bFWCoexistAllOff = _FALSE;
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT don't ignore Wlan_Act !!\n"));
	}

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], set FW for BT Ignore Wlan_Act, write 0x25=0x%02x\n",
		H2C_Parameter[0]));

	FillH2CCmd(padapter, BT_IGNORE_WLAN_ACT_EID, 1, H2C_Parameter);
}

void btdm_NotifyFwScan(PADAPTER padapter, u8 scanType)
{
	u8			H2C_Parameter[1] = {0};

	if (scanType == _TRUE)
		H2C_Parameter[0] = 0x1;

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], Notify FW for wifi scan, write 0x3b=0x%02x\n",
		H2C_Parameter[0]));

	FillH2CCmd(padapter, 0x3b, 1, H2C_Parameter);
}

void btdm_1AntSetPSMode(PADAPTER padapter, u8 enable, u8 smartps, u8 mode)
{
	struct pwrctrl_priv *pwrctrl;


	RTPRINT(FBT, BT_TRACE, ("[BTCoex], PS %s option=%d\n", enable==_TRUE?"ENABLE":"DISABLE", mode));

	pwrctrl = &padapter->pwrctrlpriv;

