acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
	if (enable == _TRUE) {
		rtw_set_ps_mode(padapter, PS_MODE_MIN, smartps, mode);
	} else {
		rtw_set_ps_mode(padapter, PS_MODE_ACTIVE, 0, 0);
		LPS_RF_ON_check(padapter, 100);
	}
}

void btdm_1AntTSFSwitch(PADAPTER padapter, u8 enable)
{
	u8 oldVal, newVal;


	oldVal = rtw_read8(padapter, 0x550);

	if (enable)
		newVal = oldVal | EN_BCN_FUNCTION;
	else
		newVal = oldVal & ~EN_BCN_FUNCTION;

	if (oldVal != newVal)
		rtw_write8(padapter, 0x550, newVal);
}

u8 btdm_Is1AntPsTdmaStateChange(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBTDM_8723A_1ANT	pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm1Ant;


	if ((pBtdm8723->bPrePsTdmaOn != pBtdm8723->bCurPsTdmaOn) ||
		(pBtdm8723->prePsTdma != pBtdm8723->curPsTdma))
	{
		return _TRUE;
	}
	else
	{
		return _FALSE;
	}
}

// Before enter TDMA, make sure Power Saving is enable!
void
btdm_1AntPsTdma(
	PADAPTER	padapter,
	u8		bTurnOn,
	u8		type
	)
{
	PHAL_DATA_TYPE		pHalData = GET_HAL_DATA(padapter);
	PBTDM_8723A_1ANT	pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm1Ant;


	RTPRINT(FBT, BT_TRACE, ("[BTCoex], turn %s PS TDMA, type=%d\n", (bTurnOn? "ON":"OFF"), type));
	pBtdm8723->bCurPsTdmaOn = bTurnOn;
	pBtdm8723->curPsTdma = type;
	if (bTurnOn)
	{
		switch (type)
		{
			case 1:	// ACL low-retry type
			default:
				if (btdm_Is1AntPsTdmaStateChange(padapter))
				{
					// wide duration for WiFi
					BTDM_SetFw3a(padapter, 0x53, 0x1a, 0x1a, 0x0, 0x50);
				}
				break;
			case 2:	// ACL high-retry type - 1
				if (btdm_Is1AntPsTdmaStateChange(padapter))
				{
					// normal duration for WiFi
					BTDM_SetFw3a(padapter, 0x53, 0x12, 0x12, 0x0, 0x50);
				}
				break;
			case 3:	// for WiFi connected-busy & BT SCO busy
				if (btdm_Is1AntPsTdmaStateChange(padapter))
				{
					// protect 3 beacons in 3-beacon period & Tx pause at BT slot
					BTDM_SetFw3a(padapter, 0x93, 0x25, 0x03, 0x10, 0x40);
				}
				break;
			case 4:	// for wifi scan & BT is connected
				if (btdm_Is1AntPsTdmaStateChange(padapter))
				{
					//protect 3 beacons in 3-beacon period & no Tx pause at BT slot
					BTDM_SetFw3a(padapter, 0x93, 0x15, 0x03, 0x10, 0x0);
				}
				break;
			case 5:	// for WiFi connected-busy & BT is Non-Connected-Idle
				if (btdm_Is1AntPsTdmaStateChange(padapter))
				{
					// SCO mode, Ant fixed at WiFi, WLAN_Act toggle
					BTDM_SetFw3a(padapter, 0xa9, 0x15, 0x03, 0x31, 0x00); //SCO mode, Ant fixed at WiFi, WLAN_Act toggle.
				}
				break;
			case 6:	// for WiFi is connect idle & BT is not SCO
				if (btdm_Is1AntPsTdmaStateChange(padapter))
				{
					BTDM_SetFw3a(padapter, 0x13, 0xa, 0x3, 0x0, 0x0);
				}
				break;
			case 7: // for WiFi is at low RSSI case
				if (btdm_Is1AntPsTdmaStateChange(padapter))
				{
					BTDM_SetFw3a(padapter, 0x13, 0xc, 0x5, 0x0, 0x0);
				}
				break;
			case 8: // for WiFi Association, DHCP & BT is connected
				if (btdm_Is1AntPsTdmaStateChange(padapter))
				{
					// protect 3 beacons in 3-beacon period & Tx pause at BT slot
					BTDM_SetFw3a(padapter, 0x93, 0x25, 0x03, 0x10, 0x0);
				}
				break;
			case 9:	// ACL high-retry type - 2
				if (btdm_Is1AntPsTdmaStateChange(padapter))
				{
					// narrow duration for WiFi
					BTDM_SetFw3a(padapter, 0x53, 0xa, 0xa, 0x0, 0x50); //narrow duration for WiFi
				}
				break;
			case 10: // for WiFi connect idle & BT ACL busy or WiFi Connected-Busy & BT is Inquiry
				if (btdm_Is1AntPsTdmaStateChange(padapter))
				{
					BTDM_SetFw3a(padapter, 0x13, 0xa, 0xa, 0x0, 0x40);
				}
				break;
			case 11: // ACL high-retry type - 3
				if (btdm_Is1AntPsTdmaStateChange(padapter))
				{
					// narrow duration for WiFi
					BTDM_SetFw3a(padapter, 0x13, 0x05, 0x05, 0x0, 0x0);
				}
				break;
			case 12: // for WiFi Connected-Busy & BT is Connected-Idle
				if (btdm_Is1AntPsTdmaStateChange(padapter))
				{
					// Allow High-Pri BT
					BTDM_SetFw3a(padapter, 0xa9, 0x0a, 0x03, 0x31, 0x00); //Allow High-Pri BT
				}
				break;
			case 15: // for WiFi connected-Idle vs BT-idle, BT-connectedIdle
				if (btdm_Is1AntPsTdmaStateChange(padapter))
				{
					// protect 1 beacons in 9-beacon period & Tx pause at BT slot
					BTDM_SetFw3a(padapter, 0x13, 0x0a, 0x03, 0x08, 0x00);
				}
				break;
			case 16: // for WiFi busy DHCP + BT ACL busy
				if (btdm_Is1AntPsTdmaStateChange(padapter))
				{
					BTDM_SetFw3a(padapter, 0x93, 0x15, 0x03, 0x10, 0x00);
				}
				break;
			case 18: // Re-DHCP
				if (btdm_Is1AntPsTdmaStateChange(padapter))
				{
					// protect 3 beacons in 3-beacon period & Tx pause at BT slot
					BTDM_SetFw3a(padapter, 0x93, 0x25, 0x03, 0x10, 0x00);
					// also send extend duration H2C cmd for WiFi
				}
				break;
			case 20: // WiFi only busy ,TDMA mode for power saving
				if (btdm_Is1AntPsTdmaStateChange(padapter))
				{
					BTDM_SetFw3a(padapter, 0x13, 0x25, 0x25, 0x00, 0x00);
				}
				break;
			case 21: // WiFi busy (BW 40) & BT SCO busy
				if (btdm_Is1AntPsTdmaStateChange(padapter))
				{
					BTDM_SetFw3a(padapter, 0x93, 0x20, 0x03, 0x10, 0x40);
				}
				break;
			case 22: // for WiFi busy\idle + BT ACL (A2DP＋FTP) busy
				if (btdm_Is1AntPsTdmaStateChange(padapter))
				{
					BTDM_SetFw3a(padapter, 0x13, 0x08, 0x08, 0x00, 0x40);
				}
				break;
			case 23: // WiFi busy & BT SCO busy  Level-1
				if (btdm_Is1AntPsTdmaStateChange(padapter))
				{
					 BTDM_SetFw3a(padapter, 0xe3, 0x25, 0x03, 0x31, 0x18);
				}
				break;
			case 24: // WiFi busy & BT SCO busy Level-2
				if (btdm_Is1AntPsTdmaStateChange(padapter))
				{
					BTDM_SetFw3a(padapter, 0xe3, 0x15, 0x03, 0x31, 0x18);
				}
				break;
			case 25: // WiFi busy & BT SCO busy  Level-3a
				if (btdm_Is1AntPsTdmaStateChange(padapter))
				{
					BTDM_SetFw3a(padapter, 0xe3, 0x0a, 0x03, 0x31, 0x18);
				}
				break;
			case 26: // WiFi busy & BT SCO busy  Level-3b
				if (btdm_Is1AntPsTdmaStateChange(padapter))
				{
					BTDM_SetFw3a(padapter, 0xe3, 0x0a, 0x03, 0x31, 0x18);
				}
				break;
		}
	}
	else
	{
		// disable PS-TDMA
		switch (type)
		{
			case 8:
				if (btdm_Is1AntPsTdmaStateChange(padapter))
				{
					// Antenna control by PTA, 0x870 = 0x310
					BTDM_SetFw3a(padapter, 0x8, 0x0, 0x0, 0x0, 0x0);
				}
				break;
			case 0:
			default:
				if (btdm_Is1AntPsTdmaStateChange(padapter))
				{
					// Antenna control by PTA, 0x870 = 0x310
					BTDM_SetFw3a(padapter, 0x0, 0x0, 0x0, 0x0, 0x0);
				}
				rtw_write16(padapter, 0x860, 0x210); // Switch Antenna to BT
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], 0x860=0x210, Switch Antenna to BT\n"));
				break;
			case 9:
				if (btdm_Is1AntPsTdmaStateChange(padapter))
				{
					// Antenna control by PTA, 0x870 = 0x310
					BTDM_SetFw3a(padapter, 0x0, 0x0, 0x0, 0x0, 0x0);
				}
				rtw_write16(padapter, 0x860, 0x110); // Switch Antenna to WiFi
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], 0x860=0x110, Switch Antenna to WiFi\n"));
				break;
		}
	}

