acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
		up = 0;
		dn = 0;
		WaitCount = 0;
	}

	return ret;
}

void btdm_1AntTdmaDurationAdjustForACL(PADAPTER padapter)
{
	PHAL_DATA_TYPE		pHalData = GET_HAL_DATA(padapter);
	PBTDM_8723A_1ANT	pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm1Ant;


	RTPRINT(FBT, BT_TRACE, ("[BTCoex], %s\n", __FUNCTION__));
	if (pBtdm8723->psTdmaGlobalCnt != pBtdm8723->psTdmaMonitorCnt)
	{
		pBtdm8723->psTdmaMonitorCnt = 0;
		pBtdm8723->psTdmaGlobalCnt = 0;
	}
	if (pBtdm8723->psTdmaMonitorCnt == 0)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1AntTdmaAdjACL, first time execute!!\n"));
		btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, 2);
		pBtdm8723->psTdmaDuAdjType = 2;
	}
	else
	{
		// Now we only have 4 level Ps Tdma,
		// if that's not the following 4 level(will changed by wifi scan, dhcp...),
		// then we have to adjust it back to the previous record one.
		if ((pBtdm8723->curPsTdma != 1) &&
			(pBtdm8723->curPsTdma != 2) &&
			(pBtdm8723->curPsTdma != 9) &&
			(pBtdm8723->curPsTdma != 11))
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], tdma adjust type can only be 1/2/9/11 !!!\n"));
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], the latest adjust type = %d\n", pBtdm8723->psTdmaDuAdjType));

			btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, pBtdm8723->psTdmaDuAdjType);
		}
		else
		{
			s32 judge = 0;

			judge = btdm_1AntTdmaJudgement(padapter, pHalData->bt_coexist.halCoex8723.btRetryCnt);
			if (judge == -1)
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1AntTdmaAdjACL, Upgrade WiFi duration\n"));
				if (pBtdm8723->curPsTdma == 1)
				{
					// Decrease WiFi duration for high BT retry
					if(pHalData->bt_coexist.halCoex8723.btInfoExt){
						pBtdm8723->psTdmaDuAdjType = 9;
						RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1AntTdmaAdjACL,  limit to type9 \n"));
					}
					else
						pBtdm8723->psTdmaDuAdjType = 2;
					btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, pBtdm8723->psTdmaDuAdjType);

				}
				else if (pBtdm8723->curPsTdma == 2)
				{
					btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, 9);
					pBtdm8723->psTdmaDuAdjType = 9;
				}
				else if (pBtdm8723->curPsTdma == 9)
				{
					btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, 11);
					pBtdm8723->psTdmaDuAdjType = 11;
				}
			}
			else if (judge == 1)
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1AntTdmaAdjACL, Downgrade WiFi duration!!\n"));

				if (pBtdm8723->curPsTdma == 11)
				{
					btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, 9);
					pBtdm8723->psTdmaDuAdjType = 9;
				}
				else if (pBtdm8723->curPsTdma == 9)
				{
					if (pHalData->bt_coexist.halCoex8723.btInfoExt){
						pBtdm8723->psTdmaDuAdjType = 9;
						RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1AntTdmaAdjACL,  limit to type9 \n"));
					}
					else
						pBtdm8723->psTdmaDuAdjType = 2;
					btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, pBtdm8723->psTdmaDuAdjType);

				}
				else if (pBtdm8723->curPsTdma == 2)
				{
					if (pHalData->bt_coexist.halCoex8723.btInfoExt){
						pBtdm8723->psTdmaDuAdjType = 9;
						RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1AntTdmaAdjACL,  limit to type9 \n"));
					}
					else
						pBtdm8723->psTdmaDuAdjType = 1;
					btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, pBtdm8723->psTdmaDuAdjType);
				}
			}
			else
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1AntTdmaAdjACL, no need to change\n"));
			}
		}

		RTPRINT(FBT, BT_TRACE, ("[BTCoex], current PS TDMA is %s, type=%d\n",
			(pBtdm8723->bCurPsTdmaOn? "ON":"OFF"), pBtdm8723->curPsTdma));
	}

	pBtdm8723->psTdmaMonitorCnt++;
}

u8 btdm_1AntAdjustbyWiFiRSSI(u8 RSSI_Now, u8 RSSI_Last, u8 RSSI_Th)
{
	u8 type;

	if (RSSI_Now>RSSI_Last)
	{
		if (RSSI_Now > (RSSI_Th + 5))
			type = 26;
		else
			type = 25;
	}
	else
	{
		if (RSSI_Now > RSSI_Th)
			type = 26;
		else
			type = 25;
	}

	return type;
}

void btdm_1AntTdmaDurationAdjustForSCO(PADAPTER padapter)
{
	PHAL_DATA_TYPE pHalData;
	PBTDM_8723A_1ANT pBtdm8723;
	PDM_ODM_T podm;
	pDIG_T pDigTable;
	u8 RSSITh_WiFi, RSSITh12_BT, RSSITh23_BT;
	u8 Type, RSSIOffset;
	u8 RSSI_WiFi_Now, RSSI_BT_Now;


//	RTPRINT(FBT, BT_TRACE, ("[BTCoex], %s\n", __FUNCTION__));
	pHalData = GET_HAL_DATA(padapter);
	pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm1Ant;
	podm = &pHalData->odmpriv;
	pDigTable = &podm->DM_DigTable;
	RSSITh_WiFi = 47;
	RSSITh12_BT = 36;
	RSSITh23_BT = 30;
	RSSIOffset = 22;
	RSSI_WiFi_Now = pDigTable->Rssi_val_min;
	RSSI_BT_Now = pHalData->bt_coexist.halCoex8723.btRssi;

	if (pBtdm8723->psTdmaGlobalCnt != pBtdm8723->psTdmaMonitorCntForSCO)
	{
		pBtdm8723->psTdmaMonitorCntForSCO = 0;
		pBtdm8723->psTdmaGlobalCnt = 0;
	}

	if (pBtdm8723->psTdmaMonitorCntForSCO == 0)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1AntTdmaAdjSCO, first time execute!!\n"));
		pBtdm8723->RSSI_WiFi_Last = 0;
		pBtdm8723->RSSI_BT_Last = 0;
	}
	else
	{
		if ((pBtdm8723->curPsTdma != 23) &&
				(pBtdm8723->curPsTdma != 24) &&
				(pBtdm8723->curPsTdma != 25) &&
				(pBtdm8723->curPsTdma != 26))
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1AntTdmaAdjSCO, tdma adjust type can only be 23/24/25/26 !!!\n"));
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1AntTdmaAdjSCO, the latest adjust type=%d\n", pBtdm8723->psTdmaDuAdjTypeForSCO));

			Type = pBtdm8723->psTdmaDuAdjTypeForSCO;

			goto _exit_1AntTdmaDurationAdjustForSCO;
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1AntTdmaAdjSCO, pre curPsTdma=%d\n", pBtdm8723->curPsTdma));
		}
	}

	switch (pBtdm8723->curPsTdma)
	{
		case 1: // WiFi 52ms
			RSSI_WiFi_Now += 11; // 22*0.48
			break;
		case 2: // WiFi 36ms
			RSSI_WiFi_Now += 14; // 22*0.64
			break;
		case 9: // WiFi 20ms
			RSSI_WiFi_Now += 18; // 22*0.80
			break;
		case 11: // WiFi 10ms
			RSSI_WiFi_Now += 20; // 22*0.90
			break;
		case 4: // WiFi 21ms
			RSSI_WiFi_Now += 17; // 22*0.79
			break;
		case 16: // WiFi 24ms
			RSSI_WiFi_Now += 18; // 22*0.76
			break;
		case 18: // WiFi 37ms
			RSSI_WiFi_Now += 14; // 22*0.64
			break;
		case 23: //Level-1, Antenna switch to BT at all time
		case 24: //Level-2
		case 25: //Level-3a
		case 26: //Level-3b
			RSSI_WiFi_Now += 22;
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1AntTdmaAdjSCO, RSSI_WiFi_Now+22=%d\n", RSSI_WiFi_Now));
			break;
		default:
			break;
	}

