acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
	if (!BTDM_IsWifiBusy(padapter)) // WiFi LPS
	{
		//Type = btdm_1AntAdjustbyWiFiRSSI(RSSI_WiFi_Now, pBtdm8723->RSSI_WiFi_Last, RSSITh_WiFi);
		if (Type == 26)
		{
		if(RSSI_BT_Now >=  RSSITh12_BT + 4)
			Type = 23;
		else
			Type = 26;
		}
		else
		{
		if (RSSI_BT_Now >=  RSSITh12_BT)
			Type = 23;
		else
			Type = 26;
		}

	}
	else // WiFi busy
	{
		//if (RSSI_BT_Now > pBtdm8723->RSSI_BT_Last)
		if (Type !=23)
		{
			if (RSSI_BT_Now >= RSSITh12_BT + 4)
				Type = 23;
			else if (RSSI_BT_Now >= RSSITh23_BT + 4)
				Type = 24;
			else
				Type = btdm_1AntAdjustbyWiFiRSSI(RSSI_WiFi_Now, pBtdm8723->RSSI_WiFi_Last, RSSITh_WiFi);
		}
		else
		{
			if (RSSI_BT_Now >= RSSITh12_BT)
				Type = 23;
			else if  (RSSI_BT_Now >= RSSITh23_BT)
				Type = 24;
			else
				Type = btdm_1AntAdjustbyWiFiRSSI(RSSI_WiFi_Now, pBtdm8723->RSSI_WiFi_Last, RSSITh_WiFi);
		}
	}

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1AntTdmaAdjSCO, Type=%d, RSSI_WiFi=%d, RSSI_BT=%d\n",
			Type, RSSI_WiFi_Now, RSSI_BT_Now));

_exit_1AntTdmaDurationAdjustForSCO:

	pBtdm8723->RSSI_WiFi_Last = RSSI_WiFi_Now;
	pBtdm8723->RSSI_BT_Last = RSSI_BT_Now;

	if (Type != pBtdm8723->curPsTdma)
		btdm_1AntSetPSTDMA(padapter, _FALSE, 0, _TRUE, Type);

	pBtdm8723->psTdmaDuAdjTypeForSCO = Type;

	pBtdm8723->psTdmaMonitorCntForSCO++;
}

void btdm_1AntCoexProcessForWifiConnect(PADAPTER padapter)
{
	struct mlme_priv *pmlmepriv;
	PHAL_DATA_TYPE pHalData;
	PBT_COEXIST_8723A pBtCoex;
	PBTDM_8723A_1ANT pBtdm8723;
	u8 BtState;


	RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1AntCoexProcessForWifiConnect!!\n"));

	pmlmepriv = &padapter->mlmepriv;
	pHalData = GET_HAL_DATA(padapter);
	pBtCoex = &pHalData->bt_coexist.halCoex8723;
	pBtdm8723 = &pBtCoex->btdm1Ant;
	BtState = pBtCoex->c2hBtInfo;

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], WiFi is %s\n", BTDM_IsWifiBusy(padapter)?"Busy":"IDLE"));
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT is %s\n", BtStateString[BtState]));

	padapter->pwrctrlpriv.btcoex_rfon=_FALSE;
	if ((!BTDM_IsWifiBusy(padapter)) &&(check_fwstate(&padapter->mlmepriv, WIFI_AP_STATE) != _TRUE)&&
		((BtState == BT_INFO_STATE_NO_CONNECTION) || (BtState == BT_INFO_STATE_CONNECT_IDLE)))
	{
		switch (BtState)
		{
			case BT_INFO_STATE_NO_CONNECTION:
				_btdm_1AntSetPSTDMA(padapter, _TRUE, 2, 0x2a, _FALSE, 9);
				break;
			case BT_INFO_STATE_CONNECT_IDLE:
				_btdm_1AntSetPSTDMA(padapter, _TRUE, 2, 0x2a, _FALSE, 0);
				break;
		}
	}
	else
	{
		u8 val8;

		val8 = rtw_read8(padapter, 0x883);
		val8 &= 0x07;
		if ((BtState == BT_INFO_STATE_SCO_ONLY_BUSY) ||
			(BtState == BT_INFO_STATE_ACL_SCO_BUSY))
		{
			if (BTDM_IsHT40(padapter) == _TRUE)
				val8 |= 0x80; //0x880[31:27] = 10000;
			else
				val8 |= 0x60; //0x880[31:27] = 01100;
		}
		else
		{
			val8 |= 0xC0; // 0x880[31:27] = 11000;
		}
		rtw_write8(padapter, 0x883, val8);

		switch (BtState)
		{
			case BT_INFO_STATE_NO_CONNECTION:
				// WiFi is Busy
				btdm_1AntSetPSTDMA(padapter, _FALSE, 0, _TRUE, 5);
				break;
			case BT_INFO_STATE_CONNECT_IDLE:
				// WiFi is Busy
				btdm_1AntSetPSTDMA(padapter, _FALSE, 0, _TRUE, 12);
				break;
			case BT_INFO_STATE_INQ_OR_PAG:
				if (BTDM_IsWifiBusy(padapter) == _TRUE)
				{
					btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, 10);
				}
				else
				{
					btdm_1AntSetPSTDMA(padapter, _TRUE, 3, _FALSE, 9);
				}
				break;
			case BT_INFO_STATE_SCO_ONLY_BUSY:
			case BT_INFO_STATE_ACL_SCO_BUSY:
				btdm_1AntTdmaDurationAdjustForSCO(padapter);
				break;
			case BT_INFO_STATE_ACL_ONLY_BUSY:
				if (pBtCoex->c2hBtProfile == BT_INFO_HID)
				{
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT PROFILE is HID\n"));
					btdm_1AntTdmaDurationAdjustForSCO(padapter);
				}
				else if (pBtCoex->c2hBtProfile == BT_INFO_FTP)
				{
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT PROFILE is FTP\n"));
					padapter->pwrctrlpriv.btcoex_rfon=_TRUE;
					btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, 1);
				}
				else if (pBtCoex->c2hBtProfile == (BT_INFO_A2DP|BT_INFO_FTP))
				{
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT PROFILE is A2DP_FTP\n"));
					padapter->pwrctrlpriv.btcoex_rfon=_TRUE;
					btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, 11);
				}
				else
				{
					if (pBtCoex->c2hBtProfile == BT_INFO_A2DP)
					{
						RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT PROFILE is A2DP\n"));
						padapter->pwrctrlpriv.btcoex_rfon=_TRUE;
					}
					else
					{
						RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT PROFILE is UNKNOWN(0x%02X)! Use A2DP Profile\n", pBtCoex->c2hBtProfile));
						padapter->pwrctrlpriv.btcoex_rfon=_TRUE;
					}
					btdm_1AntTdmaDurationAdjustForACL(padapter);
				}
				break;
			case BT_INFO_STATE_ACL_INQ_OR_PAG:
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT PROFILE is BT_INFO_STATE_ACL_INQ_OR_PAG\n"));
				padapter->pwrctrlpriv.btcoex_rfon=_TRUE;
				btdm_1AntSetPSTDMA(padapter,  _TRUE, 1, _TRUE, 16);
				break;
		}
	}

	pBtdm8723->psTdmaGlobalCnt++;
}

void btdm_1AntBTStateChangeHandler(PADAPTER padapter, BT_STATE_1ANT oldState, BT_STATE_1ANT newState)
{
	if (oldState == newState)
		return;


	RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT state change, %s => %s\n", BtStateString[oldState], BtStateString[newState]));

	if ((oldState <= BT_INFO_STATE_NO_CONNECTION) &&
		(newState > BT_INFO_STATE_NO_CONNECTION))
	{
		btdm_SetFwIgnoreWlanAct(padapter, _FALSE);
	}

	if (oldState == BT_INFO_STATE_ACL_ONLY_BUSY)
	{
		PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
		pHalData->bt_coexist.halCoex8723.btdm1Ant.psTdmaMonitorCnt = 0;
		pHalData->bt_coexist.halCoex8723.btdm1Ant.psTdmaMonitorCntForSCO = 0;
	}

	if ((oldState == BT_INFO_STATE_SCO_ONLY_BUSY) ||
		(oldState == BT_INFO_STATE_ACL_SCO_BUSY))
	{
		PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
		pHalData->bt_coexist.halCoex8723.btdm1Ant.psTdmaMonitorCntForSCO = 0;
	}

	// Active 2Ant mechanism for SCO
	if ((oldState == BT_INFO_STATE_SCO_ONLY_BUSY) ||
		(oldState == BT_INFO_STATE_ACL_SCO_BUSY))
	{
		if ((newState != BT_INFO_STATE_SCO_ONLY_BUSY) &&
			(newState != BT_INFO_STATE_ACL_SCO_BUSY))
		{
			BTDM_SetSwRfRxLpfCorner(padapter, BT_RF_RX_LPF_CORNER_RESUME);
			BTDM_AGCTable(padapter, BT_AGCTABLE_OFF);
			BTDM_BBBackOffLevel(padapter, BT_BB_BACKOFF_OFF);
		}
	}
	else
	{
		if ((newState == BT_INFO_STATE_SCO_ONLY_BUSY) ||
			(newState == BT_INFO_STATE_ACL_SCO_BUSY))
		{
			BTDM_SetSwRfRxLpfCorner(padapter, BT_RF_RX_LPF_CORNER_SHRINK);
			BTDM_AGCTable(padapter, BT_AGCTABLE_ON);
			BTDM_BBBackOffLevel(padapter, BT_BB_BACKOFF_ON);
		}
	}
}

void btdm_1AntBtCoexistHandler(PADAPTER padapter)
{
	PHAL_DATA_TYPE		pHalData;
	PBT_COEXIST_8723A	pBtCoex8723;
	PBTDM_8723A_1ANT	pBtdm8723;
	u8			u1tmp;


	pHalData = GET_HAL_DATA(padapter);
	pBtCoex8723 = &pHalData->bt_coexist.halCoex8723;
	pBtdm8723 = &pBtCoex8723->btdm1Ant;
	padapter->pwrctrlpriv.btcoex_rfon=_FALSE;
	if (BT_IsBtDisabled(padapter) == _TRUE)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT is disabled\n"));

		if (BTDM_IsWifiConnectionExist(padapter) == _TRUE)
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], wifi is connected\n"));

