acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
			if (BTDM_IsWifiBusy(padapter) == _TRUE)
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], Wifi is busy\n"));
				btdm_1AntSetPSTDMA(padapter, _FALSE, 0, _FALSE, 9);
			}
			else
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], Wifi is idle\n"));
				_btdm_1AntSetPSTDMA(padapter, _TRUE, 2, 1, _FALSE, 9);
			}
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], wifi is disconnected\n"));

			btdm_1AntSetPSTDMA(padapter, _FALSE, 0, _FALSE, 9);
		}
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT is enabled\n"));

		if (BTDM_IsWifiConnectionExist(padapter) == _TRUE)
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], wifi is connected\n"));

			btdm_1AntWifiParaAdjust(padapter, _TRUE);
			btdm_1AntCoexProcessForWifiConnect(padapter);
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], wifi is disconnected\n"));

			// Antenna switch at BT side(0x870 = 0x300, 0x860 = 0x210) after PSTDMA off
			btdm_1AntWifiParaAdjust(padapter, _FALSE);
			btdm_1AntSetPSTDMA(padapter, _FALSE, 0, _FALSE, 0);
		}
	}

	btdm_1AntBTStateChangeHandler(padapter, pBtCoex8723->prec2hBtInfo, pBtCoex8723->c2hBtInfo);
	pBtCoex8723->prec2hBtInfo = pBtCoex8723->c2hBtInfo;
}

void
BTDM_1AntSetWifiRssiThresh(
	PADAPTER	padapter,
	u8		rssiThresh
	)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBTDM_8723A_1ANT pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm1Ant;

	pBtdm8723->wifiRssiThresh = rssiThresh;
	DBG_871X("cosa set rssi thresh = %d\n", pBtdm8723->wifiRssiThresh);
}

void BTDM_1AntParaInit(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBTDM_8723A_1ANT	pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm1Ant;

	// Enable counter statistics
	rtw_write8(padapter, 0x76e, 0x4);
	btdm_1AntPtaParaReload(padapter);

	pBtdm8723->wifiRssiThresh = 48;

	pBtdm8723->bWiFiHalt = _FALSE;
}

void BTDM_1AntForHalt(PADAPTER padapter)
{
	RTPRINT(FBT, BT_TRACE, ("\n[BTCoex], 1Ant for halt\n"));

	GET_HAL_DATA(padapter)->bt_coexist.halCoex8723.btdm1Ant.bWiFiHalt == _TRUE;

	btdm_1AntWifiParaAdjust(padapter, _FALSE);
	btdm_1AntSetPSTDMA(padapter, _FALSE, 0, _FALSE, 0);
	btdm_SetFwIgnoreWlanAct(padapter, _TRUE);
}

void BTDM_1AntLpsLeave(PADAPTER padapter)
{
	RTPRINT(FBT, BT_TRACE, ("\n[BTCoex], 1Ant for LPS Leave\n"));

	// Prevent from entering LPS again
	GET_HAL_DATA(padapter)->bt_coexist.halCoex8723.btdm1Ant.bWiFiHalt == _TRUE;

	btdm_1AntSetPSTDMA(padapter, _FALSE, 0, _FALSE, 8);
//	btdm_1AntPsTdma(padapter, _FALSE, 8);
}

void BTDM_1AntWifiAssociateNotify(PADAPTER padapter, u8 type)
{
	PHAL_DATA_TYPE pHalData = GET_HAL_DATA(padapter);


	RTPRINT(FBT, BT_TRACE, ("\n[BTCoex], 1Ant for associate, type=%d\n", type));

	if (type)
	{
		rtl8723a_CheckAntenna_Selection(padapter);
		if (BT_IsBtDisabled(padapter) == _TRUE)
		{
			btdm_1AntPsTdma(padapter, _FALSE, 9);
		}
		else
		{
			btdm_1AntTSFSwitch(padapter, _TRUE);
			btdm_1AntPsTdma(padapter, _TRUE, 8);	// extend wifi slot
		}
	}
	else
	{
		if (BT_IsBtDisabled(padapter) == _FALSE)
		{
			if (BTDM_IsWifiConnectionExist(padapter) == _FALSE)
			{
				btdm_1AntPsTdma(padapter, _FALSE, 0);
				btdm_1AntTSFSwitch(padapter, _FALSE);
			}
		}

		btdm_1AntBtCoexistHandler(padapter);
	}
}

void BTDM_1AntMediaStatusNotify(PADAPTER padapter, RT_MEDIA_STATUS mstatus)
{
	RTPRINT(FBT, BT_TRACE, ("\n[BTCoex], wifi status change to %s(%s)\n",
			mstatus==RT_MEDIA_CONNECT?"connect":"disconnect",
			BTDM_IsWifiConnectionExist(padapter)==_TRUE?"connect":"disconnect"));

	btdm_1AntBtCoexistHandler(padapter);
}

void BTDM_1AntForDhcp(PADAPTER padapter)
{
	PHAL_DATA_TYPE pHalData;
	u8 u1tmp;


	RTPRINT(FBT, BT_TRACE, ("\n[BTCoex], 1Ant for DHCP\n"));

	pHalData = GET_HAL_DATA(padapter);

	if (BT_IsBtDisabled(padapter) == _TRUE)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1Ant for DHCP, BT is disabled\n"));
		btdm_1AntSetPSTDMA(padapter, _FALSE, 0, _FALSE, 9);
	}
	else
	{
		u8 BtState;
		PBTDM_8723A_1ANT pBtdm8723;

		BtState = pHalData->bt_coexist.halCoex8723.c2hBtInfo;
		pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm1Ant;

		if (BtState == BT_INFO_STATE_SCO_ONLY_BUSY ||
			BtState == BT_INFO_STATE_ACL_SCO_BUSY)
		{
			if (pBtdm8723->curPsTdma != 23)
				btdm_1AntSetPSTDMA(padapter, _FALSE, 0, _TRUE, 26);
		}
		else if (BtState == BT_INFO_STATE_ACL_ONLY_BUSY)
		{
			if(padapter->securitypriv.ndisencryptstatus != Ndis802_11EncryptionDisabled)
			{
				btdm_1AntSetPSTDMA(padapter, _TRUE, 0, _TRUE, 18);
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1Ant for DHCP, Encrypted AP, set PSTDMA type=%d[18]\n", pBtdm8723->curPsTdma));
			}
			else{
				switch (pBtdm8723->curPsTdma)
				{
					case 1:
					case 2:
						RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1Ant for DHCP, Keep PSTDMA type=%d\n", pBtdm8723->curPsTdma));
						break;
					default:
						padapter->pwrctrlpriv.btcoex_rfon=_TRUE;
						btdm_1AntSetPSTDMA(padapter, _TRUE, 0, _TRUE, 16);
						break;
				}
			}
		}
		else if (BTDM_IsWifiBusy(padapter) == _TRUE)
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1Ant for DHCP, WiFi is Busy\n"));
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], %s\n", BtStateString[BtState]));
			padapter->pwrctrlpriv.btcoex_rfon=_FALSE;
			switch (BtState)
			{
				case BT_INFO_STATE_NO_CONNECTION:
				case BT_INFO_STATE_CONNECT_IDLE:
					btdm_1AntBtCoexistHandler(padapter);
					break;
				default:
					padapter->pwrctrlpriv.btcoex_rfon=_TRUE;
					btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, 18); // extend wifi slot
					break;
			}
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1Ant for DHCP, WiFi is Idle\n"));
			padapter->pwrctrlpriv.btcoex_rfon=_FALSE;
			switch (BtState)
			{
				case BT_INFO_STATE_NO_CONNECTION:
				case BT_INFO_STATE_CONNECT_IDLE:

					btdm_1AntSetPSTDMA(padapter, _TRUE,1, _TRUE, 18); // extend wifi slot
					break;
				default:
					padapter->pwrctrlpriv.btcoex_rfon=_TRUE;

					btdm_1AntSetPSTDMA(padapter,_TRUE,1, _TRUE, 18); // extend wifi slot
					break;
			}

		}
	}
}

void BTDM_1AntWifiScanNotify(PADAPTER padapter, u8 scanType)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u8 u1tmp;


	RTPRINT(FBT, BT_TRACE, ("\n[BTCoex], 1Ant for wifi scan=%d!!\n", scanType));

	if (scanType)
	{
		rtl8723a_CheckAntenna_Selection(padapter);
		if (BT_IsBtDisabled(padapter) == _TRUE)
		{
			btdm_1AntSetPSTDMA(padapter, _FALSE, 0, _FALSE, 9);
		}
		else
		{
			if (BTDM_IsWifiConnectionExist(padapter) == _FALSE)
			{
				btdm_1AntTSFSwitch(padapter, _TRUE);
			}

