acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
			//btdm_1AntPsTdma(padapter, _TRUE, 4); // Antenna control by TDMA
			btdm_1AntSetPSTDMA(padapter, _FALSE, 0, _TRUE, 5);

		}

		btdm_NotifyFwScan(padapter, 1);
	}
	else // WiFi_Finish_Scan
	{
		btdm_NotifyFwScan(padapter, 0);

		if (BT_IsBtDisabled(padapter) == _FALSE)
		{
			if (BTDM_IsWifiConnectionExist(padapter) == _FALSE)
			{
				btdm_1AntPsTdma(padapter, _FALSE, 0);
				btdm_1AntTSFSwitch(padapter, _FALSE);
			}
		}

		btdm_1AntBtCoexistHandler(padapter);
	}
}

void BTDM_1AntFwC2hBtInfo8723A(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData;
	PBT30Info		pBTInfo;
	PBT_MGNT		pBtMgnt;
	PBT_COEXIST_8723A pBtCoex;
	u8	u1tmp, btState;


	pHalData = GET_HAL_DATA(padapter);
	pBTInfo = GET_BT_INFO(padapter);
	pBtMgnt = &pBTInfo->BtMgnt;
	pBtCoex = &pHalData->bt_coexist.halCoex8723;

	u1tmp = pBtCoex->c2hBtInfoOriginal;
	// sco BUSY bit is not used on voice over PCM platform
	btState = u1tmp & 0xF;
	pBtCoex->c2hBtProfile = u1tmp & 0xE0;

	// default set bt to idle state.
	pBtMgnt->ExtConfig.bBTBusy = _FALSE;
	pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_IDLE;

	// check BIT2 first ==> check if bt is under inquiry or page scan
	if (btState & BIT(2))
	{
		pBtCoex->bC2hBtInquiryPage = _TRUE;
	}
	else
	{
		pBtCoex->bC2hBtInquiryPage = _FALSE;
	}
	btState &= ~BIT(2);

	if (!(btState & BIT(0)))
	{
		pBtCoex->c2hBtInfo = BT_INFO_STATE_NO_CONNECTION;
	}
	else
	{
		if (btState == 0x1)
		{
			pBtCoex->c2hBtInfo = BT_INFO_STATE_CONNECT_IDLE;
		}
		else if (btState == 0x9)
		{
			if(pBtCoex->bC2hBtInquiryPage == _TRUE)
				pBtCoex->c2hBtInfo = BT_INFO_STATE_ACL_INQ_OR_PAG;
			else
				pBtCoex->c2hBtInfo = BT_INFO_STATE_ACL_ONLY_BUSY;
			pBtMgnt->ExtConfig.bBTBusy = _TRUE;
		}
		else if (btState == 0x3)
		{
			pBtCoex->c2hBtInfo = BT_INFO_STATE_SCO_ONLY_BUSY;
			pBtMgnt->ExtConfig.bBTBusy = _TRUE;
		}
		else if (btState == 0xb)
		{
			pBtCoex->c2hBtInfo = BT_INFO_STATE_ACL_SCO_BUSY;
			pBtMgnt->ExtConfig.bBTBusy = _TRUE;
		}
		else
		{
			pBtCoex->c2hBtInfo = BT_INFO_STATE_MAX;
		}
		if (_TRUE == pBtMgnt->ExtConfig.bBTBusy)
			pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_IDLE;
	}

	if ((BT_INFO_STATE_NO_CONNECTION == pBtCoex->c2hBtInfo) ||
		(BT_INFO_STATE_CONNECT_IDLE == pBtCoex->c2hBtInfo))
	{
		if (pBtCoex->bC2hBtInquiryPage)
			pBtCoex->c2hBtInfo = BT_INFO_STATE_INQ_OR_PAG;
	}

	RTPRINT(FBT, BT_TRACE, ("[BTC2H], Bt state=%d\n", pBtCoex->c2hBtInfo));

	switch (pBtCoex->c2hBtInfo)
	{
		case BT_INFO_STATE_DISABLED:
			RTPRINT(FBT, BT_TRACE, ("Bt is disabled!!\n"));
			break;
		case BT_INFO_STATE_NO_CONNECTION:
			RTPRINT(FBT, BT_TRACE, ("Bt is disconnected!!\n"));
			break;
		case BT_INFO_STATE_CONNECT_IDLE:
			RTPRINT(FBT, BT_TRACE, ("Bt is connected & idle!!\n"));
			break;
		case BT_INFO_STATE_INQ_OR_PAG:
			RTPRINT(FBT, BT_TRACE, ("Bt is inquirying or paging!!\n"));
			break;
		case BT_INFO_STATE_ACL_ONLY_BUSY:
			RTPRINT(FBT, BT_TRACE, ("Bt is ACL only busy!!\n"));
			break;
		case BT_INFO_STATE_SCO_ONLY_BUSY:
			RTPRINT(FBT, BT_TRACE, ("Bt is SCO only busy!!\n"));
			break;
		case BT_INFO_STATE_ACL_SCO_BUSY:
			RTPRINT(FBT, BT_TRACE, ("Bt is ACL+SCO busy!!\n"));
			break;
		default:
			RTPRINT(FBT, BT_TRACE, ("Undefined!!\n"));
			break;
	}

	if(pBtCoex->c2hBtProfile != BT_INFO_HID)
		pBtCoex->c2hBtProfile &= ~BT_INFO_HID;
}

void BTDM_1AntBtCoexist8723A(PADAPTER padapter)
{
	struct mlme_priv *pmlmepriv;
	PHAL_DATA_TYPE	pHalData;
	u32 curr_time, delta_time;


	pmlmepriv = &padapter->mlmepriv;
	pHalData = GET_HAL_DATA(padapter);

	if (check_fwstate(pmlmepriv, WIFI_SITE_MONITOR) == _TRUE)
	{
		// already done in BTDM_1AntForScan()
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], wifi is under scan progress!!\n"));
		return;
	}

	if (check_fwstate(pmlmepriv, WIFI_UNDER_LINKING) == _TRUE)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], wifi is under link progress!!\n"));
		return;
	}

	// under DHCP(Special packet)
	curr_time = rtw_get_current_time();
	delta_time = curr_time - padapter->pwrctrlpriv.DelayLPSLastTimeStamp;
	delta_time = rtw_systime_to_ms(delta_time);
	if (delta_time < 500) // 500ms
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], wifi is under DHCP progress(%d ms)!!\n", delta_time));
		return;
	}

	BTDM_CheckWiFiState(padapter);

	btdm_1AntBtCoexistHandler(padapter);
}

// ===== End of sync from SD7 driver HAL/BTCoexist/HalBtc87231Ant.c =====
#endif

#ifdef __HALBTC87232ANT_C__ // HAL/BTCoexist/HalBtc87232Ant.c
// ===== Below this line is sync from SD7 driver HAL/BTCoexist/HalBtc87232Ant.c =====

//============================================================
// local function proto type if needed
//============================================================
//============================================================
// local function start with btdm_
//============================================================
u8 btdm_ActionAlgorithm(PADAPTER	padapter)
{
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBTDM_8723A_2ANT pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm2Ant;
	u8			bScoExist=_FALSE, bBtLinkExist=_FALSE, bBtHsModeExist=_FALSE;
	u8			algorithm=BT_2ANT_COEX_ALGO_UNDEFINED;

	if(pBtMgnt->ExtConfig.NumberOfHandle)
	{
		bBtLinkExist = _TRUE;
	}
	if(pBtMgnt->ExtConfig.NumberOfSCO)
		{
		bScoExist = _TRUE;
		}
	if(BT_HsConnectionEstablished(padapter))
	{
		bBtHsModeExist = _TRUE;
	}

	//======================
	// here we get BT status first
	//======================
	// 1) initialize
	pBtdm8723->btStatus = BT_2ANT_BT_STATUS_IDLE;

	if( (bScoExist) ||(bBtHsModeExist) ||
		(BTHCI_CheckProfileExist(padapter,BT_PROFILE_HID)))
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], SCO or HID or HS exists, set BT non-idle !!!\n"));
		pBtdm8723->btStatus = BT_2ANT_BT_STATUS_NON_IDLE;
	}
	else
		{
		// A2dp profile
		if( (pBtMgnt->ExtConfig.NumberOfHandle == 1) &&
			(BTHCI_CheckProfileExist(padapter, BT_PROFILE_A2DP)) )
		{
			if(BTDM_BtTxRxCounterL(padapter) < 100)
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], A2DP, low priority tx+rx < 100, set BT connected-idle!!!\n"));
				pBtdm8723->btStatus = BT_2ANT_BT_STATUS_CONNECTED_IDLE;
		}
	else
	{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], A2DP, low priority tx+rx >= 100, set BT non-idle!!!\n"));
				pBtdm8723->btStatus = BT_2ANT_BT_STATUS_NON_IDLE;
	}
}
		// Pan profile
		if( (pBtMgnt->ExtConfig.NumberOfHandle == 1) &&
			(BTHCI_CheckProfileExist(padapter, BT_PROFILE_PAN)) )
{
			if(BTDM_BtTxRxCounterL(padapter) < 600)
	{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], PAN, low priority tx+rx < 600, set BT connected-idle!!!\n"));
				pBtdm8723->btStatus = BT_2ANT_BT_STATUS_CONNECTED_IDLE;
}
			else
{
				if(pHalData->bt_coexist.halCoex8723.lowPriorityTx)
				{
					if((pHalData->bt_coexist.halCoex8723.lowPriorityRx /pHalData->bt_coexist.halCoex8723.lowPriorityTx)>9 )
					{
						RTPRINT(FBT, BT_TRACE, ("[BTCoex], PAN, low priority rx/tx > 9, set BT connected-idle!!!\n"));
						pBtdm8723->btStatus = BT_2ANT_BT_STATUS_CONNECTED_IDLE;
}
				}
			}
			if(BT_2ANT_BT_STATUS_CONNECTED_IDLE != pBtdm8723->btStatus)
{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], PAN, set BT non-idle!!!\n"));
				pBtdm8723->btStatus = BT_2ANT_BT_STATUS_NON_IDLE;
}
		}
		// Pan+A2dp profile
		if( (pBtMgnt->ExtConfig.NumberOfHandle == 2) &&
			(BTHCI_CheckProfileExist(padapter, BT_PROFILE_A2DP)) &&
			(BTHCI_CheckProfileExist(padapter, BT_PROFILE_PAN)) )
{
			if(BTDM_BtTxRxCounterL(padapter) < 600)
	{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], PAN+A2DP, low priority tx+rx < 600, set BT connected-idle!!!\n"));
				pBtdm8723->btStatus = BT_2ANT_BT_STATUS_CONNECTED_IDLE;
	}
	else
	{
				if(pHalData->bt_coexist.halCoex8723.lowPriorityTx)
				{
					if((pHalData->bt_coexist.halCoex8723.lowPriorityRx /pHalData->bt_coexist.halCoex8723.lowPriorityTx)>9 )
					{
						RTPRINT(FBT, BT_TRACE, ("[BTCoex], PAN+A2DP, low priority rx/tx > 9, set BT connected-idle!!!\n"));
						pBtdm8723->btStatus = BT_2ANT_BT_STATUS_CONNECTED_IDLE;
	}
}
			}
			if(BT_2ANT_BT_STATUS_CONNECTED_IDLE != pBtdm8723->btStatus)
{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], PAN+A2DP, set BT non-idle!!!\n"));
				pBtdm8723->btStatus = BT_2ANT_BT_STATUS_NON_IDLE;
}
		}
	}
	if(BT_2ANT_BT_STATUS_IDLE != pBtdm8723->btStatus)
{
		pBtMgnt->ExtConfig.bBTBusy = _TRUE;
	}
	else
	{
		pBtMgnt->ExtConfig.bBTBusy = _FALSE;
}
	//======================

	if(!bBtLinkExist)
{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], No profile exists!!!\n"));
		return algorithm;
	}

	if(pBtMgnt->ExtConfig.NumberOfHandle == 1)
	{
		if(bScoExist)
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], SCO only\n"));
			algorithm = BT_2ANT_COEX_ALGO_SCO;
	}
		else
	{
			if(BTHCI_CheckProfileExist(padapter,BT_PROFILE_HID))
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID only\n"));
				algorithm = BT_2ANT_COEX_ALGO_HID;
	}
			else if(BTHCI_CheckProfileExist(padapter,BT_PROFILE_A2DP))
	{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], A2DP only\n"));
				algorithm = BT_2ANT_COEX_ALGO_A2DP;
	}
			else if(BTHCI_CheckProfileExist(padapter,BT_PROFILE_PAN))
	{
				if(bBtHsModeExist)
		{
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], PAN(HS) only\n"));
					algorithm = BT_2ANT_COEX_ALGO_PANHS;
		}
		else
		{
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], PAN(EDR) only\n"));
					algorithm = BT_2ANT_COEX_ALGO_PANEDR;
		}
	}
			else
	{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! NO matched profile for NumberOfHandle=%d \n",
					pBtMgnt->ExtConfig.NumberOfHandle));
	}
		}
	}
	else if(pBtMgnt->ExtConfig.NumberOfHandle == 2)
	{
		if(bScoExist)
		{
			if(BTHCI_CheckProfileExist(padapter, BT_PROFILE_HID))
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], SCO + HID\n"));
				algorithm = BT_2ANT_COEX_ALGO_HID;
	}
			else if(BTHCI_CheckProfileExist(padapter,BT_PROFILE_A2DP))
	{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! SCO + A2DP\n"));
	}
			else if(BTHCI_CheckProfileExist(padapter,BT_PROFILE_PAN))
			{
				if(bBtHsModeExist)
				{
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], SCO + PAN(HS)\n"));
					algorithm = BT_2ANT_COEX_ALGO_SCO;
}
				else
{
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], SCO + PAN(EDR)\n"));
					algorithm = BT_2ANT_COEX_ALGO_PANEDR_HID;
				}
			}
			else
	{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! SCO exists but why NO matched ACL profile for NumberOfHandle=%d\n",
					pBtMgnt->ExtConfig.NumberOfHandle));
			}
	}
	else
	{
			if( BTHCI_CheckProfileExist(padapter,BT_PROFILE_HID) &&
				BTHCI_CheckProfileExist(padapter,BT_PROFILE_A2DP) )
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + A2DP\n"));
				algorithm = BT_2ANT_COEX_ALGO_HID_A2DP;
	}
			else if( BTHCI_CheckProfileExist(padapter,BT_PROFILE_HID) &&
				BTHCI_CheckProfileExist(padapter,BT_PROFILE_PAN) )
			{
				if(bBtHsModeExist)
				{
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + PAN(HS)\n"));
					algorithm = BT_2ANT_COEX_ALGO_HID_A2DP;
}
				else
{
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + PAN(EDR)\n"));
					algorithm = BT_2ANT_COEX_ALGO_PANEDR_HID;
				}
			}
			else if( BTHCI_CheckProfileExist(padapter,BT_PROFILE_PAN) &&
				BTHCI_CheckProfileExist(padapter,BT_PROFILE_A2DP) )
	{
				if(bBtHsModeExist)
				{
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], A2DP + PAN(HS)\n"));
					algorithm = BT_2ANT_COEX_ALGO_A2DP;
	}
				else
	{
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], A2DP + PAN(EDR)\n"));
					algorithm = BT_2ANT_COEX_ALGO_PANEDR_A2DP;
	}
}
			else
{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! NO matched profile for NumberOfHandle=%d\n",
					pBtMgnt->ExtConfig.NumberOfHandle));
			}
		}
	}
	else if(pBtMgnt->ExtConfig.NumberOfHandle == 3)
	{
		if(bScoExist)
		{
			if( BTHCI_CheckProfileExist(padapter,BT_PROFILE_HID) &&
				BTHCI_CheckProfileExist(padapter,BT_PROFILE_A2DP) )
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! SCO + HID + A2DP\n"));
		}
			else if( BTHCI_CheckProfileExist(padapter,BT_PROFILE_HID) &&
				BTHCI_CheckProfileExist(padapter,BT_PROFILE_PAN) )
			{
				if(bBtHsModeExist)
		{
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], SCO + HID + PAN(HS)\n"));
					algorithm = BT_2ANT_COEX_ALGO_HID_A2DP;
		}
		else
		{
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], SCO + HID + PAN(EDR)\n"));
					algorithm = BT_2ANT_COEX_ALGO_PANEDR_HID;
		}
		}
			else if( BTHCI_CheckProfileExist(padapter,BT_PROFILE_PAN) &&
				BTHCI_CheckProfileExist(padapter,BT_PROFILE_A2DP) )
			{
				if(bBtHsModeExist)
		{
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! SCO + A2DP + PAN(HS)\n"));
					algorithm = BT_2ANT_COEX_ALGO_SCO;
		}
				else
				{
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! SCO + A2DP + PAN(EDR)\n"));

