acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
				}
			}
			else
		{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! SCO exists but why NO matched profile for NumberOfHandle=%d\n",
					pBtMgnt->ExtConfig.NumberOfHandle));
			}
		}
		else
		{
			if( BTHCI_CheckProfileExist(padapter,BT_PROFILE_HID) &&
				BTHCI_CheckProfileExist(padapter,BT_PROFILE_PAN) &&
				BTHCI_CheckProfileExist(padapter,BT_PROFILE_A2DP) )
			{
				if(bBtHsModeExist)
				{
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + A2DP + PAN(HS)\n"));
					algorithm = BT_2ANT_COEX_ALGO_HID_A2DP_PANHS;
		}
				else
		{
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + A2DP + PAN(EDR)\n"));
					algorithm = BT_2ANT_COEX_ALGO_HID_A2DP_PANEDR;
		}
	}
	else
	{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! NO matched profile for NumberOfHandle=%d\n",
					pBtMgnt->ExtConfig.NumberOfHandle));
	}
		}
	}
	else if(pBtMgnt->ExtConfig.NumberOfHandle >= 3)
	{
		if(bScoExist)
		{
			if( BTHCI_CheckProfileExist(padapter,BT_PROFILE_HID) &&
				BTHCI_CheckProfileExist(padapter,BT_PROFILE_PAN) &&
				BTHCI_CheckProfileExist(padapter,BT_PROFILE_A2DP) )
			{
				if(bBtHsModeExist)
				{
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! SCO + HID + A2DP + PAN(HS)\n"));

				}
				else
				{
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! SCO + HID + A2DP + PAN(EDR)\n"));

				}
			}
			else
	{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! SCO exists but why NO matched profile for NumberOfHandle=%d\n",
					pBtMgnt->ExtConfig.NumberOfHandle));
	}
}
		else
{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! NO matched profile for NumberOfHandle=%d\n",
				pBtMgnt->ExtConfig.NumberOfHandle));
		}
	}

	return algorithm;
	}

u8 btdm_NeedToDecBtPwr(PADAPTER padapter)
	{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PADAPTER	pDefaultAdapter = GetDefaultAdapter(padapter);
	u8	bRet=_FALSE;

	if(BT_Operation(padapter))
		{
		if(pHalData->dmpriv.EntryMinUndecoratedSmoothedPWDB > 47)
		{
			RTPRINT(FBT, BT_TRACE, ("Need to decrease bt power for HS mode!!\n"));
			bRet = _TRUE;
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("NO Need to decrease bt power for HS mode!!\n"));
	}
		}
		else
		{
		if(BTDM_IsWifiConnectionExist(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("Need to decrease bt power for Wifi is connected!!\n"));
			bRet = _TRUE;
		}
	#if 0
		if(MgntLinkStatusQuery(pDefaultAdapter) == RT_MEDIA_CONNECT)
		{
			RTPRINT(FBT, BT_TRACE, ("Need to decrease bt power for Wifi is connected!!\n"));
			bRet = TRUE;
		}
	#endif
		}
	return bRet;
}


u8 btdm_IsBadIsolation(PADAPTER padapter)
		{
	return _FALSE;
		}

void
btdm_SetCoexTable(
	PADAPTER	padapter,
	u32		val0x6c0,
	u32		val0x6c8,
	u8		val0x6cc
	)
		{
	RTPRINT(FBT, BT_TRACE, ("set coex table, set 0x6c0=0x%x\n", val0x6c0));
	rtw_write32(padapter, 0x6c0, val0x6c0);

	RTPRINT(FBT, BT_TRACE, ("set coex table, set 0x6c8=0x%x\n", val0x6c8));
	rtw_write32(padapter, 0x6c8, val0x6c8);

	RTPRINT(FBT, BT_TRACE, ("set coex table, set 0x6cc=0x%x\n", val0x6cc));
	rtw_write8(padapter, 0x6cc, val0x6cc);
		}


void btdm_SetSwFullTimeDacSwing(PADAPTER		padapter,u8	bSwDacSwingOn,u32	swDacSwingLvl)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if(bSwDacSwingOn)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], SwDacSwing = 0x%x\n", swDacSwingLvl));
		PHY_SetBBReg(padapter, 0x880, 0xff000000, swDacSwingLvl);
		pHalData->bt_coexist.bSWCoexistAllOff = _FALSE;
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], SwDacSwing Off!\n"));
		PHY_SetBBReg(padapter, 0x880, 0xff000000, 0xc0);
	}
}


void btdm_SetFwDacSwingLevel(PADAPTER padapter, u8 dacSwingLvl)
{
	u1Byte			H2C_Parameter[1] ={0};

	H2C_Parameter[0] = dacSwingLvl;

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], Set Dac Swing Level=0x%x\n", dacSwingLvl));
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], write 0x29=0x%x\n", H2C_Parameter[0]));

	FillH2CCmd(padapter, 0x29, 1, H2C_Parameter);
}

void btdm_2AntDecBtPwr(PADAPTER padapter,u8 	bDecBtPwr)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBTDM_8723A_2ANT pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm2Ant;

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], Dec BT power = %s\n",  ((bDecBtPwr)? "ON":"OFF")));
	pBtdm8723->bCurDecBtPwr = bDecBtPwr;

	//RTPRINT(FBT, BT_TRACE, ("[BTCoex], bPreDecBtPwr=%d, bCurDecBtPwr=%d\n",
	//	pBtdm8723->bPreDecBtPwr, pBtdm8723->bCurDecBtPwr));

	if(pBtdm8723->bPreDecBtPwr == pBtdm8723->bCurDecBtPwr)
		return;

	BTDM_SetFwDecBtPwr(padapter, pBtdm8723->bCurDecBtPwr);

	pBtdm8723->bPreDecBtPwr = pBtdm8723->bCurDecBtPwr;
}

 void btdm_2AntFwDacSwingLvl(PADAPTER	padapter,u8	fwDacSwingLvl)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBTDM_8723A_2ANT	pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm2Ant;

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], set FW Dac Swing level = %d\n",  fwDacSwingLvl));
	pBtdm8723->curFwDacSwingLvl = fwDacSwingLvl;

	//RTPRINT(FBT, BT_TRACE, ("[BTCoex], preFwDacSwingLvl=%d, curFwDacSwingLvl=%d\n",
	//	pBtdm8723->preFwDacSwingLvl, pBtdm8723->curFwDacSwingLvl));

	if(pBtdm8723->preFwDacSwingLvl == pBtdm8723->curFwDacSwingLvl)
		return;

	btdm_SetFwDacSwingLevel(padapter, pBtdm8723->curFwDacSwingLvl);

	pBtdm8723->preFwDacSwingLvl = pBtdm8723->curFwDacSwingLvl;
}

void btdm_2AntRfShrink( PADAPTER	padapter, u8	bRxRfShrinkOn)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBTDM_8723A_2ANT	pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm2Ant;

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], turn Rx RF Shrink = %s\n",  ((bRxRfShrinkOn)? "ON":"OFF")));
	pBtdm8723->bCurRfRxLpfShrink = bRxRfShrinkOn;

	//RTPRINT(FBT, BT_TRACE, ("[BTCoex], bPreRfRxLpfShrink=%d, bCurRfRxLpfShrink=%d\n",
	//	pBtdm8723->bPreRfRxLpfShrink, pBtdm8723->bCurRfRxLpfShrink));

	if(pBtdm8723->bPreRfRxLpfShrink == pBtdm8723->bCurRfRxLpfShrink)
		return;

	BTDM_SetSwRfRxLpfCorner(padapter, (u8)pBtdm8723->bCurRfRxLpfShrink);

	pBtdm8723->bPreRfRxLpfShrink = pBtdm8723->bCurRfRxLpfShrink;
}

void btdm_2AntLowPenaltyRa(PADAPTER	padapter, u8	bLowPenaltyRa)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBTDM_8723A_2ANT	pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm2Ant;

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], turn LowPenaltyRA = %s\n",  ((bLowPenaltyRa)? "ON":"OFF")));
	pBtdm8723->bCurLowPenaltyRa = bLowPenaltyRa;

	//RTPRINT(FBT, BT_TRACE, ("[BTCoex], bPreLowPenaltyRa=%d, bCurLowPenaltyRa=%d\n",
	//	pBtdm8723->bPreLowPenaltyRa, pBtdm8723->bCurLowPenaltyRa));

	if(pBtdm8723->bPreLowPenaltyRa == pBtdm8723->bCurLowPenaltyRa)
		return;

	BTDM_SetSwPenaltyTxRateAdaptive(padapter, (u1Byte)pBtdm8723->bCurLowPenaltyRa);

	pBtdm8723->bPreLowPenaltyRa = pBtdm8723->bCurLowPenaltyRa;
	}



void btdm_2AntDacSwing(PADAPTER	padapter,u8	bDacSwingOn,u32	dacSwingLvl	)
		{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBTDM_8723A_2ANT	pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm2Ant;

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], turn DacSwing=%s, dacSwingLvl=0x%x\n",
		((bDacSwingOn)? "ON":"OFF"), dacSwingLvl));
	pBtdm8723->bCurDacSwingOn = bDacSwingOn;
	pBtdm8723->curDacSwingLvl = dacSwingLvl;

	//RTPRINT(FBT, BT_TRACE, ("[BTCoex], bPreDacSwingOn=%d, preDacSwingLvl=0x%x, bCurDacSwingOn=%d, curDacSwingLvl=0x%x\n",
	//	pBtdm8723->bPreDacSwingOn, pBtdm8723->preDacSwingLvl,
	//	pBtdm8723->bCurDacSwingOn, pBtdm8723->curDacSwingLvl));

	if( (pBtdm8723->bPreDacSwingOn == pBtdm8723->bCurDacSwingOn) &&
		(pBtdm8723->preDacSwingLvl == pBtdm8723->curDacSwingLvl) )
		return;

