acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
void btdm_2AntBtInquiryPage(PADAPTER	padapter)
{
	btdm_2AntCoexTable(padapter, 0x55555555, 0xffff, 0x3);
	btdm_2AntIgnoreWlanAct(padapter, _FALSE);
	btdm_2AntPsTdma(padapter, _TRUE, 8);
}


u8 btdm_HoldForBtInqPage( PADAPTER	padapter)
	{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u32			curTime=rtw_get_current_time();

	if(pHalData->bt_coexist.halCoex8723.bC2hBtInquiryPage)
	{
		// bt inquiry or page is started.
		if(pHalData->bt_coexist.halCoex8723.btInqPageStartTime == 0)
		{
			pHalData->bt_coexist.halCoex8723.btInqPageStartTime = curTime;
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT Inquiry/page is started at time : 0x%"i64fmt"x \n",
			pHalData->bt_coexist.halCoex8723.btInqPageStartTime));
		}
	}
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT Inquiry/page started time : 0x%"i64fmt"x, curTime : 0x%x \n",
		pHalData->bt_coexist.halCoex8723.btInqPageStartTime, curTime));

	if(pHalData->bt_coexist.halCoex8723.btInqPageStartTime)
	{
		if(( (curTime - pHalData->bt_coexist.halCoex8723.btInqPageStartTime)/1000000) >= 10)
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT Inquiry/page >= 10sec!!!"));
			pHalData->bt_coexist.halCoex8723.btInqPageStartTime = 0;
		}
		}

	if(pHalData->bt_coexist.halCoex8723.btInqPageStartTime)
		{
		btdm_2AntCoexTable(padapter, 0x55555555, 0xffff, 0x3);
		btdm_2AntIgnoreWlanAct(padapter, _FALSE);
		btdm_2AntPsTdma(padapter, _TRUE, 8);
		return _TRUE;
		}
		else
		return _FALSE;
		}


u8 btdm_Is2Ant8723ACommonAction(PADAPTER	padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBTDM_8723A_2ANT pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm2Ant;
	u8			bCommon=_FALSE;

	RTPRINT(FBT, BT_TRACE, ("%s :BTDM_IsWifiConnectionExist =%x check_fwstate=%x pmlmepriv->fw_state=0x%x\n",__func__,BTDM_IsWifiConnectionExist(padapter),check_fwstate(&padapter->mlmepriv, (_FW_UNDER_SURVEY|_FW_UNDER_LINKING)),padapter->mlmepriv.fw_state));


//	if(!BTDM_IsWifiBusy(padapter) &&
	if((BTDM_IsWifiConnectionExist(padapter) == _FALSE)&&(check_fwstate(&padapter->mlmepriv, (_FW_UNDER_SURVEY|_FW_UNDER_LINKING))== _FALSE)&&
		(BT_2ANT_BT_STATUS_IDLE == pBtdm8723->btStatus) )
	{
		RTPRINT(FBT, BT_TRACE, ("Wifi idle + Bt idle!!\n"));

		btdm_2AntLowPenaltyRa(padapter, _FALSE);
		btdm_2AntRfShrink(padapter, _FALSE);
		btdm_2AntCoexTable(padapter, 0x55555555, 0xffff, 0x3);

		btdm_2AntIgnoreWlanAct(padapter, _FALSE);
		btdm_2AntPsTdma(padapter, _FALSE, 0);
		btdm_2AntFwDacSwingLvl(padapter, 0x20);
		btdm_2AntDecBtPwr(padapter, _FALSE);

		btdm_2AntAgcTable(padapter, _FALSE);
		btdm_2AntAdcBackOff(padapter, _FALSE);
		btdm_2AntDacSwing(padapter, _FALSE, 0xc0);

		bCommon = _TRUE;
	}
//	else if( BTDM_IsWifiBusy(padapter) &&
	else if(((BTDM_IsWifiConnectionExist(padapter) == _TRUE)||(check_fwstate(&padapter->mlmepriv, (_FW_UNDER_SURVEY|_FW_UNDER_LINKING))== _TRUE))&&
			(BT_2ANT_BT_STATUS_IDLE == pBtdm8723->btStatus) )
	{
		RTPRINT(FBT, BT_TRACE, ("Wifi non-idle + BT idle!!\n"));

		btdm_2AntLowPenaltyRa(padapter, _TRUE);
		btdm_2AntRfShrink(padapter, _FALSE);
		btdm_2AntCoexTable(padapter, 0x55555555, 0xffff, 0x3);

		btdm_2AntIgnoreWlanAct(padapter, _FALSE);
		btdm_2AntPsTdma(padapter, _FALSE, 0);
		btdm_2AntFwDacSwingLvl(padapter, 0x20);
		btdm_2AntDecBtPwr(padapter, _TRUE);

		btdm_2AntAgcTable(padapter, _FALSE);
		btdm_2AntAdcBackOff(padapter, _FALSE);
		btdm_2AntDacSwing(padapter, _FALSE, 0xc0);

		bCommon = _TRUE;
}
//	else if(!BTDM_IsWifiBusy(padapter) &&
	else if((BTDM_IsWifiConnectionExist(padapter) == _FALSE)&&(check_fwstate(&padapter->mlmepriv, (_FW_UNDER_SURVEY|_FW_UNDER_LINKING))== _FALSE)&&
		(BT_2ANT_BT_STATUS_CONNECTED_IDLE == pBtdm8723->btStatus) )
	{
		RTPRINT(FBT, BT_TRACE, ("Wifi idle + Bt connected idle!!\n"));

		btdm_2AntLowPenaltyRa(padapter, _TRUE);
		btdm_2AntRfShrink(padapter, _TRUE);
		btdm_2AntCoexTable(padapter, 0x55555555, 0xffff, 0x3);

		btdm_2AntIgnoreWlanAct(padapter, _FALSE);
		btdm_2AntPsTdma(padapter, _FALSE, 0);
		btdm_2AntFwDacSwingLvl(padapter, 0x20);
		btdm_2AntDecBtPwr(padapter, _FALSE);

		btdm_2AntAgcTable(padapter, _FALSE);
		btdm_2AntAdcBackOff(padapter, _FALSE);
		btdm_2AntDacSwing(padapter, _FALSE, 0xc0);

		bCommon = _TRUE;
	}
//	else if(BTDM_IsWifiBusy(padapter) &&
	else if(((BTDM_IsWifiConnectionExist(padapter) == _TRUE)||(check_fwstate(&padapter->mlmepriv, (_FW_UNDER_SURVEY|_FW_UNDER_LINKING))== _TRUE))&&
		(BT_2ANT_BT_STATUS_CONNECTED_IDLE == pBtdm8723->btStatus) )
{
		RTPRINT(FBT, BT_TRACE, ("Wifi non-idle + Bt connected idle!!\n"));

		btdm_2AntLowPenaltyRa(padapter, _TRUE);
		btdm_2AntRfShrink(padapter, _TRUE);
		btdm_2AntCoexTable(padapter, 0x55555555, 0xffff, 0x3);

		btdm_2AntIgnoreWlanAct(padapter, _FALSE);
		btdm_2AntPsTdma(padapter, _FALSE, 0);
		btdm_2AntFwDacSwingLvl(padapter, 0x20);
		btdm_2AntDecBtPwr(padapter, _TRUE);

		btdm_2AntAgcTable(padapter, _FALSE);
		btdm_2AntAdcBackOff(padapter, _FALSE);
		btdm_2AntDacSwing(padapter, _FALSE, 0xc0);

		bCommon = _TRUE;
	}
//	else if(!BTDM_IsWifiBusy(padapter) &&
	else if((BTDM_IsWifiConnectionExist(padapter) == _FALSE)&&(check_fwstate(&padapter->mlmepriv, (_FW_UNDER_SURVEY|_FW_UNDER_LINKING))== _FALSE)&&
			(BT_2ANT_BT_STATUS_NON_IDLE == pBtdm8723->btStatus) )
	{
		RTPRINT(FBT, BT_TRACE, ("Wifi idle + BT non-idle!!\n"));

		btdm_2AntLowPenaltyRa(padapter, _TRUE);
		btdm_2AntRfShrink(padapter, _TRUE);
		btdm_2AntCoexTable(padapter, 0x55555555, 0xffff, 0x3);

		btdm_2AntIgnoreWlanAct(padapter, _FALSE);
		btdm_2AntPsTdma(padapter, _FALSE, 0);
		btdm_2AntFwDacSwingLvl(padapter, 0x20);
		btdm_2AntDecBtPwr(padapter, _FALSE);

		btdm_2AntAgcTable(padapter, _FALSE);
		btdm_2AntAdcBackOff(padapter, _FALSE);
		btdm_2AntDacSwing(padapter, _FALSE, 0xc0);

		bCommon = _TRUE;
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("Wifi non-idle + BT non-idle!!\n"));
		btdm_2AntLowPenaltyRa(padapter, _TRUE);
		btdm_2AntRfShrink(padapter, _TRUE);
		btdm_2AntCoexTable(padapter, 0x55555555, 0xffff, 0x3);
		btdm_2AntIgnoreWlanAct(padapter, _FALSE);
		btdm_2AntFwDacSwingLvl(padapter, 0x20);

		bCommon = _FALSE;
	}

	return bCommon;
}


void btdm_2AntTdmaDurationAdjust(PADAPTER	 padapter,u8		bScoHid,u8	bTxPause,u8		maxInterval)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBT_MGNT		pBtMgnt = &pHalData->BtInfo.BtMgnt;
	PBTDM_8723A_2ANT pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm2Ant;
	static s32		up,dn,m,n,WaitCount;
	s32			result;   //0: no change, +1: increase WiFi duration, -1: decrease WiFi duration
	u8			retryCount=0;
//	u8			BtState;

//	BtState = pHalData->bt_coexist.halCoex8723.c2hBtInfo;

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], TdmaDurationAdjust()\n"));

	if(pBtdm8723->bResetTdmaAdjust)
	{
		pBtdm8723->bResetTdmaAdjust = _FALSE;
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], first run TdmaDurationAdjust()!!\n"));
		{
			if(bScoHid)
			{
				if(bTxPause)
				{
					if(maxInterval == 1)
					{
						btdm_2AntPsTdma(padapter, _TRUE, 15);
						pBtdm8723->psTdmaDuAdjType = 15;
}
					else if(maxInterval == 2)
{
						btdm_2AntPsTdma(padapter, _TRUE, 15);
						pBtdm8723->psTdmaDuAdjType = 15;
					}
					else if(maxInterval == 3)
	{
						btdm_2AntPsTdma(padapter, _TRUE, 15);
						pBtdm8723->psTdmaDuAdjType = 15;
	}
	else
	{
						btdm_2AntPsTdma(padapter, _TRUE, 15);
						pBtdm8723->psTdmaDuAdjType = 15;
	}
}
				else
{
					if(maxInterval == 1)
	{
						btdm_2AntPsTdma(padapter, _TRUE, 11);
						pBtdm8723->psTdmaDuAdjType = 11;
					}
					else if(maxInterval == 2)
		{
						btdm_2AntPsTdma(padapter, _TRUE, 11);
						pBtdm8723->psTdmaDuAdjType = 11;
		}
					else if(maxInterval == 3)
		{
						btdm_2AntPsTdma(padapter, _TRUE, 11);
						pBtdm8723->psTdmaDuAdjType = 11;
					}
					else
			{
						btdm_2AntPsTdma(padapter, _TRUE, 11);
						pBtdm8723->psTdmaDuAdjType = 11;
			}
		}
	}
	else
	{
				if(bTxPause)
		{
					if(maxInterval == 1)
					{
						btdm_2AntPsTdma(padapter, _TRUE, 7);
						pBtdm8723->psTdmaDuAdjType = 7;
		}
					else if(maxInterval == 2)
		{
						btdm_2AntPsTdma(padapter, _TRUE, 7);
						pBtdm8723->psTdmaDuAdjType = 7;
					}
					else if(maxInterval == 3)
			{
						btdm_2AntPsTdma(padapter, _TRUE, 7);
						pBtdm8723->psTdmaDuAdjType = 7;
			}
					else
					{
						btdm_2AntPsTdma(padapter, _TRUE, 7);
						pBtdm8723->psTdmaDuAdjType = 7;
		}
	}
				else
	{
					if(maxInterval == 1)
					{
						btdm_2AntPsTdma(padapter, _TRUE, 3);
						pBtdm8723->psTdmaDuAdjType = 3;
					}
					else if(maxInterval == 2)
					{
						btdm_2AntPsTdma(padapter, _TRUE, 3);
						pBtdm8723->psTdmaDuAdjType = 3;
					}
					else if(maxInterval == 3)
					{
						btdm_2AntPsTdma(padapter, _TRUE, 3);
						pBtdm8723->psTdmaDuAdjType = 3;
	}
	else
	{
						btdm_2AntPsTdma(padapter, _TRUE, 3);
						pBtdm8723->psTdmaDuAdjType = 3;
	}
}
			}
		}
		//============
		up = 0;
		dn = 0;
		m = 1;
		n= 3;
		result = 0;
		WaitCount = 0;
	}
	else
	{
		//accquire the BT TRx retry count from BT_Info byte2
		retryCount = pHalData->bt_coexist.halCoex8723.btRetryCnt;
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], retryCount = %d\n", retryCount));
		result = 0;
		WaitCount++;

