acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
void btdm_2Ant8723AHIDAction(PADAPTER padapter)
{
	u8		btRssiState, btRssiState1;

	if(btdm_NeedToDecBtPwr(padapter))
		btdm_2AntDecBtPwr(padapter, _TRUE);
	else
		btdm_2AntDecBtPwr(padapter, _FALSE);

	if (BTDM_IsHT40(padapter))
	{
		RTPRINT(FBT, BT_TRACE, ("HT40\n"));
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, 37, 0);
			// fw mechanism
		if( (btRssiState == BT_RSSI_STATE_HIGH) ||
			(btRssiState == BT_RSSI_STATE_STAY_HIGH) )
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi-1 high \n"));
			PlatformEFIOWrite1Byte(padapter, 0x883, 0x40);
			btdm_2AntPsTdma(padapter, _TRUE, 9);
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi-1 low \n"));
			btdm_2AntPsTdma(padapter, _TRUE, 13);
		}

		// sw mechanism
		btdm_2AntAgcTable(padapter, _FALSE);
		btdm_2AntAdcBackOff(padapter, _FALSE);
		btdm_2AntDacSwing(padapter, _FALSE, 0xc0);
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("HT20 or Legacy\n"));
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, 37, 0);
		btRssiState1 = BTDM_CheckCoexRSSIState1(padapter, 2, 27, 0);

		// fw mechanism
		if( (btRssiState1 == BT_RSSI_STATE_HIGH) ||
			(btRssiState1 == BT_RSSI_STATE_STAY_HIGH) )
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi-1 high \n"));
			PlatformEFIOWrite1Byte(padapter, 0x883, 0x40);
			btdm_2AntPsTdma(padapter, _TRUE, 9);
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi-1 low \n"));
			btdm_2AntPsTdma(padapter, _TRUE, 13);
		}

			// sw mechanism
			if ((btRssiState == BT_RSSI_STATE_HIGH) ||
				(btRssiState == BT_RSSI_STATE_STAY_HIGH))
			{
				RTPRINT(FBT, BT_TRACE, ("Wifi rssi high \n"));
			btdm_2AntAgcTable(padapter, _TRUE);
			btdm_2AntAdcBackOff(padapter, _TRUE);
			btdm_2AntDacSwing(padapter, _FALSE, 0xc0);
			}
			else
			{
				RTPRINT(FBT, BT_TRACE, ("Wifi rssi low \n"));
			btdm_2AntAgcTable(padapter, _FALSE);
			btdm_2AntAdcBackOff(padapter, _FALSE);
			btdm_2AntDacSwing(padapter, _FALSE, 0xc0);
		}
			}
		}

//A2DP only / PAN(EDR) only/ A2DP+PAN(HS)
void btdm_2Ant8723AA2DPAction(PADAPTER padapter)
{
	u8		btRssiState, btRssiState1;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u8 		btInfoExt=pHalData->bt_coexist.halCoex8723.btInfoExt;

	if(btdm_NeedToDecBtPwr(padapter))
		btdm_2AntDecBtPwr(padapter, _TRUE);
		else
		btdm_2AntDecBtPwr(padapter, _FALSE);

	if(BTDM_IsHT40(padapter))
		{
		RTPRINT(FBT, BT_TRACE, ("HT40\n"));
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, 37, 0);

		// fw mechanism
			if ((btRssiState == BT_RSSI_STATE_HIGH) ||
				(btRssiState == BT_RSSI_STATE_STAY_HIGH))
			{
				RTPRINT(FBT, BT_TRACE, ("Wifi rssi high \n"));
			PlatformEFIOWrite1Byte(padapter, 0x883, 0x40);

			if(btInfoExt&BIT(0))	//a2dp rate, 1:basic /0:edr
			{
				RTPRINT(FBT, BT_TRACE, ("a2dp basic rate \n"));
				btdm_2AntTdmaDurationAdjust(padapter, _FALSE, _FALSE, 3);
			}
			else
			{
				RTPRINT(FBT, BT_TRACE, ("a2dp edr rate \n"));
			btdm_2AntTdmaDurationAdjust(padapter, _FALSE, _FALSE, 1);
		}
			}
			else
			{
				RTPRINT(FBT, BT_TRACE, ("Wifi rssi low \n"));
			if(btInfoExt&BIT(0))	//a2dp rate, 1:basic /0:edr
			{
				RTPRINT(FBT, BT_TRACE, ("a2dp basic rate \n"));
				btdm_2AntTdmaDurationAdjust(padapter, _FALSE, _TRUE, 3);
			}
			else
			{
				RTPRINT(FBT, BT_TRACE, ("a2dp edr rate \n"));
			btdm_2AntTdmaDurationAdjust(padapter, _FALSE, _TRUE, 1);
		}
	}

		// sw mechanism
		btdm_2AntAgcTable(padapter, _FALSE);
		btdm_2AntAdcBackOff(padapter, _TRUE);
		btdm_2AntDacSwing(padapter, _FALSE, 0xc0);
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("HT20 or Legacy\n"));
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, 37, 0);
		btRssiState1 = BTDM_CheckCoexRSSIState1(padapter, 2, 27, 0);

		// fw mechanism
		if( (btRssiState1 == BT_RSSI_STATE_HIGH) ||
			(btRssiState1 == BT_RSSI_STATE_STAY_HIGH) )
	{
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi-1 high \n"));
			PlatformEFIOWrite1Byte(padapter, 0x883, 0x40);
			if(btInfoExt&BIT(0))	//a2dp rate, 1:basic /0:edr
			{
				RTPRINT(FBT, BT_TRACE, ("a2dp basic rate \n"));
				btdm_2AntTdmaDurationAdjust(padapter, _FALSE, _FALSE, 3);
	}
			else
			{
				RTPRINT(FBT, BT_TRACE, ("a2dp edr rate \n"));
			btdm_2AntTdmaDurationAdjust(padapter, _FALSE, _FALSE, 1);
}
		}
		else
{
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi-1 low \n"));
			if(btInfoExt&BIT(0))	//a2dp rate, 1:basic /0:edr
			{
				RTPRINT(FBT, BT_TRACE, ("a2dp basic rate \n"));
				btdm_2AntTdmaDurationAdjust(padapter, _FALSE, _TRUE, 3);
			}
			else
			{
				RTPRINT(FBT, BT_TRACE, ("a2dp edr rate \n"));
			btdm_2AntTdmaDurationAdjust(padapter, _FALSE, _TRUE, 1);
		}
		}

		// sw mechanism
		if( (btRssiState == BT_RSSI_STATE_HIGH) ||
			(btRssiState == BT_RSSI_STATE_STAY_HIGH) )
	{
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi high \n"));
			btdm_2AntAgcTable(padapter, _TRUE);
			btdm_2AntAdcBackOff(padapter, _TRUE);
			btdm_2AntDacSwing(padapter, _FALSE, 0xc0);
	}
	else
	{
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi low \n"));
			btdm_2AntAgcTable(padapter, _FALSE);
			btdm_2AntAdcBackOff(padapter, _FALSE);
			btdm_2AntDacSwing(padapter, _FALSE, 0xc0);
		}
	}
}


void btdm_2Ant8723APANEDRAction(PADAPTER padapter)
{
	u8		btRssiState, btRssiState1;

	if(btdm_NeedToDecBtPwr(padapter))
		btdm_2AntDecBtPwr(padapter, _TRUE);
	else
		btdm_2AntDecBtPwr(padapter, _FALSE);

		if(BTDM_IsHT40(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("HT40\n"));
			btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, 37, 0);

			// fw mechanism
			if( (btRssiState == BT_RSSI_STATE_HIGH) ||
				(btRssiState == BT_RSSI_STATE_STAY_HIGH) )
			{
				RTPRINT(FBT, BT_TRACE, ("Wifi rssi high \n"));
			PlatformEFIOWrite1Byte(padapter, 0x883, 0x40);
			btdm_2AntPsTdma(padapter, _TRUE, 2);
			}
			else
			{
				RTPRINT(FBT, BT_TRACE, ("Wifi rssi low \n"));
			btdm_2AntPsTdma(padapter, _TRUE, 6);
			}

		// sw mechanism
		btdm_2AntAgcTable(padapter, _FALSE);
		btdm_2AntAdcBackOff(padapter, _TRUE);
		btdm_2AntDacSwing(padapter, _FALSE, 0xc0);
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("HT20 or Legacy\n"));
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, 37, 0);
			btRssiState1 = BTDM_CheckCoexRSSIState1(padapter, 2, 27, 0);

		// fw mechanism
		if( (btRssiState1 == BT_RSSI_STATE_HIGH) ||
			(btRssiState1 == BT_RSSI_STATE_STAY_HIGH) )
			{
				RTPRINT(FBT, BT_TRACE, ("Wifi rssi-1 high \n"));
			PlatformEFIOWrite1Byte(padapter, 0x883, 0x40);
			btdm_2AntPsTdma(padapter, _TRUE, 2);
			}
			else
{
				RTPRINT(FBT, BT_TRACE, ("Wifi rssi-1 low \n"));
			btdm_2AntPsTdma(padapter, _TRUE, 6);
			}

		// sw mechanism
		if( (btRssiState == BT_RSSI_STATE_HIGH) ||
			(btRssiState == BT_RSSI_STATE_STAY_HIGH) )
			{
				RTPRINT(FBT, BT_TRACE, ("Wifi rssi high \n"));
			btdm_2AntAgcTable(padapter, _TRUE);
			btdm_2AntAdcBackOff(padapter, _TRUE);
			btdm_2AntDacSwing(padapter, _FALSE, 0xc0);
			}
			else
			{
				RTPRINT(FBT, BT_TRACE, ("Wifi rssi low \n"));
			btdm_2AntAgcTable(padapter, _FALSE);
			btdm_2AntAdcBackOff(padapter, _FALSE);
			btdm_2AntDacSwing(padapter, _FALSE, 0xc0);
			}
		}
	}



//PAN(HS) only
void btdm_2Ant8723APANHSAction(PADAPTER	padapter)
{
	u8		btRssiState, btRssiState1;

	if (BTDM_IsHT40(padapter))
	{
		RTPRINT(FBT, BT_TRACE, ("HT40\n"));
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, 47, 0);
		// fw mechanism
		if( (btRssiState == BT_RSSI_STATE_HIGH) ||
			(btRssiState == BT_RSSI_STATE_STAY_HIGH) )
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi high \n"));
			btdm_2AntDecBtPwr(padapter, _TRUE);
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi low \n"));
			btdm_2AntDecBtPwr(padapter, _FALSE);
		}
		btdm_2AntPsTdma(padapter, _FALSE, 0);

		// sw mechanism
		btdm_2AntAgcTable(padapter, _FALSE);
		btdm_2AntAdcBackOff(padapter, _TRUE);
		btdm_2AntDacSwing(padapter, _FALSE, 0xc0);
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("HT20 or Legacy\n"));
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, 47, 0);

