acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
	pBtdm8723->bPreDecBtPwr = _TRUE;
	btdm_2AntDecBtPwr(padapter, _FALSE);

	pBtdm8723->bPreAgcTableEn = _TRUE;
	btdm_2AntAgcTable(padapter, _FALSE);

	pBtdm8723->bPreAdcBackOff = _TRUE;
	btdm_2AntAdcBackOff(padapter, _FALSE);

	pBtdm8723->bPreLowPenaltyRa = _TRUE;
	btdm_2AntLowPenaltyRa(padapter, _FALSE);

	pBtdm8723->bPreRfRxLpfShrink = _TRUE;
	btdm_2AntRfShrink(padapter, _FALSE);

	pBtdm8723->bPreDacSwingOn = _TRUE;
	btdm_2AntDacSwing(padapter, _FALSE, 0xc0);

	pBtdm8723->bPreIgnoreWlanAct = _TRUE;
	btdm_2AntIgnoreWlanAct(padapter, _FALSE);
}

void BTDM_2AntHwCoexAllOff8723A(PADAPTER padapter)
{
	btdm_2AntCoexTable(padapter, 0x55555555, 0xffff, 0x3);
}

void BTDM_2AntFwCoexAllOff8723A(PADAPTER padapter)
{
	btdm_2AntIgnoreWlanAct(padapter, _FALSE);
	btdm_2AntPsTdma(padapter, _FALSE, 0);
	btdm_2AntFwDacSwingLvl(padapter, 0x20);
	btdm_2AntDecBtPwr(padapter, _FALSE);
}

void BTDM_2AntSwCoexAllOff8723A(PADAPTER padapter)
{
	btdm_2AntAgcTable(padapter, _FALSE);
	btdm_2AntAdcBackOff(padapter, _FALSE);
	btdm_2AntLowPenaltyRa(padapter, _FALSE);
	btdm_2AntRfShrink(padapter, _FALSE);
	btdm_2AntDacSwing(padapter, _FALSE, 0xc0);
}


void BTDM_2AntIpsNotify8723A(PADAPTER	padapter,u8		type)
{
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt=&pBTInfo->BtMgnt;

	if(pBtMgnt->bSupportProfile && (rf_off==type))
	{
		RTPRINT(FBT, BT_TRACE, ("[BT][DM], enter IPS, turn off all BT Coexist DM\n"));
		BTDM_CoexAllOff(padapter);
}
}


void BTDM_2AntNotifyBtOperation8723(PADAPTER padapter)
{
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	switch (pBtMgnt->ExtConfig.btOperationCode)
	{
		case HCI_BT_OP_NONE:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[BT OP] : Adjust for operation None!!\n"));
			break;
		case HCI_BT_OP_INQUIRY_START:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[BT OP] : Adjust for Inquiry start!!\n"));
			pBtMgnt->ExtConfig.bHoldForBtOperation = _TRUE;
			pBtMgnt->ExtConfig.bHoldPeriodCnt = 1;
			btdm_2AntBtInquiryPage(padapter);
			break;
		case HCI_BT_OP_INQUIRY_FINISH:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[BT OP] : Adjust for Inquiry finished!!\n"));
			pBtMgnt->ExtConfig.bHoldForBtOperation = _FALSE;
			break;
		case HCI_BT_OP_PAGING_START:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[BT OP] : Adjust for paging start!!\n"));
			pBtMgnt->ExtConfig.bHoldForBtOperation = _TRUE;
			pBtMgnt->ExtConfig.bHoldPeriodCnt = 1;
			btdm_2AntBtInquiryPage(padapter);
			break;
		case HCI_BT_OP_PAGING_SUCCESS:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[BT OP] : Adjust for paging successfully!!\n"));
			pBtMgnt->ExtConfig.bHoldForBtOperation = _FALSE;
			break;
		case HCI_BT_OP_PAGING_UNSUCCESS:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[BT OP] : Adjust for paging unsuccessfully!!\n"));
			pBtMgnt->ExtConfig.bHoldForBtOperation = _FALSE;
			break;
		case HCI_BT_OP_PAIRING_START:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[BT OP] : Adjust for Pairing start!!\n"));
			pBtMgnt->ExtConfig.bHoldForBtOperation = _TRUE;
			pBtMgnt->ExtConfig.bHoldPeriodCnt = 1;
			btdm_2AntBtInquiryPage(padapter);
			break;
		case HCI_BT_OP_PAIRING_FINISH:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[BT OP] : Adjust for Pairing finished!!\n"));
			pBtMgnt->ExtConfig.bHoldForBtOperation = _FALSE;
			break;

		case HCI_BT_OP_BT_DEV_ENABLE:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[BT OP] : Adjust for BT Device enable!!\n"));
			break;
		case HCI_BT_OP_BT_DEV_DISABLE:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[BT OP] : Adjust for BT Device disable!!\n"));
			break;
		default:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[BT OP] : Adjust for Unknown, error!!\n"));
			break;
	}
}



void btdm_BtHwCountersMonitor(PADAPTER padapter);
VOID
BTDM_2AntFwC2hBtInfo8723A(
	PADAPTER	padapter
	)
{
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBTDM_8723A_2ANT pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm2Ant;
	u1Byte	btInfo=0;
	u8			algorithm=BT_2ANT_COEX_ALGO_UNDEFINED;
	u8			bScoExist=_FALSE, bBtLinkExist=_FALSE, bBtHsModeExist=_FALSE;
	btInfo = pHalData->bt_coexist.halCoex8723.c2hBtInfoOriginal;


	pBtdm8723->btStatus = BT_2ANT_BT_STATUS_IDLE;

	// check BIT2 first ==> check if bt is under inquiry or page scan
	if(btInfo & BIT(2))
	{
		if(pHalData->bt_coexist.halCoex8723.bC2hBtInquiryPage == _FALSE){
			pBtMgnt->ExtConfig.bHoldForBtOperation = _TRUE;
			pBtMgnt->ExtConfig.bHoldPeriodCnt = 1;
			btdm_2AntBtInquiryPage(padapter);
		}
		else{
			pBtMgnt->ExtConfig.bHoldPeriodCnt++;
			btdm_HoldForBtInqPage(padapter);
		}
		pHalData->bt_coexist.halCoex8723.bC2hBtInquiryPage = _TRUE;

	}
	else
	{
		pHalData->bt_coexist.halCoex8723.bC2hBtInquiryPage = _FALSE;
		pBtMgnt->ExtConfig.bHoldForBtOperation = _FALSE;
		pBtMgnt->ExtConfig.bHoldPeriodCnt = 0;


	}
	RTPRINT(FBT, BT_TRACE, ("[BTC2H], pHalData->bt_coexist.halCoex8723.bC2hBtInquiryPage=%x pBtMgnt->ExtConfig.bHoldPeriodCnt=%x pBtMgnt->ExtConfig.bHoldForBtOperation=%x\n",pHalData->bt_coexist.halCoex8723.bC2hBtInquiryPage,pBtMgnt->ExtConfig.bHoldPeriodCnt,pBtMgnt->ExtConfig.bHoldForBtOperation));

	RTPRINT(FBT, BT_TRACE, ("[BTC2H],   btInfo=%x   pHalData->bt_coexist.halCoex8723.c2hBtInfoOriginal=%x\n",btInfo,pHalData->bt_coexist.halCoex8723.c2hBtInfoOriginal));
//	btdm_BtHwCountersMonitor(padapter);
//	btdm_2AntBtEnableDisableCheck8723A(padapter);
	if(btInfo&BT_INFO_ACL)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTC2H], BTInfo: bConnect=TRUE   btInfo=%x\n",btInfo));
		//pBtMgnt->ExtConfig.bBTBusy = _TRUE;
		bBtLinkExist = _TRUE;
		if(((btInfo&(BT_INFO_FTP|BT_INFO_A2DP|BT_INFO_HID|BT_INFO_SCO_BUSY))!=0) || pHalData->bt_coexist.halCoex8723.btRetryCnt>0){
			pBtdm8723->btStatus =BT_2ANT_BT_STATUS_NON_IDLE;
		}
		else
			pBtdm8723->btStatus =BT_2ANT_BT_STATUS_CONNECTED_IDLE;


		if(btInfo&BT_INFO_SCO|| btInfo&BT_INFO_SCO_BUSY){
			if(btInfo&BT_INFO_FTP|| btInfo&BT_INFO_A2DP||btInfo&BT_INFO_HID){
				switch(btInfo&0xe0){
					case BT_INFO_HID :
						RTPRINT(FBT, BT_TRACE, ("[BTCoex], SCO + HID\n"));
						algorithm = BT_2ANT_COEX_ALGO_HID;
						break;
					case BT_INFO_A2DP :
						RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! SCO + A2DP\n"));
						break;
					case BT_INFO_FTP :
						if(bBtHsModeExist)
						{
							RTPRINT(FBT, BT_TRACE, ("[BTCoex], SCO + PAN(HS)\n"));
							algorithm = BT_2ANT_COEX_ALGO_SCO;
						}
						else
						{
							RTPRINT(FBT, BT_TRACE, ("[BTCoex], SCO + PAN(EDR)\n"));
							algorithm = BT_2ANT_COEX_ALGO_PANEDR_HID;
						}
						break;
					case (BT_INFO_HID|BT_INFO_A2DP) :
						RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + A2DP\n"));
						algorithm = BT_2ANT_COEX_ALGO_HID_A2DP;
						break;
					case (BT_INFO_HID|BT_INFO_FTP) :
						if(bBtHsModeExist)
						{
							RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + PAN(HS)\n"));
							algorithm = BT_2ANT_COEX_ALGO_HID_A2DP;
						}
						else
						{
							RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + PAN(EDR)\n"));
							algorithm = BT_2ANT_COEX_ALGO_PANEDR_HID;
						}
						break;
					case (BT_INFO_A2DP|BT_INFO_FTP) :
						if(bBtHsModeExist)
						{
							RTPRINT(FBT, BT_TRACE, ("[BTCoex], A2DP + PAN(HS)\n"));
							algorithm = BT_2ANT_COEX_ALGO_A2DP;
						}
						else
						{
							RTPRINT(FBT, BT_TRACE, ("[BTCoex], A2DP + PAN(EDR)\n"));
							algorithm = BT_2ANT_COEX_ALGO_PANEDR_A2DP;
						}
						break;
					case (BT_INFO_HID|BT_INFO_A2DP|BT_INFO_FTP) :
						if(bBtHsModeExist)
						{
							RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + A2DP + PAN(HS)\n"));
							algorithm = BT_2ANT_COEX_ALGO_HID_A2DP;
						}
						else
						{
							RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + A2DP + PAN(EDR)\n"));
							algorithm = BT_2ANT_COEX_ALGO_HID_A2DP_PANEDR;
						}
						break;

