acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
				}
			}
			else{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], SCO only\n"));
				algorithm = BT_2ANT_COEX_ALGO_SCO;
			}
		}
		else{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], non SCO\n"));
				switch(btInfo&0xe0){
					case BT_INFO_HID :
						RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID\n"));
						algorithm = BT_2ANT_COEX_ALGO_HID;
						break;
					case BT_INFO_A2DP :
						RTPRINT(FBT, BT_TRACE, ("[BTCoex],  A2DP\n"));
						algorithm = BT_2ANT_COEX_ALGO_A2DP;
						break;
					case BT_INFO_FTP :
						RTPRINT(FBT, BT_TRACE, ("[BTCoex], PAN(EDR)\n"));
						algorithm = BT_2ANT_COEX_ALGO_PANEDR_HID;
						break;
					case (BT_INFO_HID|BT_INFO_A2DP) :
						RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + A2DP\n"));
						algorithm = BT_2ANT_COEX_ALGO_HID_A2DP;
						break;
					case (BT_INFO_HID|BT_INFO_FTP) :
						if(bBtHsModeExist)
						{
							RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + PAN(HS)\n"));
							algorithm = BT_2ANT_COEX_ALGO_HID_A2DP;
						}
						else
						{
							RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + PAN(EDR)\n"));
							algorithm = BT_2ANT_COEX_ALGO_PANEDR_HID;
						}
						break;
					case (BT_INFO_A2DP|BT_INFO_FTP) :
						if(bBtHsModeExist)
						{
							RTPRINT(FBT, BT_TRACE, ("[BTCoex], A2DP + PAN(HS)\n"));
							algorithm = BT_2ANT_COEX_ALGO_A2DP;
						}
						else
						{
							RTPRINT(FBT, BT_TRACE, ("[BTCoex], A2DP + PAN(EDR)\n"));
							algorithm = BT_2ANT_COEX_ALGO_PANEDR_A2DP;
						}
						break;
					case (BT_INFO_HID|BT_INFO_A2DP|BT_INFO_FTP) :
						if(bBtHsModeExist)
						{
							RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + A2DP + PAN(HS)\n"));
							algorithm = BT_2ANT_COEX_ALGO_HID_A2DP;
						}
						else
						{
							RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + A2DP + PAN(EDR)\n"));
							algorithm = BT_2ANT_COEX_ALGO_HID_A2DP_PANEDR;
						}
						break;

				}

		}
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("[BTC2H], BTInfo: bConnect=FALSE\n"));
		//pBtMgnt->ExtConfig.bBTBusy = _FALSE;
		pBtdm8723->btStatus =BT_2ANT_BT_STATUS_IDLE;
	}

	pBtdm8723->curAlgorithm =algorithm;
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], Algorithm = %d \n", pBtdm8723->curAlgorithm));

//From
	BTDM_CheckWiFiState(padapter);
	if(pBtMgnt->ExtConfig.bManualControl)
	{
		RTPRINT(FBT, BT_TRACE, ("Action Manual control, won't execute bt coexist mechanism!!\n"));
		return;
	}

}


void BTDM_2AntBtCoexist8723A(PADAPTER padapter)
{
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	PBT_DBG 		pBtDbg = &pBTInfo->BtDbg;
	u8				BtState = 0, btInfoOriginal=0, btRetryCnt=0;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBTDM_8723A_2ANT	pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm2Ant;

	if (BTDM_BtProfileSupport(padapter))
	{
		if (pBtMgnt->ExtConfig.bHoldForBtOperation)
		{
			RTPRINT(FBT, BT_TRACE, ("Action for BT Operation adjust!!\n"));
			return;
		}
		if(pBtMgnt->ExtConfig.bHoldPeriodCnt)
		{
			RTPRINT(FBT, BT_TRACE, ("Hold BT inquiry/page scan setting (cnt = %d)!!\n",
				pBtMgnt->ExtConfig.bHoldPeriodCnt));
			if(pBtMgnt->ExtConfig.bHoldPeriodCnt >= 11)
			{
				pBtMgnt->ExtConfig.bHoldPeriodCnt = 0;
				// next time the coexist parameters should be reset again.
			}
			else
				pBtMgnt->ExtConfig.bHoldPeriodCnt++;
			return;
		}

		if(pBtDbg->dbgCtrl)
		{
			RTPRINT(FBT, BT_TRACE, ("[Dbg control], "));
		}

		pBtdm8723->curAlgorithm = btdm_ActionAlgorithm(padapter);
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], Algorithm = %d \n", pBtdm8723->curAlgorithm));

		if (btdm_Is2Ant8723ACommonAction(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("Action 2-Ant common.\n"));
			pBtdm8723->bResetTdmaAdjust = _TRUE;
		}
		else
		{
			if(pBtdm8723->curAlgorithm != pBtdm8723->preAlgorithm)
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], preAlgorithm=%d, curAlgorithm=%d\n",
				pBtdm8723->preAlgorithm, pBtdm8723->curAlgorithm));
				pBtdm8723->bResetTdmaAdjust = _TRUE;
			}
			switch(pBtdm8723->curAlgorithm)
			{
				case BT_2ANT_COEX_ALGO_SCO:
					RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = SCO.\n"));
					btdm_2Ant8723ASCOAction(padapter);
					break;
				case BT_2ANT_COEX_ALGO_HID:
					RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = HID.\n"));
					btdm_2Ant8723AHIDAction(padapter);
					break;
				case BT_2ANT_COEX_ALGO_A2DP:
					RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = A2DP.\n"));
					btdm_2Ant8723AA2DPAction(padapter);
					break;
				case BT_2ANT_COEX_ALGO_PANEDR:
					RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = PAN(EDR).\n"));
					btdm_2Ant8723APANEDRAction(padapter);
					break;
				case BT_2ANT_COEX_ALGO_PANHS:
					RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = HS mode.\n"));
					btdm_2Ant8723APANHSAction(padapter);
					break;
				case BT_2ANT_COEX_ALGO_PANEDR_A2DP:
					RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = PAN+A2DP.\n"));
					btdm_2Ant8723APANEDRA2DPAction(padapter);
					break;
				case BT_2ANT_COEX_ALGO_PANEDR_HID:
					RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = PAN(EDR)+HID.\n"));
					btdm_2Ant8723APANEDRHIDAction(padapter);
					break;
				case BT_2ANT_COEX_ALGO_HID_A2DP_PANEDR:
					RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = HID+A2DP+PAN.\n"));
					btdm_2Ant8723AHIDA2DPPANEDRAction(padapter);
					break;
				case BT_2ANT_COEX_ALGO_HID_A2DP:
					RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = HID+A2DP.\n"));
					btdm_2Ant8723AHIDA2DPAction(padapter);
					break;
#if 0
				case BT_2ANT_COEX_ALGO_HID_A2DP_PANHS:
					RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = HID+A2DP+PAN(HS).\n"));
					btdm_2Ant8723AHIDA2DPPANHSAction(padapter);
					break;
#endif
				default:
					RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = 0.\n"));
					//btdm_2Ant8723AAction0(padapter);
					btdm_2Ant8723AA2DPAction(padapter);
					break;
			}
			pBtdm8723->preAlgorithm = pBtdm8723->curAlgorithm;
		}
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex] Get bt info by fw!!\n"));
		//msg shows c2h rsp for bt_info is received or not.
		if (pHalData->bt_coexist.halCoex8723.bC2hBtInfoReqSent)
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex] c2h for btInfo not rcvd yet!!\n"));
		}

		//btRetryCnt = pHalData->bt_coexist.halCoex8723.btRetryCnt;
		btInfoOriginal = pHalData->bt_coexist.halCoex8723.c2hBtInfoOriginal;

		if(pBtMgnt->ExtConfig.bHoldForBtOperation)
		{
			RTPRINT(FBT, BT_TRACE, ("Action for BT Operation adjust!!\n"));
			return;
		}
		if(pBtMgnt->ExtConfig.bHoldPeriodCnt)
		{
			RTPRINT(FBT, BT_TRACE, ("Hold BT inquiry/page scan setting (cnt = %d)!!\n", pBtMgnt->ExtConfig.bHoldPeriodCnt));
			if(pBtMgnt->ExtConfig.bHoldPeriodCnt >= 11)
			{
				pBtMgnt->ExtConfig.bHoldPeriodCnt = 0;
				// next time the coexist parameters should be reset again.
			}
			else
				pBtMgnt->ExtConfig.bHoldPeriodCnt++;
			return;
		}

		if(pBtDbg->dbgCtrl)
		{
			RTPRINT(FBT, BT_TRACE, ("[Dbg control], "));
		}
		if (btdm_Is2Ant8723ACommonAction(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("Action 2-Ant common.\n"));
			pBtdm8723->bResetTdmaAdjust = _TRUE;
		}
		else
		{
			if(pBtdm8723->curAlgorithm != pBtdm8723->preAlgorithm)
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], preAlgorithm=%d, curAlgorithm=%d\n", pBtdm8723->preAlgorithm, pBtdm8723->curAlgorithm));
				pBtdm8723->bResetTdmaAdjust = _TRUE;
			}
			switch(pBtdm8723->curAlgorithm)
			{
				case BT_2ANT_COEX_ALGO_SCO:
					RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = SCO.\n"));
					btdm_2Ant8723ASCOAction(padapter);
					break;
				case BT_2ANT_COEX_ALGO_HID:
					RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = HID.\n"));
					btdm_2Ant8723AHIDAction(padapter);
					break;
				case BT_2ANT_COEX_ALGO_A2DP:
					RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = A2DP.\n"));
					btdm_2Ant8723AA2dp(padapter);
					break;
				case BT_2ANT_COEX_ALGO_PANEDR:
					RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = PAN(EDR).\n"));
					btdm_2Ant8723APANEDRAction(padapter);
					break;
				case BT_2ANT_COEX_ALGO_PANHS:
					RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = HS mode.\n"));
					btdm_2Ant8723APANHSAction(padapter);
					break;
				case BT_2ANT_COEX_ALGO_PANEDR_A2DP:
					RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = PAN+A2DP.\n"));
					btdm_2Ant8723APANEDRA2DPAction(padapter);
					break;
				case BT_2ANT_COEX_ALGO_PANEDR_HID:
					RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = PAN(EDR)+HID.\n"));
					btdm_2Ant8723APANEDRHIDAction(padapter);
					break;
				case BT_2ANT_COEX_ALGO_HID_A2DP_PANEDR:
					RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = HID+A2DP+PAN.\n"));
					btdm_2Ant8723AHIDA2DPPANEDRAction(padapter);
					break;
				case BT_2ANT_COEX_ALGO_HID_A2DP:
					RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = HID+A2DP.\n"));
					btdm_2Ant8723AHIDA2DPAction(padapter);
					break;
#if 0
				case BT_2ANT_COEX_ALGO_HID_A2DP_PANHS:
					RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = HID+A2DP+PAN(HS).\n"));
					btdm_2Ant8723ActionHidA2dpPanHs(Adapter);
					break;
#endif
				default:
					RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = 0.\n"));
					//btdm_2Ant8723AAction0(padapter);
                                        btdm_2Ant8723AA2DPAction(padapter);
					break;
			}
			pBtdm8723->preAlgorithm = pBtdm8723->curAlgorithm;
		}
//			pHalData->bt_coexist.halCoex8723.prec2hBtInfo = pHalData->bt_coexist.halCoex8723.c2hBtInfo;

