acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
	}
}


// ===== End of sync from SD7 driver HAL/BTCoexist/HalBtc87232Ant.c =====
#endif

#ifdef __HALBTC8723_C__ // HAL/BTCoexist/HalBtc8723.c
// ===== Below this line is sync from SD7 driver HAL/BTCoexist/HalBtc8723.c =====

static u8 btCoexDbgBuf[BT_TMP_BUF_SIZE];
const char *const BtProfileString[]={
	"NONE",
	"A2DP",
	"PAN",
	"HID",
	"SCO",
};
const char *const BtSpecString[]={
	"1.0b",
	"1.1",
	"1.2",
	"2.0+EDR",
	"2.1+EDR",
	"3.0+HS",
	"4.0",
};
const char *const BtLinkRoleString[]={
	"Master",
	"Slave",
};

u8 btdm_BtWifiAntNum(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBT_COEXIST_8723A	pBtCoex = &pHalData->bt_coexist.halCoex8723;

//	RTPRINT(FBT, BT_TRACE, ("%s pHalData->bt_coexist.BluetoothCoexist =%x pHalData->EEPROMBluetoothCoexist=%x \n",
//		__func__,pHalData->bt_coexist.BluetoothCoexist,pHalData->EEPROMBluetoothCoexist));
//	RTPRINT(FBT, BT_TRACE, ("%s pHalData->bt_coexist.BT_Ant_Num =%x pHalData->EEPROMBluetoothAntNum=%x \n",
//		__func__,pHalData->bt_coexist.BT_Ant_Num,pHalData->EEPROMBluetoothAntNum));
	if (Ant_x2 == pHalData->bt_coexist.BT_Ant_Num)
	{
		if (Ant_x2 == pBtCoex->TotalAntNum)
			return Ant_x2;
		else
			return Ant_x1;
	}
	else
	{
		return Ant_x1;
	}

	return Ant_x2;
}

void btdm_BtHwCountersMonitor(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u32				regHPTxRx, regLPTxRx, u4Tmp;
	u32				regHPTx=0, regHPRx=0, regLPTx=0, regLPRx=0;
//	u8				u1Tmp;

	regHPTxRx = REG_HIGH_PRIORITY_TXRX;
	regLPTxRx = REG_LOW_PRIORITY_TXRX;

	u4Tmp = rtw_read32(padapter, regHPTxRx);
	regHPTx = u4Tmp & bMaskLWord;
	regHPRx = (u4Tmp & bMaskHWord)>>16;

	u4Tmp = rtw_read32(padapter, regLPTxRx);
	regLPTx = u4Tmp & bMaskLWord;
	regLPRx = (u4Tmp & bMaskHWord)>>16;

	pHalData->bt_coexist.halCoex8723.highPriorityTx = regHPTx;
	pHalData->bt_coexist.halCoex8723.highPriorityRx = regHPRx;
	pHalData->bt_coexist.halCoex8723.lowPriorityTx = regLPTx;
	pHalData->bt_coexist.halCoex8723.lowPriorityRx = regLPRx;

//	RTPRINT(FBT, BT_TRACE, ("High Priority Tx/Rx (reg 0x%x)=%x(%d)/%x(%d)\n",
//		regHPTxRx, regHPTx, regHPTx, regHPRx, regHPRx));
//	RTPRINT(FBT, BT_TRACE, ("Low Priority Tx/Rx (reg 0x%x)=%x(%d)/%x(%d)\n",
//		regLPTxRx, regLPTx, regLPTx, regLPRx, regLPRx));

	// reset counter
	//u1Tmp = rtw_read8(padapter, 0x76e);
	//DbgPrint("read 2 back 0x76e= 0x%x\n", u1Tmp);
	//u4Tmp |= BIT3;
	rtw_write8(padapter, 0x76e, 0xc);
}

// This function check if 8723 bt is disabled
void btdm_BtEnableDisableCheck8723A(PADAPTER padapter)
{
	u8		btAlife = _TRUE;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);


#ifdef CHECK_BT_EXIST_FROM_REG
	u8		val8;

	// ox68[28]=1 => BT enable; otherwise disable
	val8 = rtw_read8(padapter, 0x6B);
	if (!(val8 & BIT(4))) btAlife = _FALSE;

	if (btAlife)
	{
		pHalData->bt_coexist.bCurBtDisabled = _FALSE;
//		RTPRINT(FBT, BT_TRACE, ("8723A BT is enabled !!\n"));
	}
	else
	{
		pHalData->bt_coexist.bCurBtDisabled = _TRUE;
//		RTPRINT(FBT, BT_TRACE, ("8723A BT is disabled !!\n"));
	}
#else
	if (pHalData->bt_coexist.halCoex8723.highPriorityTx == 0 &&
		pHalData->bt_coexist.halCoex8723.highPriorityRx == 0 &&
		pHalData->bt_coexist.halCoex8723.lowPriorityTx == 0 &&
		pHalData->bt_coexist.halCoex8723.lowPriorityRx == 0)
	{
		btAlife = _FALSE;
	}
	if (pHalData->bt_coexist.halCoex8723.highPriorityTx == 0xeaea &&
		pHalData->bt_coexist.halCoex8723.highPriorityRx == 0xeaea &&
		pHalData->bt_coexist.halCoex8723.lowPriorityTx == 0xeaea &&
		pHalData->bt_coexist.halCoex8723.lowPriorityRx == 0xeaea)
	{
		btAlife = _FALSE;
	}
	if (pHalData->bt_coexist.halCoex8723.highPriorityTx == 0xffff &&
		pHalData->bt_coexist.halCoex8723.highPriorityRx == 0xffff &&
		pHalData->bt_coexist.halCoex8723.lowPriorityTx == 0xffff &&
		pHalData->bt_coexist.halCoex8723.lowPriorityRx == 0xffff)
	{
		btAlife = _FALSE;
	}
	if (btAlife)
	{
		pHalData->bt_coexist.btActiveZeroCnt = 0;
		pHalData->bt_coexist.bCurBtDisabled = _FALSE;
		RTPRINT(FBT, BT_TRACE, ("8723A BT is enabled !!\n"));
	}
	else
	{
		pHalData->bt_coexist.btActiveZeroCnt++;
		RTPRINT(FBT, BT_TRACE, ("8723A bt all counters=0, %d times!!\n",
				pHalData->bt_coexist.btActiveZeroCnt));
		if (pHalData->bt_coexist.btActiveZeroCnt >= 2)
		{
			pHalData->bt_coexist.bCurBtDisabled = _TRUE;
			RTPRINT(FBT, BT_TRACE, ("8723A BT is disabled !!\n"));
		}
	}
#endif

	if (pHalData->bt_coexist.bCurBtDisabled == _FALSE) {
		if (BTDM_IsWifiConnectionExist(padapter) == _TRUE)
			BTDM_SetFwChnlInfo(padapter, RT_MEDIA_CONNECT);
		else
			BTDM_SetFwChnlInfo(padapter, RT_MEDIA_DISCONNECT);
	}

	if (pHalData->bt_coexist.bPreBtDisabled !=
		pHalData->bt_coexist.bCurBtDisabled)
	{
		RTPRINT(FBT, BT_TRACE, ("8723A BT is from %s to %s!!\n",
			(pHalData->bt_coexist.bPreBtDisabled ? "disabled":"enabled"),
			(pHalData->bt_coexist.bCurBtDisabled ? "disabled":"enabled")));
		pHalData->bt_coexist.bPreBtDisabled = pHalData->bt_coexist.bCurBtDisabled;
	}
}

void btdm_BTCoexist8723AHandler(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData;


	pHalData = GET_HAL_DATA(padapter);

	if (btdm_BtWifiAntNum(padapter) == Ant_x2)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], 2 Ant mechanism\n"));
		BTDM_2AntBtCoexist8723A(padapter);
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1 Ant mechanism\n"));
		BTDM_1AntBtCoexist8723A(padapter);
	}

	if (!BTDM_IsSameCoexistState(padapter))
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], Coexist State[bitMap] change from 0x%x to 0x%x\n",
			pHalData->bt_coexist.PreviousState,
			pHalData->bt_coexist.CurrentState));
		pHalData->bt_coexist.PreviousState = pHalData->bt_coexist.CurrentState;

		RTPRINT(FBT, BT_TRACE, ("["));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_BT30)
			RTPRINT(FBT, BT_TRACE, ("BT 3.0, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_HT20)
			RTPRINT(FBT, BT_TRACE, ("HT20, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_HT40)
			RTPRINT(FBT, BT_TRACE, ("HT40, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_LEGACY)
			RTPRINT(FBT, BT_TRACE, ("Legacy, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_RSSI_LOW)
			RTPRINT(FBT, BT_TRACE, ("Rssi_Low, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_RSSI_MEDIUM)
			RTPRINT(FBT, BT_TRACE, ("Rssi_Mid, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_RSSI_HIGH)
			RTPRINT(FBT, BT_TRACE, ("Rssi_High, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_IDLE)
			RTPRINT(FBT, BT_TRACE, ("Wifi_Idle, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_UPLINK)
			RTPRINT(FBT, BT_TRACE, ("Wifi_Uplink, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_DOWNLINK)
			RTPRINT(FBT, BT_TRACE, ("Wifi_Downlink, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_BT_IDLE)
			RTPRINT(FBT, BT_TRACE, ("BT_idle, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_PROFILE_HID)
			RTPRINT(FBT, BT_TRACE, ("PRO_HID, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_PROFILE_A2DP)
			RTPRINT(FBT, BT_TRACE, ("PRO_A2DP, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_PROFILE_PAN)
			RTPRINT(FBT, BT_TRACE, ("PRO_PAN, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_PROFILE_SCO)
			RTPRINT(FBT, BT_TRACE, ("PRO_SCO, "));
		RTPRINT(FBT, BT_TRACE, ("]\n"));
	}
}

//============================================================
// extern function start with BTDM_
//============================================================
u32 BTDM_BtTxRxCounterH(	PADAPTER	padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u32	counters=0;

	counters = pHalData->bt_coexist.halCoex8723.highPriorityTx+
		pHalData->bt_coexist.halCoex8723.highPriorityRx ;
	return counters;
}

u32 BTDM_BtTxRxCounterL(	PADAPTER	padapter 	)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u4Byte	counters=0;

	counters = pHalData->bt_coexist.halCoex8723.lowPriorityTx+
		pHalData->bt_coexist.halCoex8723.lowPriorityRx ;
	return counters;
}

void BTDM_SetFwChnlInfo(PADAPTER padapter, RT_MEDIA_STATUS mstatus)
{
//	PMGNT_INFO	pMgntInfo = &padapter->MgntInfo;
	struct mlme_ext_priv *pmlmeext = &padapter->mlmeextpriv;
	PBT30Info	pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT	pBtMgnt = &pBTInfo->BtMgnt;
	u8		H2C_Parameter[3] ={0};
	u8		chnl;


	if (!IS_HARDWARE_TYPE_8723A(padapter))
		return;

	// opMode
	if (RT_MEDIA_CONNECT == mstatus)
	{
		H2C_Parameter[0] = 0x1;	// 0: disconnected, 1:connected
	}

	if (check_fwstate(&padapter->mlmepriv, WIFI_ASOC_STATE) == _TRUE)
	{
		// channel
		chnl = pmlmeext->cur_channel;
		if (BTDM_IsHT40(padapter))
		{
			if (pmlmeext->cur_ch_offset == HAL_PRIME_CHNL_OFFSET_UPPER)
			{
				chnl -= 2;
			}
			else if (pmlmeext->cur_ch_offset == HAL_PRIME_CHNL_OFFSET_LOWER)
			{
				chnl += 2;
			}
		}
		H2C_Parameter[1] = chnl;
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], pmlmeext->cur_channel=0x%x  pmlmeext->cur_ch_offset=0x%x chnl=0x%x\n",pmlmeext->cur_channel,pmlmeext->cur_ch_offset,chnl ));

