acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
	}
	else	// check if HS link is exists
	{
		// channel
		if (BT_Operation(padapter))
			H2C_Parameter[1] = pBtMgnt->BTChannel;
		else
			H2C_Parameter[1] = pmlmeext->cur_channel;
	}

	if (BTDM_IsHT40(padapter))
	{
		H2C_Parameter[2] = 0x30;
	}
	else
	{
		H2C_Parameter[2] = 0x20;
	}

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], FW write 0x19=0x%x\n",
		H2C_Parameter[0]<<16|H2C_Parameter[1]<<8|H2C_Parameter[2]));

	FillH2CCmd(padapter, 0x19, 3, H2C_Parameter);
}

u8 BTDM_IsWifiConnectionExist(PADAPTER padapter)
{
	u8 bRet = _FALSE;


	if (BTHCI_HsConnectionEstablished(padapter))
		bRet = _TRUE;

	if (check_fwstate(&padapter->mlmepriv, WIFI_ASOC_STATE) == _TRUE)
		bRet = _TRUE;

	return bRet;
}

void BTDM_SetFw3a(
	PADAPTER	padapter,
	u8		byte1,
	u8		byte2,
	u8		byte3,
	u8		byte4,
	u8		byte5
	)
{
	u8			H2C_Parameter[5] = {0};

	if (BTDM_1Ant8723A(padapter) == _TRUE)
	{
		if ((check_fwstate(&padapter->mlmepriv, WIFI_STATION_STATE) == _FALSE) &&
			(get_fwstate(&padapter->mlmepriv) != WIFI_NULL_STATE)) // for softap mode
		{
			PHAL_DATA_TYPE pHalData = GET_HAL_DATA(padapter);
			PBT_COEXIST_8723A pBtCoex = &pHalData->bt_coexist.halCoex8723;
			u8 BtState = pBtCoex->c2hBtInfo;

			if ((BtState != BT_INFO_STATE_NO_CONNECTION) &&
				(BtState != BT_INFO_STATE_CONNECT_IDLE))
			{
				if (byte1 & BIT(4))
				{
					byte1 &= ~BIT(4);
					byte1 |= BIT(5);
				}

				byte5 |= BIT(5);
				if (byte5 & BIT(6))
				{
					byte5 &= ~BIT(6);
				}
			}
		}
	}

	H2C_Parameter[0] = byte1;
	H2C_Parameter[1] = byte2;
	H2C_Parameter[2] = byte3;
	H2C_Parameter[3] = byte4;
	H2C_Parameter[4] = byte5;

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], FW write 0x3a(5bytes)=0x%02x%08x\n",
		H2C_Parameter[0],
		H2C_Parameter[1]<<24|H2C_Parameter[2]<<16|H2C_Parameter[3]<<8|H2C_Parameter[4]));

	FillH2CCmd(padapter, 0x3a, 5, H2C_Parameter);
}

void BTDM_ForceBtCoexMechanism(PADAPTER	padapter, u8 type)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);


	pHalData->bt_coexist.halCoex8723.bForceFwBtInfo = type;

	if (pHalData->bt_coexist.halCoex8723.bForceFwBtInfo)
	{
		DbgPrint("cosa force bt info from wifi fw !!!\n");
	}
	else
	{
		DbgPrint("cosa force bt coexist bt info from bt stack\n");
	}
}

void BTDM_QueryBtInformation(PADAPTER padapter)
{
	u8 H2C_Parameter[1] = {0};
	PHAL_DATA_TYPE pHalData;
	PBT_COEXIST_8723A pBtCoex;


	pHalData = GET_HAL_DATA(padapter);
	pBtCoex = &pHalData->bt_coexist.halCoex8723;

	if (BT_IsBtDisabled(padapter) == _TRUE)
	{
		pBtCoex->c2hBtInfo = BT_INFO_STATE_DISABLED;
		pBtCoex->bC2hBtInfoReqSent = _FALSE;
		return;
	}

	if (pBtCoex->c2hBtInfo == BT_INFO_STATE_DISABLED)
		pBtCoex->c2hBtInfo = BT_INFO_STATE_NO_CONNECTION;

	if (pBtCoex->bC2hBtInfoReqSent == _TRUE)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], didn't recv previous BtInfo report!\n"));
	}
	else
	{
		pBtCoex->bC2hBtInfoReqSent = _TRUE;
	}

	H2C_Parameter[0] |= BIT(0);	// trigger

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], Query Bt information, write 0x38=0x%x\n",
		H2C_Parameter[0]));

	FillH2CCmd(padapter, 0x38, 1, H2C_Parameter);
}

void BTDM_SetSwRfRxLpfCorner(PADAPTER padapter, u8 type)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (BT_RF_RX_LPF_CORNER_SHRINK == type)
	{
		//Shrink RF Rx LPF corner
		RTPRINT(FBT, BT_TRACE, ("Shrink RF Rx LPF corner!!\n"));
		PHY_SetRFReg(padapter, PathA, 0x1e, bRFRegOffsetMask, 0xf0ff7);
		pHalData->bt_coexist.bSWCoexistAllOff = _FALSE;
	}
	else if (BT_RF_RX_LPF_CORNER_RESUME == type)
	{
		//Resume RF Rx LPF corner
		RTPRINT(FBT, BT_TRACE, ("Resume RF Rx LPF corner!!\n"));
		PHY_SetRFReg(padapter, PathA, 0x1e, bRFRegOffsetMask, pHalData->bt_coexist.BtRfRegOrigin1E);
	}
}

void
BTDM_SetSwPenaltyTxRateAdaptive(
	PADAPTER	padapter,
	u8		raType
	)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u8	tmpU1;

	tmpU1 = rtw_read8(padapter, 0x4fd);
	tmpU1 |= BIT(0);
	if (BT_TX_RATE_ADAPTIVE_LOW_PENALTY == raType)
	{
		RTPRINT(FBT, BT_TRACE, ("Tx rate adaptive, set low penalty!!\n"));
		tmpU1 &= ~BIT(2);
		pHalData->bt_coexist.bSWCoexistAllOff = _FALSE;
	}
	else if (BT_TX_RATE_ADAPTIVE_NORMAL == raType)
	{
		RTPRINT(FBT, BT_TRACE, ("Tx rate adaptive, set normal!!\n"));
		tmpU1 |= BIT(2);
	}

	rtw_write8(padapter, 0x4fd, tmpU1);
}

void BTDM_SetFwDecBtPwr(PADAPTER padapter, u8 bDecBtPwr)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u8			H2C_Parameter[1] = {0};


	H2C_Parameter[0] = 0;

	if (bDecBtPwr)
	{
		H2C_Parameter[0] |= BIT(1);
		pHalData->bt_coexist.bFWCoexistAllOff = _FALSE;
	}

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], decrease Bt Power : %s, write 0x21=0x%x\n",
		(bDecBtPwr? "Yes!!":"No!!"), H2C_Parameter[0]));

	FillH2CCmd(padapter, 0x21, 1, H2C_Parameter);
}

u8 BTDM_BtProfileSupport(PADAPTER padapter)
{
	u8			bRet = _FALSE;
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);


	if (pBtMgnt->bSupportProfile &&
		!pHalData->bt_coexist.halCoex8723.bForceFwBtInfo)
	{
		bRet = _TRUE;
	}

	return bRet;
}

void BTDM_AdjustForBtOperation8723A(PADAPTER padapter)
{
	//BTDM_2AntAdjustForBtOperation8723(padapter);
}

void BTDM_FwC2hBtRssi8723A(PADAPTER padapter, u8 *tmpBuf)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u8			percent=0, u1tmp=0;

	u1tmp = tmpBuf[0];
	percent = u1tmp*2+10;

	pHalData->bt_coexist.halCoex8723.btRssi = percent;
//	RTPRINT(FBT, BT_TRACE, ("[BTC2H], Bt rssi, hex val=0x%x, percent=%d\n", u1tmp, percent));
}

void BTDM_FwC2hBtInfo8723A(PADAPTER padapter, u8 *tmpBuf, u8 length)
{
	PHAL_DATA_TYPE	pHalData;
	PBT30Info		pBTInfo;
	PBT_MGNT		pBtMgnt;
	PBT_COEXIST_8723A pBtCoex;
	u8	i;


	pHalData = GET_HAL_DATA(padapter);
	pBTInfo = GET_BT_INFO(padapter);
	pBtMgnt = &pBTInfo->BtMgnt;
	pBtCoex = &pHalData->bt_coexist.halCoex8723;

	pBtCoex->bC2hBtInfoReqSent = _FALSE;

	RTPRINT(FBT, BT_TRACE, ("[BTC2H], Bt info, length=%d, hex data=[", length));

	pBtCoex->btRetryCnt = 0;
	for (i=0; i<length; i++)
	{
		switch (i)
		{
			case 0:
				pBtCoex->c2hBtInfoOriginal = tmpBuf[i];
				break;
			case 1:
				pBtCoex->btRetryCnt = tmpBuf[i];
				break;
			case 2:
				BTDM_FwC2hBtRssi8723A(padapter, &tmpBuf[i]);
				break;
			case 3:
				pBtCoex->btInfoExt=tmpBuf[i]&BIT(0);

