acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
void btdm_CheckCounterOnly1Ant(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
//	PMGNT_INFO		pMgntInfo = &padapter->MgntInfo;
	u32 			BT_Polling, Ratio_Act, Ratio_STA;
	u32 			BT_Active, BT_State;
	u32			regBTActive = 0, regBTState = 0, regBTPolling=0;

	if (!pHalData->bt_coexist.BluetoothCoexist)
		return;
	if (pHalData->bt_coexist.BT_CoexistType != BT_CSR_BC8)
		return;
	if (pHalData->bt_coexist.BT_Ant_Num != Ant_x1)
		return;

	//
	// The following we only consider CSR BC8 and fw version should be >= 62
	//
	RTPRINT(FBT, BT_TRACE, ("[DM][BT], FirmwareVersion = 0x%x(%d)\n",
		pHalData->FirmwareVersion, pHalData->FirmwareVersion));
	{
		regBTActive = REG_BT_ACTIVE;
		regBTState = REG_BT_STATE;
		if (pHalData->FirmwareVersion >= FW_VER_BT_REG1)
			regBTPolling = REG_BT_POLLING1;
		else
			regBTPolling = REG_BT_POLLING;
	}

	BT_Active = rtw_read32(padapter, regBTActive);
	RTPRINT(FBT, BT_TRACE, ("[DM][BT], BT_Active(0x%x)=%x\n", regBTActive, BT_Active));
	BT_Active = BT_Active & 0x00ffffff;

	BT_State = rtw_read32(padapter, regBTState);
	RTPRINT(FBT, BT_TRACE, ("[DM][BT], BT_State(0x%x)=%x\n", regBTState, BT_State));
	BT_State = BT_State & 0x00ffffff;

	BT_Polling = rtw_read32(padapter, regBTPolling);
	RTPRINT(FBT, BT_TRACE, ("[DM][BT], BT_Polling(0x%x)=%x\n", regBTPolling, BT_Polling));

	Ratio_Act = BT_Active*1000/BT_Polling;
	Ratio_STA = BT_State*1000/BT_Polling;

	RTPRINT(FBT, BT_TRACE, ("[DM][BT], Ratio_Act=%d\n", Ratio_Act));
	RTPRINT(FBT, BT_TRACE, ("[DM][BT], Ratio_STA=%d\n", Ratio_STA));
}

u8
btdm_IsSingleAnt(
	PADAPTER	padapter,
	u8		bSingleAntOn,
	u8		bInterruptOn,
	u8		bMultiNAVOn
	)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u8 bRet = _FALSE;

	if ((pHalData->bt_coexist.bInterruptOn == bInterruptOn) &&
		(pHalData->bt_coexist.bSingleAntOn == bSingleAntOn) &&
		(pHalData->bt_coexist.bMultiNAVOn == bMultiNAVOn))
	{
		bRet = _TRUE;
	}

	RTPRINT(FBT, BT_TRACE, ("[DM][BT], current SingleAntenna = [%s:%s:%s]\n",
		pHalData->bt_coexist.bSingleAntOn?"ON":"OFF",
		pHalData->bt_coexist.bInterruptOn?"ON":"OFF",
		pHalData->bt_coexist.bMultiNAVOn?"ON":"OFF"));

	return bRet;
}

u8 btdm_IsBalance(PADAPTER padapter, u8 bBalanceOn)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	RTPRINT(FBT, BT_TRACE, ("[DM][BT], btdm_IsBalance(), bBalanceOn=%s\n",
		bBalanceOn?"ON":"OFF"));

	if (pHalData->bt_coexist.bBalanceOn == bBalanceOn)
	{
		return _TRUE;
	}
	return _FALSE;
}

u8 btdm_EarphoneSpecDetect(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	switch (pHalData->bt_coexist.A2DPState)
	{
		case BT_A2DP_STATE_NOT_ENTERED:
			{
				RTPRINT(FBT, BT_TRACE, (" set default balance = ON, for WLANActH=12, WLANActL=24!!\n"));
				pHalData->bt_coexist.PreWLANActH = 12;
				pHalData->bt_coexist.PreWLANActL = 24;
				pHalData->bt_coexist.WLANActH = 12;
				pHalData->bt_coexist.WLANActL = 24;
				BTDM_Balance(padapter, _TRUE, pHalData->bt_coexist.WLANActH, pHalData->bt_coexist.WLANActL);
				BTDM_SingleAnt(padapter, _TRUE, _FALSE, _FALSE);
				pHalData->bt_coexist.A2DPState = BT_A2DP_STATE_DETECTING;
			}
			break;

		case BT_A2DP_STATE_DETECTING:
			{
				// 32,12; the most critical for BT
				// 12,24
				// 0,0
				if (btdm_IsSingleAnt(padapter, _TRUE, _FALSE, _FALSE))
				{
					if ((pHalData->bt_coexist.PreWLANActH == 0) &&
						(pHalData->bt_coexist.PreWLANActL == 0))
					{
						RTPRINT(FBT, BT_TRACE, ("[WLANActH, WLANActL] = [0,0]\n"));
						pHalData->bt_coexist.WLANActH = 12;
						pHalData->bt_coexist.WLANActL = 24;
					}
					else if ((pHalData->bt_coexist.PreWLANActH == 12) &&
						(pHalData->bt_coexist.PreWLANActL == 24))
					{
						RTPRINT(FBT, BT_TRACE, ("[WLANActH, WLANActL] = [12,24]\n"));
						if (((pHalData->bt_coexist.Ratio_Tx>600) &&
							(pHalData->bt_coexist.Ratio_PRI>500)) ||
							((pHalData->bt_coexist.Ratio_Tx*10 ) >
							(pHalData->bt_coexist.Ratio_PRI*15)))
						{
							RTPRINT(FBT, BT_TRACE, ("Ratio_Act > 600 && Ratio_STA > 500 or "));
							RTPRINT(FBT, BT_TRACE, ("Ratio_Act/Ratio_STA > 1.5\n"));
							pHalData->bt_coexist.WLANActH = 12;
							pHalData->bt_coexist.WLANActL = 24;
						}
						else
						{
							RTPRINT(FBT, BT_TRACE, (" cosa set to 32/12\n "));
							pHalData->bt_coexist.WLANActH = 32;
							pHalData->bt_coexist.WLANActL = 12;
						}
					}
					else if ((pHalData->bt_coexist.PreWLANActH == 32) &&
							(pHalData->bt_coexist.PreWLANActL == 12))
					{
						RTPRINT(FBT, BT_TRACE, ("[WLANActH, WLANActL] = [32,12]\n"));
						if (((pHalData->bt_coexist.Ratio_Tx>650) &&
							(pHalData->bt_coexist.Ratio_PRI>550)) ||
							((pHalData->bt_coexist.Ratio_Tx*10 ) >
							(pHalData->bt_coexist.Ratio_PRI*15)))
						{
							RTPRINT(FBT, BT_TRACE, ("Ratio_Act > 650 && Ratio_STA > 550 or "));
							RTPRINT(FBT, BT_TRACE, ("Ratio_Act/Ratio_STA > 1.5\n"));
							pHalData->bt_coexist.WLANActH = 12;
							pHalData->bt_coexist.WLANActL = 24;
						}
					}
					if ((pHalData->bt_coexist.PreWLANActH != pHalData->bt_coexist.WLANActH) ||
						(pHalData->bt_coexist.PreWLANActL != pHalData->bt_coexist.WLANActL))
					{
						BTDM_Balance(padapter, _TRUE, pHalData->bt_coexist.WLANActH, pHalData->bt_coexist.WLANActL);
						pHalData->bt_coexist.PreWLANActH = pHalData->bt_coexist.WLANActH;
						pHalData->bt_coexist.PreWLANActL = pHalData->bt_coexist.WLANActL;
					}
				}

				RTPRINT(FBT, BT_TRACE, ("earphone detected result: WLANActH=%d, WLANActL=%d\n",
					pHalData->bt_coexist.WLANActH, pHalData->bt_coexist.WLANActL));
			}
			break;

		case BT_A2DP_STATE_DETECTED:
			break;

		default:
			RT_ASSERT(_FALSE, ("btdm_EarphoneSpecDetect(), unknown case\n"));
			break;
	}
	return _TRUE;
}

//==============================================================
//
// Note:
// In the following, FW should be done before SW mechanism.
//
//==============================================================

void btdm_SCOActionBC81Ant(PADAPTER padapter)
{
//	PMGNT_INFO		pMgntInfo = &padapter->MgntInfo;
	struct mlme_priv *pmlmepriv = &padapter->mlmepriv;
	u8	btRssiState;

	if ((pmlmepriv->LinkDetectInfo.bTxBusyTraffic) ||
		!(pmlmepriv->LinkDetectInfo.bBusyTraffic))
	{
		RTPRINT(FBT, BT_TRACE, ("Wifi Uplink or Wifi is idle\n"));
		if (BTDM_IsSameCoexistState(padapter))
				return;
		BTDM_Balance(padapter, _FALSE, 0, 0);
		BTDM_SingleAnt(padapter, _TRUE, _TRUE, _FALSE);
	}
	else if (pmlmepriv->LinkDetectInfo.bRxBusyTraffic)
	{
		RTPRINT(FBT, BT_TRACE, ("Wifi Downlink\n"));

		if (btdm_IsSingleAnt(padapter, _FALSE, _FALSE, _FALSE))
		{
			btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, BT_FW_COEX_THRESH_20, 0);
			if (BTDM_IsSameCoexistState(padapter))
				return;
			if ((btRssiState == BT_RSSI_STATE_LOW) ||
				(btRssiState == BT_RSSI_STATE_STAY_LOW))
			{
				BTDM_Balance(padapter, _FALSE, 0, 0);
				BTDM_SingleAnt(padapter, _TRUE, _TRUE, _FALSE);
			}
		}
		else
		{
			btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, BT_FW_COEX_THRESH_45, 0);
			if (BTDM_IsSameCoexistState(padapter))
				return;
			if ((btRssiState == BT_RSSI_STATE_HIGH) ||
				(btRssiState == BT_RSSI_STATE_STAY_HIGH))
			{
				BTDM_Balance(padapter, _FALSE, 0, 0);
				BTDM_SingleAnt(padapter, _FALSE, _FALSE, _FALSE);
			}
			else
			{
				BTDM_Balance(padapter, _FALSE, 0, 0);
				BTDM_SingleAnt(padapter, _TRUE, _TRUE, _FALSE);
			}
		}
	}
}

