acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
u8 btdm_SCOAction1Ant(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;

	if (pBtMgnt->ExtConfig.NumberOfSCO > 0)
	{
		pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_PROFILE_SCO;
		btdm_SCOActionBC81Ant(padapter);
		return _TRUE;
	}
	else
	{
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_PROFILE_SCO;
		return _FALSE;
	}
}

void btdm_HIDActionBC81Ant(PADAPTER padapter)
{
#if 0
	if (BTDM_IsSameCoexistState(padapter))
		return;
#endif
	BTDM_Balance(padapter, _FALSE, 0, 0);
	BTDM_SingleAnt(padapter, _TRUE, _TRUE, _FALSE);
}

u8 btdm_HIDAction1Ant(PADAPTER padapter)
{
	PBT30Info		pBTInfo = GET_BT_INFO(padapter)	;
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (BTHCI_CheckProfileExist(padapter,BT_PROFILE_HID) && pBtMgnt->ExtConfig.NumberOfHandle==1)
	{
		pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_PROFILE_HID;
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_PROFILE_PAN;
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_PROFILE_A2DP;
		btdm_HIDActionBC81Ant(padapter);
		return _TRUE;
	}
	else
	{
		return _FALSE;
	}
}

void btdm_A2DPActionBC81Ant(PADAPTER padapter)
{
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u8			btRssiState;

	if (pBtMgnt->ExtConfig.bBTBusy)
	{
		RTPRINT(FBT, BT_TRACE, ("BT is non-idle!\n"));

		// We have to detect BT earphone spec first.
		btdm_EarphoneSpecDetect(padapter);

		if (!BTDM_IsHT40(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("HT20 or Legacy\n"));
			if (btdm_IsSingleAnt(padapter, _FALSE, _FALSE, _FALSE))
			{
				btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, BT_FW_COEX_THRESH_30, 0);
				if (BTDM_IsSameCoexistState(padapter))
					return;

				if ((btRssiState == BT_RSSI_STATE_LOW) ||
					(btRssiState == BT_RSSI_STATE_STAY_LOW))
				{
					BTDM_Balance(padapter, _TRUE, pHalData->bt_coexist.WLANActH, pHalData->bt_coexist.WLANActL);
					BTDM_SingleAnt(padapter, _TRUE, _FALSE, _FALSE);
				}
			}
			else
			{
				btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, BT_FW_COEX_THRESH_55, 0);
				if (BTDM_IsSameCoexistState(padapter))
					return;

				if ((btRssiState == BT_RSSI_STATE_HIGH) ||
					(btRssiState == BT_RSSI_STATE_STAY_HIGH))
				{
					BTDM_Balance(padapter, _FALSE, 0, 0);
					BTDM_SingleAnt(padapter, _FALSE, _FALSE, _FALSE);
				}
				else
				{
					BTDM_Balance(padapter, _TRUE, pHalData->bt_coexist.WLANActH, pHalData->bt_coexist.WLANActL);
					BTDM_SingleAnt(padapter, _TRUE, _FALSE, _FALSE);
				}
			}
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("HT40\n"));
			if (BTDM_IsSameCoexistState(padapter))
				return;
			BTDM_Balance(padapter, _TRUE, pHalData->bt_coexist.WLANActH, pHalData->bt_coexist.WLANActL);
			BTDM_SingleAnt(padapter, _TRUE, _FALSE, _FALSE);
		}
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("BT is idle!\n"));
		pHalData->bt_coexist.A2DPState = BT_A2DP_STATE_NOT_ENTERED;
		if (pHalData->bt_coexist.Ratio_PRI > 3)
		{
			RTPRINT(FBT, BT_TRACE, ("Ratio_STA > 3\n"));
		BTDM_Balance(padapter, _FALSE, 0, 0);
		BTDM_SingleAnt(padapter, _TRUE, _TRUE, _FALSE);
	}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("Ratio_STA <= 3\n"));
			BTDM_Balance(padapter, _TRUE, 32, 5);
			BTDM_SingleAnt(padapter, _TRUE, _FALSE, _FALSE);
		}
	}
}

u8 btdm_A2DPAction1Ant(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBT30Info		pBTInfo = GET_BT_INFO(padapter)	;
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;

	if (BTHCI_CheckProfileExist(padapter, BT_PROFILE_A2DP) && pBtMgnt->ExtConfig.NumberOfHandle==1)
	{
		pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_PROFILE_A2DP;
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_PROFILE_HID;
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_PROFILE_PAN;
		btdm_A2DPActionBC81Ant(padapter);
		return _TRUE;
	}
	else
	{
		return _FALSE;
	}
}

void btdm_PANActionBC81Ant(PADAPTER padapter)
{
//	PMGNT_INFO		pMgntInfo = &padapter->MgntInfo;
	struct mlme_priv *pmlmepriv = &padapter->mlmepriv;
	PBT30Info		pBTInfo = GET_BT_INFO(padapter)	;
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u8			btRssiState;

	if (pBtMgnt->ExtConfig.bBTBusy && !pBtMgnt->BtOperationOn)
	{
		RTPRINT(FBT, BT_TRACE, ("BT is non-idle && [BT 2.1]\n"));

		if (!BTDM_IsHT40(padapter))
			{
				RTPRINT(FBT, BT_TRACE, ("HT20 or Legacy\n"));
				if (btdm_IsSingleAnt(padapter, _FALSE, _FALSE, _FALSE))
				{
				btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, BT_FW_COEX_THRESH_20, 0);
					if (BTDM_IsSameCoexistState(padapter))
						return;

					if ((btRssiState == BT_RSSI_STATE_LOW) ||
						(btRssiState == BT_RSSI_STATE_STAY_LOW))
					{
					BTDM_Balance(padapter, _TRUE, 0x1c, 0x20);
					BTDM_SingleAnt(padapter, _TRUE, _FALSE, _FALSE);
					}
				}
				else
				{
					btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, BT_FW_COEX_THRESH_50, 0);
					if (BTDM_IsSameCoexistState(padapter))
						return;
					if ((btRssiState == BT_RSSI_STATE_HIGH) ||
						(btRssiState == BT_RSSI_STATE_STAY_HIGH))
					{
						BTDM_Balance(padapter, _FALSE, 0, 0);
						BTDM_SingleAnt(padapter, _FALSE, _FALSE, _FALSE);
					}
					else
					{
					BTDM_Balance(padapter, _TRUE, 0x1c, 0x20);
					BTDM_SingleAnt(padapter, _TRUE, _FALSE, _FALSE);
				}
			}
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("HT40\n"));
			if ((pHalData->bt_coexist.BT21TrafficStatistics.bRxBusyTraffic) &&
				(pmlmepriv->LinkDetectInfo.bTxBusyTraffic))
			{
				RTPRINT(FBT, BT_TRACE, ("BT is Downlink and Wifi is Uplink\n"));
				if (btdm_IsSingleAnt(padapter, _FALSE, _FALSE, _FALSE))
				{
					btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, BT_FW_COEX_THRESH_20, 0);
					if (BTDM_IsSameCoexistState(padapter))
						return;
					if ((btRssiState == BT_RSSI_STATE_LOW) ||
						(btRssiState == BT_RSSI_STATE_STAY_LOW))
					{
						BTDM_Balance(padapter, _TRUE, 0x1c, 0x20);
						BTDM_SingleAnt(padapter, _TRUE, _FALSE, _FALSE);
					}
				}
				else
				{
					btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, BT_FW_COEX_THRESH_45, 0);
					if (BTDM_IsSameCoexistState(padapter))
						return;
					if ((btRssiState == BT_RSSI_STATE_HIGH) ||
						(btRssiState == BT_RSSI_STATE_STAY_HIGH))
					{
						BTDM_Balance(padapter, _FALSE, 0, 0);
						BTDM_SingleAnt(padapter, _FALSE, _FALSE, _FALSE);
					}
					else
					{
						BTDM_Balance(padapter, _TRUE, 0x1c, 0x20);
						BTDM_SingleAnt(padapter, _TRUE, _FALSE, _FALSE);
					}
				}
			}
			else
			{
				RTPRINT(FBT, BT_TRACE, ("BT Uplink or BTdownlink+Wifi downlink\n"));
				BTDM_Balance(padapter, _TRUE, 0x1c, 0x20);
				BTDM_SingleAnt(padapter, _TRUE, _FALSE, _FALSE);
			}
		}
	}
	else if (pBtMgnt->ExtConfig.bBTBusy && pBtMgnt->BtOperationOn)
	{
		RTPRINT(FBT, BT_TRACE, ("BT is non-idle && [BT 3.0]\n"));
		BTDM_FWCoexAllOff(padapter);
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("BT is idle\n"));
		BTDM_Balance(padapter, _TRUE, 32, 5);
		BTDM_SingleAnt(padapter, _TRUE, _FALSE, _FALSE);
	}
}

u8 btdm_PANAction1Ant(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;

