acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
	if (BTHCI_CheckProfileExist(padapter,BT_PROFILE_PAN) && pBtMgnt->ExtConfig.NumberOfHandle==1)
	{
		pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_PROFILE_PAN;
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_PROFILE_HID;
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_PROFILE_A2DP;
		btdm_PANActionBC81Ant(padapter);
		return _TRUE;
	}
	else
	{
		return _FALSE;
	}
}

void btdm_HIDA2DPActionBC81Ant(PADAPTER padapter)
{
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;

	if (pBtMgnt->ExtConfig.bBTBusy)
	{
		RTPRINT(FBT, BT_TRACE, ("BT is non-idle!\n"));
		BTDM_Balance(padapter, _TRUE, 0x5, 0x1a);
		BTDM_SingleAnt(padapter, _TRUE, _FALSE, _FALSE);
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("BT is idle!\n"));
		BTDM_Balance(padapter, _FALSE, 0, 0);
		BTDM_SingleAnt(padapter, _TRUE, _TRUE, _FALSE);
	}
}

u8 btdm_HIDA2DPAction1Ant(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (BTHCI_CheckProfileExist(padapter,BT_PROFILE_HID) && BTHCI_CheckProfileExist(padapter,BT_PROFILE_A2DP))
	{
		pHalData->bt_coexist.CurrentState |= (BT_COEX_STATE_PROFILE_HID|BT_COEX_STATE_PROFILE_A2DP);
		btdm_HIDA2DPActionBC81Ant(padapter);
		return _TRUE;
	}
	else
	{
		pHalData->bt_coexist.CurrentState &= ~(BT_COEX_STATE_PROFILE_HID|BT_COEX_STATE_PROFILE_A2DP);
		return _FALSE;
	}
}

void btdm_HIDPANActionBC81Ant(PADAPTER padapter)
{
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;

	if ((pBtMgnt->ExtConfig.bBTBusy && !pBtMgnt->BtOperationOn))
	{
		RTPRINT(FBT, BT_TRACE, ("BT is non-idle && [BT 2.1]\n"));
		BTDM_Balance(padapter, _TRUE, 0x5, 0x1a);
		BTDM_SingleAnt(padapter, _TRUE, _FALSE, _FALSE);
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("BT is idle or [BT 3.0]\n"));
		BTDM_Balance(padapter, _FALSE, 0, 0);
		BTDM_SingleAnt(padapter, _TRUE, _TRUE, _FALSE);
	}
}

u8 btdm_HIDPANAction1Ant(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (BTHCI_CheckProfileExist(padapter,BT_PROFILE_HID) && BTHCI_CheckProfileExist(padapter,BT_PROFILE_PAN))
	{
		pHalData->bt_coexist.CurrentState |= (BT_COEX_STATE_PROFILE_HID|BT_COEX_STATE_PROFILE_PAN);
		btdm_HIDPANActionBC81Ant(padapter);
		return _TRUE;
	}
	else
	{
		pHalData->bt_coexist.CurrentState &= ~(BT_COEX_STATE_PROFILE_HID|BT_COEX_STATE_PROFILE_PAN);
		return _FALSE;
	}
}

void btdm_PANA2DPActionBC81Ant(PADAPTER padapter)
{
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;

	if ((pBtMgnt->ExtConfig.bBTBusy && !pBtMgnt->BtOperationOn))
	{
		RTPRINT(FBT, BT_TRACE, ("BT is non-idle && [BT 2.1]\n"));
		BTDM_Balance(padapter, _TRUE, 0x5, 0x1a);
		BTDM_SingleAnt(padapter, _TRUE, _FALSE, _FALSE);
	}
	else if ((pBtMgnt->ExtConfig.bBTBusy && pBtMgnt->BtOperationOn))
	{
		RTPRINT(FBT, BT_TRACE, ("BT is non-idle && [BT 3.0]\n"));
		btdm_A2DPActionBC81Ant(padapter);
	}
	else
	{
		BTDM_Balance(padapter, _FALSE, 0, 0);
		BTDM_SingleAnt(padapter, _TRUE, _TRUE, _FALSE);
	}
}

u8 btdm_PANA2DPAction1Ant(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (BTHCI_CheckProfileExist(padapter,BT_PROFILE_PAN) && BTHCI_CheckProfileExist(padapter,BT_PROFILE_A2DP))
	{
		pHalData->bt_coexist.CurrentState |= (BT_COEX_STATE_PROFILE_PAN|BT_COEX_STATE_PROFILE_A2DP);
		btdm_PANA2DPActionBC81Ant(padapter);
		return _TRUE;
	}
	else
	{
		pHalData->bt_coexist.CurrentState &= ~(BT_COEX_STATE_PROFILE_PAN|BT_COEX_STATE_PROFILE_A2DP);
		return _FALSE;
	}
}

//============================================================
// extern function start with BTDM_
//============================================================

void BTDM_SetAntenna(PADAPTER padapter, u8 who)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;

	if (!IS_HARDWARE_TYPE_8192C(padapter))
		return;
	if (!pHalData->bt_coexist.BluetoothCoexist)
		return;
	if (pBtMgnt->ExtConfig.bManualControl)
		return;
	if (pHalData->bt_coexist.BT_CoexistType != BT_CSR_BC8)
		return;
	if (pHalData->bt_coexist.BT_Ant_Num != Ant_x1)
		return;
//	if (pHalData->bt_coexist.AntennaState == who)
//		return;

	switch (who)
	{
		case BTDM_ANT_BT_IDLE:
			RTPRINT(FBT, BT_TRACE, ("BTDM_SetAntenna(), BTDM_ANT_BT_IDLE\n"));
			BTDM_Balance(padapter, _FALSE, 0, 0);
			BTDM_SingleAnt(padapter, _TRUE, _TRUE, _FALSE);
			pHalData->bt_coexist.AntennaState = BTDM_ANT_BT_IDLE;
			break;

		case BTDM_ANT_WIFI:
			RTPRINT(FBT, BT_TRACE, ("BTDM_SetAntenna(), BTDM_ANT_WIFI\n"));
			BTDM_Balance(padapter, _FALSE, 0, 0);
			BTDM_SingleAnt(padapter, _FALSE, _FALSE, _FALSE);
			rtw_mdelay_os(3);	// 1 will fail, 2 ok
			btdm_WriteReg860(padapter, 0x130);
			pHalData->bt_coexist.AntennaState = BTDM_ANT_WIFI;
			break;

		case BTDM_ANT_BT:
			RTPRINT(FBT, BT_TRACE, ("BTDM_SetAntenna(), BTDM_ANT_BT\n"));
			BTDM_Balance(padapter, _FALSE, 0, 0);
			BTDM_SingleAnt(padapter, _FALSE, _FALSE, _FALSE);
			//btdm_WriteReg860(padapter, 0x230);
			pHalData->bt_coexist.AntennaState = BTDM_ANT_BT;
			break;

		default:
			RT_ASSERT(_FALSE, ("BTDM_SetAntenna(), error case\n"));
			break;
	}
}

void
BTDM_SingleAnt(
	PADAPTER	padapter,
	u8		bSingleAntOn,
	u8		bInterruptOn,
	u8		bMultiNAVOn
	)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u8			H2C_Parameter[3] = {0};

	if (pHalData->bt_coexist.BT_Ant_Num != Ant_x1)
		return;

	H2C_Parameter[2] = 0;
	H2C_Parameter[1] = 0;
	H2C_Parameter[0] = 0;

	if (bInterruptOn)
	{
		H2C_Parameter[2] |= 0x02;	//BIT1
		pHalData->bt_coexist.bFWCoexistAllOff = _FALSE;
	}
	pHalData->bt_coexist.bInterruptOn = bInterruptOn;

	if (bSingleAntOn)
	{
		H2C_Parameter[2] |= 0x10;	//BIT4
		pHalData->bt_coexist.bFWCoexistAllOff = _FALSE;
	}
	pHalData->bt_coexist.bSingleAntOn = bSingleAntOn;

	if (bMultiNAVOn)
	{
		H2C_Parameter[2] |= 0x20;	//BIT5
		pHalData->bt_coexist.bFWCoexistAllOff = _FALSE;
	}
	pHalData->bt_coexist.bMultiNAVOn = bMultiNAVOn;

	RTPRINT(FBT, BT_TRACE, ("[DM][BT], SingleAntenna=[%s:%s:%s], write 0xe = 0x%x\n",
		bSingleAntOn?"ON":"OFF", bInterruptOn?"ON":"OFF", bMultiNAVOn?"ON":"OFF",
		H2C_Parameter[0]<<16|H2C_Parameter[1]<<8|H2C_Parameter[2]));

