acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
	if (IS_HARDWARE_TYPE_8192C(padapter))
	{
		FillH2CCmd(padapter, 0xe, 3, H2C_Parameter);
	}
	else if (IS_HARDWARE_TYPE_8192D(padapter))
	{
		FillH2CCmd(padapter, 0x12, 3, H2C_Parameter);
	}
}

void BTDM_CheckBTIdleChange1Ant(PADAPTER padapter)
{
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
//	PMGNT_INFO		pMgntInfo = &padapter->MgntInfo;
	u8				stateChange = _FALSE;
	u32 			BT_Polling, Ratio_Act, Ratio_STA;
	u32				BT_Active, BT_State;
	u32				regBTActive=0, regBTState=0, regBTPolling=0;

	if (!pHalData->bt_coexist.BluetoothCoexist)
		return;
	if (pBtMgnt->ExtConfig.bManualControl)
		return;
	if (pHalData->bt_coexist.BT_CoexistType != BT_CSR_BC8)
		return;
	if (pHalData->bt_coexist.BT_Ant_Num != Ant_x1)
		return;

	//
	// The following we only consider CSR BC8 and fw version should be >= 62
	//
	RTPRINT(FBT, BT_TRACE, ("[DM][BT], FirmwareVersion = 0x%x(%d)\n",
	pHalData->FirmwareVersion, pHalData->FirmwareVersion));
	{
		regBTActive = REG_BT_ACTIVE;
		regBTState = REG_BT_STATE;
		if (pHalData->FirmwareVersion >= FW_VER_BT_REG1)
			regBTPolling = REG_BT_POLLING1;
		else
			regBTPolling = REG_BT_POLLING;
	}

	BT_Active = rtw_read32(padapter, regBTActive);
	RTPRINT(FBT, BT_TRACE, ("[DM][BT], BT_Active(0x%x)=%x\n", regBTActive, BT_Active));
	BT_Active = BT_Active & 0x00ffffff;

	BT_State = rtw_read32(padapter, regBTState);
	RTPRINT(FBT, BT_TRACE, ("[DM][BT], BT_State(0x%x)=%x\n", regBTState, BT_State));
	BT_State = BT_State & 0x00ffffff;

	BT_Polling = rtw_read32(padapter, regBTPolling);
	RTPRINT(FBT, BT_TRACE, ("[DM][BT], BT_Polling(0x%x)=%x\n", regBTPolling, BT_Polling));

	if (BT_Active==0xffffffff && BT_State==0xffffffff && BT_Polling==0xffffffff )
		return;
	if (BT_Polling == 0)
		return;

	Ratio_Act = BT_Active*1000/BT_Polling;
	Ratio_STA = BT_State*1000/BT_Polling;

	pHalData->bt_coexist.Ratio_Tx = Ratio_Act;
	pHalData->bt_coexist.Ratio_PRI = Ratio_STA;

	RTPRINT(FBT, BT_TRACE, ("[DM][BT], Ratio_Act=%d\n", Ratio_Act));
	RTPRINT(FBT, BT_TRACE, ("[DM][BT], Ratio_STA=%d\n", Ratio_STA));

	if (Ratio_STA<60 && Ratio_Act<500)	// BT PAN idle
	{
		pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_PAN_IDLE;
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_PAN_DOWNLINK;
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_PAN_UPLINK;
	}
	else
	{
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_PAN_IDLE;

		if (Ratio_STA)
		{
			// Check if BT PAN (under BT 2.1) is uplink or downlink
			if ((Ratio_Act/Ratio_STA) < 2)
			{
				// BT PAN Uplink
				pHalData->bt_coexist.BT21TrafficStatistics.bTxBusyTraffic = _TRUE;
				pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_PAN_UPLINK;
				pHalData->bt_coexist.BT21TrafficStatistics.bRxBusyTraffic = _FALSE;
				pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_PAN_DOWNLINK;
			}
			else
			{
				// BT PAN downlink
				pHalData->bt_coexist.BT21TrafficStatistics.bTxBusyTraffic = _FALSE;
				pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_PAN_UPLINK;
				pHalData->bt_coexist.BT21TrafficStatistics.bRxBusyTraffic = _TRUE;
				pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_PAN_DOWNLINK;
			}
		}
		else
		{
			// BT PAN downlink
			pHalData->bt_coexist.BT21TrafficStatistics.bTxBusyTraffic = _FALSE;
			pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_PAN_UPLINK;
			pHalData->bt_coexist.BT21TrafficStatistics.bRxBusyTraffic = _TRUE;
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_PAN_DOWNLINK;
		}
	}

	// Check BT is idle or not
	if (pBtMgnt->ExtConfig.NumberOfHandle==0 &&
		pBtMgnt->ExtConfig.NumberOfSCO==0)
	{
		pBtMgnt->ExtConfig.bBTBusy = _FALSE;
		pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_IDLE;
	}
	else
	{
		if (Ratio_STA<60)
		{
			pBtMgnt->ExtConfig.bBTBusy = _FALSE;
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_IDLE;
		}
		else
		{
			pBtMgnt->ExtConfig.bBTBusy = _TRUE;
			pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_IDLE;
		}
	}

	if (pBtMgnt->ExtConfig.NumberOfHandle==0 &&
		pBtMgnt->ExtConfig.NumberOfSCO==0)
	{
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_RSSI_LOW;
		pBtMgnt->ExtConfig.MIN_BT_RSSI = 0;
		BTDM_SetAntenna(padapter, BTDM_ANT_BT_IDLE);
	}
	else
	{
		if (pBtMgnt->ExtConfig.MIN_BT_RSSI <= -5)
		{
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_RSSI_LOW;
			RTPRINT(FBT, BT_TRACE, ("[DM][BT], core stack notify bt rssi Low\n"));
		}
		else
		{
			pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_RSSI_LOW;
			RTPRINT(FBT, BT_TRACE, ("[DM][BT], core stack notify bt rssi Normal\n"));
		}
	}

	if (pHalData->bt_coexist.bBTBusyTraffic !=
		pBtMgnt->ExtConfig.bBTBusy)
	{	// BT idle or BT non-idle
		pHalData->bt_coexist.bBTBusyTraffic = pBtMgnt->ExtConfig.bBTBusy;
		stateChange = _TRUE;
	}

	if (stateChange)
	{
		if (!pBtMgnt->ExtConfig.bBTBusy)
		{
			RTPRINT(FBT, BT_TRACE, ("[DM][BT], BT is idle or disable\n"));
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("[DM][BT], BT is non-idle\n"));
		}
	}
	if (!pBtMgnt->ExtConfig.bBTBusy)
	{
		RTPRINT(FBT, BT_TRACE, ("[DM][BT], BT is idle or disable\n"));
#if 0
		if (MgntRoamingInProgress(pMgntInfo) ||
			MgntIsLinkInProgress(pMgntInfo) ||
			MgntScanInProgress(pMgntInfo))
#else
		if (check_fwstate(&padapter->mlmepriv, WIFI_UNDER_LINKING|WIFI_SITE_MONITOR) == _TRUE)
#endif
		{
			BTDM_SetAntenna(padapter, BTDM_ANT_WIFI);
		}
	}
}

void BTDM_BTCoexistWithProfile1Ant(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;

	if (pBtMgnt->ExtConfig.bManualControl)
	{
		btdm_CheckCounterOnly1Ant(padapter);
		return;
	}

	RTPRINT(FIOCTL, IOCTL_BT_FLAG_MON, ("CurrentBTConnectionCnt=%d, BtOperationOn=%d, bBTConnectInProgress=%d !!\n",
		pBtMgnt->CurrentBTConnectionCnt, pBtMgnt->BtOperationOn, pBtMgnt->bBTConnectInProgress));

	if ((pHalData->bt_coexist.BluetoothCoexist) &&
		(pHalData->bt_coexist.BT_CoexistType == BT_CSR_BC8))
	{
		BTHCI_GetProfileNameMoto(padapter);
		BTHCI_GetBTRSSI(padapter);
		BTDM_CheckBTIdleChange1Ant(padapter);
		BTDM_CheckWiFiState(padapter);

