acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
		if (btdm_SCOAction1Ant(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("[DM][BT], Action SCO\n"));
		}
		else if (btdm_HIDAction1Ant(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("[DM][BT], Action HID\n"));
		}
		else if (btdm_A2DPAction1Ant(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("[DM][BT], Action A2DP\n"));
		}
		else if (btdm_PANAction1Ant(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("[DM][BT], Action PAN\n"));
		}
		else if (btdm_HIDA2DPAction1Ant(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("[DM][BT], Action HID_A2DP\n"));
		}
		else if (btdm_HIDPANAction1Ant(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("[DM][BT], Action HID_PAN\n"));
		}
		else if (btdm_PANA2DPAction1Ant(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("[DM][BT], Action PAN_A2DP\n"));
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("[DM][BT], No Action case!!!\n"));
		}

		if (!BTDM_IsSameCoexistState(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("[DM][BT], Coexist State[bitMap] change from 0x%"i64fmt"x to 0x%"i64fmt"x\n",
				pHalData->bt_coexist.PreviousState,
				pHalData->bt_coexist.CurrentState));
			pHalData->bt_coexist.PreviousState = pHalData->bt_coexist.CurrentState;

			RTPRINT(FBT, BT_TRACE, ("["));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_BT30)
				RTPRINT(FBT, BT_TRACE, ("BT 3.0, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_HT20)
				RTPRINT(FBT, BT_TRACE, ("HT20, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_HT40)
				RTPRINT(FBT, BT_TRACE, ("HT40, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_LEGACY)
				RTPRINT(FBT, BT_TRACE, ("Legacy, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_RSSI_LOW)
				RTPRINT(FBT, BT_TRACE, ("Rssi_Low, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_RSSI_MEDIUM)
				RTPRINT(FBT, BT_TRACE, ("Rssi_Mid, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_RSSI_HIGH)
				RTPRINT(FBT, BT_TRACE, ("Rssi_High, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_IDLE)
				RTPRINT(FBT, BT_TRACE, ("Wifi_Idle, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_UPLINK)
				RTPRINT(FBT, BT_TRACE, ("Wifi_Uplink, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_DOWNLINK)
				RTPRINT(FBT, BT_TRACE, ("Wifi_Downlink, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_BT_IDLE)
				RTPRINT(FBT, BT_TRACE, ("BT_idle, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_BT_PAN_IDLE)
				RTPRINT(FBT, BT_TRACE, ("BT_PAN_idle, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_BT_PAN_UPLINK)
				RTPRINT(FBT, BT_TRACE, ("BT_PAN_uplink, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_BT_PAN_DOWNLINK)
				RTPRINT(FBT, BT_TRACE, ("BT_PAN_downlink, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_PROFILE_HID)
				RTPRINT(FBT, BT_TRACE, ("PRO_HID, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_PROFILE_A2DP)
				RTPRINT(FBT, BT_TRACE, ("PRO_A2DP, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_PROFILE_PAN)
				RTPRINT(FBT, BT_TRACE, ("PRO_PAN, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_PROFILE_SCO)
				RTPRINT(FBT, BT_TRACE, ("PRO_SCO, "));
			RTPRINT(FBT, BT_TRACE, ("]\n"));
		}
	}
}

// ===== End of sync from SD7 driver HAL/BTCoexist/HalBtcCsr1Ant.c =====
#endif

#ifdef __HALBTCCSR2ANT_C__ // HAL/BTCoexist/HalBtcCsr2Ant.c
// ===== Below this line is sync from SD7 driver HAL/BTCoexist/HalBtcCsr2Ant.c =====

//============================================================
// local function start with btdm_
//============================================================
void
btdm_BtEnableDisableCheck(
	PADAPTER	padapter,
	u32		BT_Active
	)
{
	// This function check if 92D bt is disabled
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (IS_HARDWARE_TYPE_8192D(padapter))
	{
		if (BT_Active)
		{
			pHalData->bt_coexist.btActiveZeroCnt = 0;
			pHalData->bt_coexist.bCurBtDisabled = _FALSE;
			RTPRINT(FBT, BT_TRACE, ("92D Bt is enabled !!\n"));
		}
		else
		{
			pHalData->bt_coexist.btActiveZeroCnt++;
			RTPRINT(FBT, BT_TRACE, ("92D BT_Active = 0, cnt = %d!!\n",
					pHalData->bt_coexist.btActiveZeroCnt));
			if (pHalData->bt_coexist.btActiveZeroCnt >= 2)
			{
				pHalData->bt_coexist.bCurBtDisabled = _TRUE;
				RTPRINT(FBT, BT_TRACE, ("92D Bt is disabled !!\n"));
			}
		}
		if (pHalData->bt_coexist.bPreBtDisabled !=
			pHalData->bt_coexist.bCurBtDisabled )
		{
			RTPRINT(FBT, BT_TRACE, ("92D Bt is from %s to %s!!\n",
				(pHalData->bt_coexist.bPreBtDisabled ? "disabled":"enabled"),
				(pHalData->bt_coexist.bCurBtDisabled ? "disabled":"enabled")));
			pHalData->bt_coexist.bNeedToRoamForBtDisableEnable = _TRUE;
			pHalData->bt_coexist.bPreBtDisabled = pHalData->bt_coexist.bCurBtDisabled;
		}
	}
}

void btdm_CheckBTState2Ant(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
//	PMGNT_INFO		pMgntInfo = &padapter->MgntInfo;
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
//	PRT_HIGH_THROUGHPUT	pHTInfo = GET_HT_INFO(pMgntInfo);
	u8			stateChange = _FALSE;
	u32 			BT_Polling, Ratio_Act, Ratio_STA;
	u32 			BT_Active, BT_State;
	u32			regBTActive = 0, regBTState = 0, regBTPolling=0;
	u32			btBusyThresh = 0;

	RTPRINT(FBT, BT_TRACE, ("FirmwareVersion = 0x%x(%d)\n",
	pHalData->FirmwareVersion, pHalData->FirmwareVersion));

	if (IS_HARDWARE_TYPE_8192C(padapter))
	{
		if (pHalData->FirmwareVersion < FW_VER_BT_REG)
		{
			regBTActive = REG_BT_ACTIVE_OLD;
			regBTState = REG_BT_STATE_OLD;
			regBTPolling = REG_BT_POLLING_OLD;
		}
		else
		{
			regBTActive = REG_BT_ACTIVE;
			regBTState = REG_BT_STATE;
			if (pHalData->FirmwareVersion >= FW_VER_BT_REG1)
				regBTPolling = REG_BT_POLLING1;
			else
				regBTPolling = REG_BT_POLLING;
		}
	}
	else if (IS_HARDWARE_TYPE_8192D(padapter))
	{
		regBTActive = REG_BT_ACTIVE;
		regBTState = REG_BT_STATE;
		regBTPolling = REG_BT_POLLING1;
	}

	if (IS_HARDWARE_TYPE_8192D(padapter))
	{
		btBusyThresh = 40;
	}
	else
	{
		btBusyThresh = 60;
	}

	BT_Active = rtw_read32(padapter, regBTActive);
	RTPRINT(FBT, BT_TRACE, ("BT_Active(0x%x)=%x\n", regBTActive, BT_Active));
	BT_Active = BT_Active & 0x00ffffff;

	BT_State = rtw_read32(padapter, regBTState);
	RTPRINT(FBT, BT_TRACE, ("BT_State(0x%x)=%x\n", regBTState, BT_State));
	BT_State = BT_State & 0x00ffffff;

	BT_Polling = rtw_read32(padapter, regBTPolling);
	RTPRINT(FBT, BT_TRACE, ("BT_Polling(0x%x)=%x\n", regBTPolling, BT_Polling));

	if (BT_Active==0xffffffff && BT_State==0xffffffff && BT_Polling==0xffffffff )
		return;

	// 2011/05/04 MH For Slim combo test meet a problem. Surprise remove and WLAN is running
	// DHCP process. At the same time, the register read value might be zero. And cause BSOD 0x7f
	// EXCEPTION_DIVIDED_BY_ZERO. In This case, the stack content may always be wrong due to
	// HW divide trap.
	if (BT_Polling==0)
		return;

	btdm_BtEnableDisableCheck(padapter, BT_Active);

	Ratio_Act = BT_Active*1000/BT_Polling;
	Ratio_STA = BT_State*1000/BT_Polling;

	pHalData->bt_coexist.Ratio_Tx = Ratio_Act;
	pHalData->bt_coexist.Ratio_PRI = Ratio_STA;

	RTPRINT(FBT, BT_TRACE, ("Ratio_Act=%d\n", Ratio_Act));
	RTPRINT(FBT, BT_TRACE, ("Ratio_STA=%d\n", Ratio_STA));

	if (pHalData->bt_coexist.BT_CoexistType == BT_CSR_BC8)
	{
		if (Ratio_STA < 60)	// BT PAN idle
		{
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_PAN_IDLE;
			pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_PAN_DOWNLINK;
			pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_PAN_UPLINK;
		}
		else
		{
			pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_PAN_IDLE;

			// Check if BT PAN (under BT 2.1) is uplink or downlink
			if ((Ratio_Act/Ratio_STA) < 2)
			{	// BT PAN Uplink
				pHalData->bt_coexist.BT21TrafficStatistics.bTxBusyTraffic = _TRUE;
				pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_PAN_UPLINK;
				pHalData->bt_coexist.BT21TrafficStatistics.bRxBusyTraffic = _FALSE;
				pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_PAN_DOWNLINK;
			}
			else
			{	// BT PAN downlink
				pHalData->bt_coexist.BT21TrafficStatistics.bTxBusyTraffic = _FALSE;
				pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_PAN_UPLINK;
				pHalData->bt_coexist.BT21TrafficStatistics.bRxBusyTraffic = _TRUE;
				pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_PAN_DOWNLINK;
			}
		}
	}
	else
	{
		// BC4, doesn't use the following variables.
		pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_PAN_IDLE;
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_PAN_DOWNLINK;
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_PAN_UPLINK;
	}


	// Check BT is idle or not
	if (pBtMgnt->ExtConfig.NumberOfHandle==0 &&
		pBtMgnt->ExtConfig.NumberOfSCO==0)
	{
		pBtMgnt->ExtConfig.bBTBusy = _FALSE;
		pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_IDLE;
	}
	else
	{
		if (pHalData->bt_coexist.BT_CoexistType == BT_CSR_BC4)
		{
			if (Ratio_Act < 20)
			{
				pBtMgnt->ExtConfig.bBTBusy = _FALSE;
				pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_IDLE;
			}
			else
			{
				pBtMgnt->ExtConfig.bBTBusy = _TRUE;
				pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_IDLE;
			}
		}
		else if (pHalData->bt_coexist.BT_CoexistType == BT_CSR_BC8)
		{
			if (Ratio_STA < btBusyThresh)
			{
				pBtMgnt->ExtConfig.bBTBusy = _FALSE;
				pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_IDLE;
			}
			else
			{
				pBtMgnt->ExtConfig.bBTBusy = _TRUE;
				pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_IDLE;
			}

			if ((Ratio_STA < btBusyThresh) ||
				(Ratio_Act<180 && Ratio_STA<130))
			{
				pBtMgnt->ExtConfig.bBTA2DPBusy = _FALSE;
				pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_A2DP_IDLE;
			}
			else
			{
				pBtMgnt->ExtConfig.bBTA2DPBusy =_TRUE;
				pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_A2DP_IDLE;
			}
		}
	}

	if (pBtMgnt->ExtConfig.NumberOfHandle==0 &&
		pBtMgnt->ExtConfig.NumberOfSCO==0)
	{
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_RSSI_LOW;
		pBtMgnt->ExtConfig.MIN_BT_RSSI = 0;
	}
	else
	{
		if (pBtMgnt->ExtConfig.MIN_BT_RSSI <= -5)
		{
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_RSSI_LOW;
			RTPRINT(FBT, BT_TRACE, ("[bt rssi], Low\n"));
		}
		else
		{
			pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_RSSI_LOW;
			RTPRINT(FBT, BT_TRACE, ("[bt rssi], Normal\n"));
		}
	}

