acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
	if (pHalData->bt_coexist.bBTBusyTraffic !=
		pBtMgnt->ExtConfig.bBTBusy)
	{	// BT idle or BT non-idle
		pHalData->bt_coexist.bBTBusyTraffic = pBtMgnt->ExtConfig.bBTBusy;
		stateChange = _TRUE;
	}

	if (stateChange)
	{
		if (!pBtMgnt->ExtConfig.bBTBusy)
		{
			u8	tempu1Byte;
			RTPRINT(FBT, BT_TRACE, ("[BT] BT is idle or disable\n"));

			tempu1Byte = rtw_read8(padapter, 0x4fd);
			tempu1Byte |= BIT(2);

			rtw_write8(padapter, 0x4fd, tempu1Byte);

			//Resume RF Rx LPF corner
			if (IS_HARDWARE_TYPE_8192D(padapter))
			{
				PHY_SetRFReg(padapter, PathA, 0x1e, bRFRegOffsetMask, pHalData->bt_coexist.BtRfRegOrigin1E);
			}
			else
			{
				PHY_SetRFReg(padapter, PathA, 0x1e, 0xf0, pHalData->bt_coexist.BtRfRegOrigin1E);
			}
			BTDM_CoexAllOff(padapter);

			RTPRINT(FBT, BT_TRACE, ("BT_Turn OFF Coexist bt is off \n"));

			rtw_write8(padapter, REG_GPIO_MUXCFG, 0x0);
		}
		else
		{
			u8	tempu1Byte;
			RTPRINT(FBT, BT_TRACE, ("[BT] BT is non-idle\n"));

			tempu1Byte = rtw_read8(padapter, 0x4fd);
			tempu1Byte &=~ BIT(2);
			rtw_write8(padapter, 0x4fd, tempu1Byte);

			//Shrink RF Rx LPF corner
			if (IS_HARDWARE_TYPE_8192D(padapter))
			{
				PHY_SetRFReg(padapter, PathA, 0x1e, bRFRegOffsetMask, 0xf2ff7);
			}
			else
			{
				//Shrink RF Rx LPF corner, 0x1e[7:4]=1111
				PHY_SetRFReg(padapter, PathA, 0x1e, 0xf0, 0xf);
			}
		}
	}

	if (stateChange)
	{
		if (pBtMgnt->ExtConfig.bBTBusy)
		{
			BTDM_RejectAPAggregatedPacket(padapter, _TRUE);
		}
		else
		{
			BTDM_RejectAPAggregatedPacket(padapter, _FALSE);
		}
	}
}

void btdm_WLANActOff(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	//Only used in BC4 setting
	rtw_write8(padapter, REG_GPIO_MUXCFG, 0x0);
	BTDM_Balance(padapter, _FALSE, 0, 0);
	BTDM_DiminishWiFi(padapter, _FALSE, _FALSE, 0x0, BT_FW_NAV_OFF);
}

void btdm_WLANActBTPrecedence(PADAPTER padapter)
{
	BTDM_Balance(padapter, _FALSE, 0, 0);
	BTDM_DiminishWiFi(padapter, _FALSE, _FALSE, 0x0, BT_FW_NAV_OFF);

	rtw_write32(padapter, 0x6c4,0x55555555);
	rtw_write32(padapter, 0x6c8,0x000000f0);
	rtw_write32(padapter, 0x6cc,0x40000010);
	rtw_write8(padapter, REG_GPIO_MUXCFG, 0xa0);
}

//==============================================================
//
// Note:
// In the following, FW should be done before SW mechanism.
// BTDM_Balance(), BTDM_DiminishWiFi(), BT_NAV() should be done
// before BTDM_AGCTable(), BTDM_BBBackOffLevel(), btdm_DacSwing().
//
//==============================================================

void btdm_DacSwing(PADAPTER padapter, u8 type)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (pHalData->bt_coexist.BT_Ant_Num != Ant_x2)
		return;

	if (type == BT_DACSWING_OFF)
	{
		RTPRINT(FBT, BT_TRACE, ("[BT]DACSwing Off!\n"));
		PHY_SetBBReg(padapter, 0x880, 0xfc000000, 0x30);
	}
	else if (type == BT_DACSWING_M4)
	{
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_BT_RSSI_LOW)
		{
			RTPRINT(FBT, BT_TRACE, ("[BT]DACSwing -4 original, but Low RSSI!\n"));
			PHY_SetBBReg(padapter, 0x880, 0xfc000000, 0x18);
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("[BT]DACSwing -4!\n"));
			PHY_SetBBReg(padapter, 0x880, 0xfc000000, 0x20);
		}
	}
	else if (type == BT_DACSWING_M7)
	{
		RTPRINT(FBT, BT_TRACE, ("[BT]DACSwing -7!\n"));
		PHY_SetBBReg(padapter, 0x880, 0xfc000000, 0x18);
	}
	else if (type == BT_DACSWING_M10)
	{
		RTPRINT(FBT, BT_TRACE, ("[BT]DACSwing -10!\n"));
		PHY_SetBBReg(padapter, 0x880, 0xfc000000, 0x10);
	}

	if (type != BT_DACSWING_OFF)
		pHalData->bt_coexist.bSWCoexistAllOff = _FALSE;
}

void btdm_A2DPActionBC42Ant(PADAPTER padapter)
{
//	PMGNT_INFO		pMgntInfo = &padapter->MgntInfo;
	struct mlme_priv *pmlmepriv = &padapter->mlmepriv;
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u8			btRssiState;

	rtw_write8(padapter, REG_GPIO_MUXCFG, 0x0);

	if (pBtMgnt->ExtConfig.bBTBusy)
	{
		RTPRINT(FBT, BT_TRACE, ("BT is non-idle!\n"));

		if (BTDM_IsHT40(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("HT40\n"));
			if (pHalData->bt_coexist.PreviousState == pHalData->bt_coexist.CurrentState)
				return;
#if 0
			// Do the FW mechanism first
			BTDM_FWCoexAllOff(padapter);
#else
			// Do the FW mechanism first
			if (pmlmepriv->LinkDetectInfo.bTxBusyTraffic)
			{
				RTPRINT(FBT, BT_TRACE, ("Wifi Uplink\n"));
				BTDM_Balance(padapter, _TRUE, 0xc, 0x18);
				BTDM_DiminishWiFi(padapter, _FALSE, _FALSE, 0x20, BT_FW_NAV_OFF);
			}
			else if (pmlmepriv->LinkDetectInfo.bRxBusyTraffic)
			{
				RTPRINT(FBT, BT_TRACE, ("Wifi Downlink\n"));
				BTDM_FWCoexAllOff(padapter);
			}
#endif
			// Then do the SW mechanism
			BTDM_AGCTable(padapter, BT_AGCTABLE_OFF);
			BTDM_BBBackOffLevel(padapter, BT_BB_BACKOFF_ON);
			btdm_DacSwing(padapter, BT_DACSWING_M4);
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("HT20 or Legacy\n"));
			btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, BT_FW_COEX_THRESH_47, 0);
			if (pHalData->bt_coexist.PreviousState == pHalData->bt_coexist.CurrentState)
				return;
#if 0
			// Do the FW mechanism first
			BTDM_FWCoexAllOff(padapter);
#else
			if (pmlmepriv->LinkDetectInfo.bTxBusyTraffic)
			{
				RTPRINT(FBT, BT_TRACE, ("Wifi Uplink\n"));
				BTDM_Balance(padapter, _TRUE, 0xc, 0x18);
				BTDM_DiminishWiFi(padapter, _FALSE, _FALSE, 0x20, BT_FW_NAV_OFF);
			}
			else if (pmlmepriv->LinkDetectInfo.bRxBusyTraffic)
			{
				RTPRINT(FBT, BT_TRACE, ("Wifi Downlink\n"));
				BTDM_FWCoexAllOff(padapter);
			}
#endif
			// Then do the SW mechanism
			if ((btRssiState == BT_RSSI_STATE_HIGH) ||
				(btRssiState == BT_RSSI_STATE_STAY_HIGH))
			{
				BTDM_AGCTable(padapter, BT_AGCTABLE_ON);
				BTDM_BBBackOffLevel(padapter, BT_BB_BACKOFF_ON);
				btdm_DacSwing(padapter, BT_DACSWING_M4);
			}
			else
			{
				BTDM_AGCTable(padapter, BT_AGCTABLE_OFF);
				BTDM_BBBackOffLevel(padapter, BT_BB_BACKOFF_OFF);
				btdm_DacSwing(padapter, BT_DACSWING_M4);
			}
		}
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("BT is idle!\n"));
		BTDM_CoexAllOff(padapter);
	}
}

void btdm_A2DPActionBC82Ant(PADAPTER padapter)
{
//	PMGNT_INFO		pMgntInfo = &padapter->MgntInfo;
	struct mlme_priv *pmlmepriv = &padapter->mlmepriv;
	PBT30Info		pBTInfo = GET_BT_INFO(padapter)	;
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u8			btRssiState;

	if (pBtMgnt->ExtConfig.bBTA2DPBusy && pmlmepriv->LinkDetectInfo.bBusyTraffic)
	{
		RTPRINT(FBT, BT_TRACE, ("BT is non-idle && Wifi is non-idle!\n"));
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, BT_FW_COEX_THRESH_47, 0);
		if (pHalData->bt_coexist.PreviousState == pHalData->bt_coexist.CurrentState)
			return;

