acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
	if (pBtMgnt->BtOperationOn)
	{
		RTPRINT(FBT, BT_TRACE, ("[BT 3.0]\n"));
		if (pHalData->bt_coexist.PreviousState == pHalData->bt_coexist.CurrentState)
			return;

		BTDM_CoexAllOff(padapter);
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("[BT 2.1]\n"));
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 3, BT_FW_COEX_THRESH_25, BT_FW_COEX_THRESH_50);
		if (pHalData->bt_coexist.PreviousState == pHalData->bt_coexist.CurrentState)
			return;

		if (pBtMgnt->ExtConfig.bBTBusy && pmlmepriv->LinkDetectInfo.bBusyTraffic)
		{
			RTPRINT(FBT, BT_TRACE, ("BT is non-idle && Wifi is non-idle!\n"));

			if ((btRssiState == BT_RSSI_STATE_HIGH) ||
				(btRssiState == BT_RSSI_STATE_STAY_HIGH))
			{
				RTPRINT(FBT, BT_TRACE, ("RSSI stay HIGH or High \n"));
				// Do the FW mechanism first
				if (pHalData->bt_coexist.BT21TrafficStatistics.bTxBusyTraffic)
				{
					RTPRINT(FBT, BT_TRACE, ("BT Uplink\n"));
					BTDM_Balance(padapter, _TRUE, 0x20, 0x20);
					BTDM_DiminishWiFi(padapter, _TRUE, _FALSE, 0x20, BT_FW_NAV_OFF);
				}
				else if (pHalData->bt_coexist.BT21TrafficStatistics.bRxBusyTraffic)
				{
					RTPRINT(FBT, BT_TRACE, ("BT Downlink\n"));
					BTDM_FWCoexAllOff(padapter);
				}
				// Then do the SW mechanism
				if (BTDM_IsHT40(padapter))
				{
					RTPRINT(FBT, BT_TRACE, ("HT40\n"));
					BTDM_AGCTable(padapter, BT_AGCTABLE_OFF);
				}
				else
				{
					RTPRINT(FBT, BT_TRACE, ("HT20 or Legacy\n"));
					BTDM_AGCTable(padapter, BT_AGCTABLE_ON);
				}
				BTDM_BBBackOffLevel(padapter, BT_BB_BACKOFF_ON);
				if (pHalData->bt_coexist.BT21TrafficStatistics.bTxBusyTraffic)
				{
					RTPRINT(FBT, BT_TRACE, ("BT Uplink\n"));
					btdm_DacSwing(padapter, BT_DACSWING_OFF);
				}
				else if (pHalData->bt_coexist.BT21TrafficStatistics.bRxBusyTraffic)
				{
					RTPRINT(FBT, BT_TRACE, ("BT Downlink\n"));
					btdm_DacSwing(padapter, BT_DACSWING_M4);
				}
			}
			else if ((btRssiState == BT_RSSI_STATE_MEDIUM) ||
				(btRssiState == BT_RSSI_STATE_STAY_MEDIUM))
			{
				RTPRINT(FBT, BT_TRACE, ("RSSI stay Medium or Medium \n"));
				// Do the FW mechanism first
				BTDM_Balance(padapter, _TRUE, 0x20, 0x20);

				if (pmlmepriv->LinkDetectInfo.bTxBusyTraffic)
				{
					RTPRINT(FBT, BT_TRACE, ("Wifi Uplink\n"));
					BTDM_DiminishWiFi(padapter, _TRUE, _FALSE, 0x20, BT_FW_NAV_OFF);
				}
				else if (pmlmepriv->LinkDetectInfo.bRxBusyTraffic)
				{
					RTPRINT(FBT, BT_TRACE, ("Wifi Downlink\n"));
					if (BTDM_IsHT40(padapter))
						BTDM_DiminishWiFi(padapter, _TRUE, _FALSE, 0x20, BT_FW_NAV_OFF);//BT_FW_NAV_ON);
					else
						BTDM_DiminishWiFi(padapter, _TRUE, _FALSE, 0x20, BT_FW_NAV_OFF);
				}
				// Then do the SW mechanism
				if (BTDM_IsHT40(padapter))
				{
					RTPRINT(FBT, BT_TRACE, ("HT40\n"));
					BTDM_AGCTable(padapter, BT_AGCTABLE_OFF);
				}
				else
				{
					RTPRINT(FBT, BT_TRACE, ("HT20 or Legacy\n"));
					BTDM_AGCTable(padapter, BT_AGCTABLE_ON);
				}
				BTDM_BBBackOffLevel(padapter, BT_BB_BACKOFF_ON);
				btdm_DacSwing(padapter, BT_DACSWING_OFF);
			}
			else
			{
				RTPRINT(FBT, BT_TRACE, ("RSSI stay LOW or LOW \n"));
				// Do the FW mechanism first
				BTDM_Balance(padapter, _TRUE, 0x20, 0x20);

				if (pmlmepriv->LinkDetectInfo.bTxBusyTraffic)
				{
					RTPRINT(FBT, BT_TRACE, ("Wifi Uplink\n"));
					BTDM_DiminishWiFi(padapter, _TRUE, _FALSE, 0x20, BT_FW_NAV_OFF);
				}
				else if (pmlmepriv->LinkDetectInfo.bRxBusyTraffic)
				{
					RTPRINT(FBT, BT_TRACE, ("Wifi Downlink\n"));
					if (pHalData->bt_coexist.BT21TrafficStatistics.bTxBusyTraffic)
					{
						RTPRINT(FBT, BT_TRACE, ("BT Uplink\n"));
						if (BTDM_IsHT40(padapter))
						{
							RTPRINT(FBT, BT_TRACE, ("HT40\n"));
							BTDM_DiminishWiFi(padapter, _TRUE, _FALSE, 0x20, BT_FW_NAV_OFF);//BT_FW_NAV_ON);
						}
						else
						{
							RTPRINT(FBT, BT_TRACE, ("HT20 or Legacy\n"));
							BTDM_DiminishWiFi(padapter, _TRUE, _FALSE, 0x20, BT_FW_NAV_OFF);
						}
					}
					else if (pHalData->bt_coexist.BT21TrafficStatistics.bRxBusyTraffic)
					{
						RTPRINT(FBT, BT_TRACE, ("BT Downlink\n"));
						BTDM_DiminishWiFi(padapter, _TRUE, _FALSE, 0x20, BT_FW_NAV_OFF);
					}
				}
				// Then do the SW mechanism
				BTDM_SWCoexAllOff(padapter);
			}
		}
		else if (pBtMgnt->ExtConfig.bBTBusy &&
				!pmlmepriv->LinkDetectInfo.bBusyTraffic &&
				(BTDM_GetRxSS(padapter) < 30))
		{
			RTPRINT(FBT, BT_TRACE, ("BT is non-idle && Wifi is idle!\n"));
			RTPRINT(FBT, BT_TRACE, ("RSSI < 30\n"));
			// Do the FW mechanism first
			BTDM_Balance(padapter, _TRUE, 0x0a, 0x20);
			BTDM_DiminishWiFi(padapter, _TRUE, _FALSE, 0x20, BT_FW_NAV_OFF);
			// Then do the SW mechanism
			BTDM_SWCoexAllOff(padapter);
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("BT is idle or Wifi is idle!\n"));
			BTDM_CoexAllOff(padapter);
		}
	}
}

void btdm_PANActionBC82Ant92d(PADAPTER padapter)
{
//	PMGNT_INFO		pMgntInfo = &padapter->MgntInfo;
	struct mlme_priv *pmlmepriv = &padapter->mlmepriv;
	PBT30Info		pBTInfo = GET_BT_INFO(padapter)	;
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u8			btRssiState, rssiState1;

	if (pBtMgnt->BtOperationOn)
	{
		RTPRINT(FBT, BT_TRACE, ("[BT 3.0]\n"));
		if (pHalData->bt_coexist.PreviousState == pHalData->bt_coexist.CurrentState)
			return;

		BTDM_CoexAllOff(padapter);
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("[BT 2.1]\n"));
		if (BTDM_IsHT40(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("HT40\n"));
			rssiState1 = BTDM_CheckCoexRSSIState1(padapter, 2, BT_FW_COEX_THRESH_47, 0);
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("HT20 or Legacy\n"));
			rssiState1 = BTDM_CheckCoexRSSIState1(padapter, 2, BT_FW_COEX_THRESH_25, 0);
		}
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 3, BT_FW_COEX_THRESH_25, BT_FW_COEX_THRESH_50);
		if (!BTDM_IsCoexistStateChanged(padapter))
			return;

		if (pBtMgnt->ExtConfig.bBTBusy && pmlmepriv->LinkDetectInfo.bBusyTraffic)
		{
			RTPRINT(FBT, BT_TRACE, ("BT is non-idle && Wifi is non-idle!\n"));

			if ((btRssiState == BT_RSSI_STATE_HIGH) ||
				(btRssiState == BT_RSSI_STATE_STAY_HIGH))
			{
				RTPRINT(FBT, BT_TRACE, ("RSSI stay HIGH or High \n"));
				// Do the FW mechanism first
				if (pHalData->bt_coexist.BT21TrafficStatistics.bTxBusyTraffic)
				{
					RTPRINT(FBT, BT_TRACE, ("BT Uplink\n"));
					BTDM_Balance(padapter, _TRUE, 0x20, 0x20);
					BTDM_DiminishWiFi(padapter, _TRUE, _FALSE, 0x20, BT_FW_NAV_OFF);
				}
				else if (pHalData->bt_coexist.BT21TrafficStatistics.bRxBusyTraffic)
				{
					RTPRINT(FBT, BT_TRACE, ("BT Downlink\n"));
					BTDM_FWCoexAllOff(padapter);
				}
				// Then do the SW mechanism
				if ((rssiState1 == BT_RSSI_STATE_HIGH) ||
					(rssiState1 == BT_RSSI_STATE_STAY_HIGH))
				{
					BTDM_AGCTable(padapter, BT_AGCTABLE_ON);
				}
				else
				{
					BTDM_AGCTable(padapter, BT_AGCTABLE_OFF);
				}
				BTDM_BBBackOffLevel(padapter, BT_BB_BACKOFF_ON);
				if (pHalData->bt_coexist.BT21TrafficStatistics.bTxBusyTraffic)
				{
					RTPRINT(FBT, BT_TRACE, ("BT Uplink\n"));
					btdm_DacSwing(padapter, BT_DACSWING_OFF);
				}
				else if (pHalData->bt_coexist.BT21TrafficStatistics.bRxBusyTraffic)
				{
					RTPRINT(FBT, BT_TRACE, ("BT Downlink\n"));
					btdm_DacSwing(padapter, BT_DACSWING_M4);
				}
			}
			else if ((btRssiState == BT_RSSI_STATE_MEDIUM) ||
				(btRssiState == BT_RSSI_STATE_STAY_MEDIUM))
			{
				RTPRINT(FBT, BT_TRACE, ("RSSI stay Medium or Medium \n"));
				// Do the FW mechanism first
				BTDM_Balance(padapter, _TRUE, 0x20, 0x20);

				if (pmlmepriv->LinkDetectInfo.bTxBusyTraffic)
				{
					RTPRINT(FBT, BT_TRACE, ("Wifi Uplink\n"));
					BTDM_DiminishWiFi(padapter, _TRUE, _FALSE, 0x20, BT_FW_NAV_OFF);
				}
				else if (pmlmepriv->LinkDetectInfo.bRxBusyTraffic)
				{
					RTPRINT(FBT, BT_TRACE, ("Wifi Downlink\n"));
					if (BTDM_IsHT40(padapter))
						BTDM_DiminishWiFi(padapter, _TRUE, _FALSE, 0x20, BT_FW_NAV_OFF);//BT_FW_NAV_ON);
					else
						BTDM_DiminishWiFi(padapter, _TRUE, _FALSE, 0x20, BT_FW_NAV_OFF);
				}
				// Then do the SW mechanism
				if ((rssiState1 == BT_RSSI_STATE_HIGH) ||
					(rssiState1 == BT_RSSI_STATE_STAY_HIGH))
				{
					BTDM_AGCTable(padapter, BT_AGCTABLE_ON);
				}
				else
				{
					BTDM_AGCTable(padapter, BT_AGCTABLE_OFF);
				}
				BTDM_BBBackOffLevel(padapter, BT_BB_BACKOFF_ON);
				btdm_DacSwing(padapter, BT_DACSWING_OFF);
			}
			else
			{
				RTPRINT(FBT, BT_TRACE, ("RSSI stay LOW or LOW \n"));
				// Do the FW mechanism first
				BTDM_Balance(padapter, _TRUE, 0x20, 0x20);

				if (pmlmepriv->LinkDetectInfo.bTxBusyTraffic)
				{
					RTPRINT(FBT, BT_TRACE, ("Wifi Uplink\n"));
					BTDM_DiminishWiFi(padapter, _TRUE, _FALSE, 0x20, BT_FW_NAV_OFF);
				}
				else if (pmlmepriv->LinkDetectInfo.bRxBusyTraffic)
				{
					RTPRINT(FBT, BT_TRACE, ("Wifi Downlink\n"));
					if (pHalData->bt_coexist.BT21TrafficStatistics.bTxBusyTraffic)
					{
						RTPRINT(FBT, BT_TRACE, ("BT Uplink\n"));
						if (BTDM_IsHT40(padapter))
						{
							RTPRINT(FBT, BT_TRACE, ("HT40\n"));
							BTDM_DiminishWiFi(padapter, _TRUE, _FALSE, 0x20, BT_FW_NAV_OFF);//BT_FW_NAV_ON);
						}
						else
						{
							RTPRINT(FBT, BT_TRACE, ("HT20 or Legacy\n"));
							BTDM_DiminishWiFi(padapter, _TRUE, _FALSE, 0x20, BT_FW_NAV_OFF);
						}
					}
					else if (pHalData->bt_coexist.BT21TrafficStatistics.bRxBusyTraffic)
					{
						RTPRINT(FBT, BT_TRACE, ("BT Downlink\n"));
						BTDM_DiminishWiFi(padapter, _TRUE, _FALSE, 0x20, BT_FW_NAV_OFF);
					}
				}
				// Then do the SW mechanism
				if ((rssiState1 == BT_RSSI_STATE_HIGH) ||
					(rssiState1 == BT_RSSI_STATE_STAY_HIGH))
				{
					BTDM_AGCTable(padapter, BT_AGCTABLE_ON);
				}
				else
				{
					BTDM_AGCTable(padapter, BT_AGCTABLE_OFF);
				}
				BTDM_BBBackOffLevel(padapter, BT_BB_BACKOFF_OFF);
				btdm_DacSwing(padapter, BT_DACSWING_OFF);
			}
		}
		else if (pBtMgnt->ExtConfig.bBTBusy &&
				!pmlmepriv->LinkDetectInfo.bBusyTraffic &&
				(BTDM_GetRxSS(padapter) < 30))
		{
			RTPRINT(FBT, BT_TRACE, ("BT is non-idle && Wifi is idle!\n"));
			RTPRINT(FBT, BT_TRACE, ("RSSI < 30\n"));
			// Do the FW mechanism first
			BTDM_Balance(padapter, _TRUE, 0x0a, 0x20);
			BTDM_DiminishWiFi(padapter, _TRUE, _FALSE, 0x20, BT_FW_NAV_OFF);
			// Then do the SW mechanism
			BTDM_SWCoexAllOff(padapter);
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("BT is idle or Wifi is idle!\n"));
			BTDM_CoexAllOff(padapter);
		}
	}
}

