acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
u8 btdm_PANAction2Ant(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	PBT_DBG			pBtDbg = &pBTInfo->BtDbg;
	u8			bEnter = _FALSE;

	if (pBtDbg->dbgCtrl == _TRUE )
	{
		if (pBtDbg->dbgProfile == BT_DBG_PROFILE_PAN)
			bEnter = _TRUE;
	}
	else
	{
		if (BTHCI_CheckProfileExist(padapter,BT_PROFILE_PAN) && pBtMgnt->ExtConfig.NumberOfHandle==1)
			bEnter = _TRUE;
	}

	if (bEnter)
	{
		RTPRINT(FBT, BT_TRACE, ("[DM][BT], btdm_PANAction2Ant(), "));
		pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_PROFILE_PAN;
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_PROFILE_HID;
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_PROFILE_A2DP;

		if (pHalData->bt_coexist.BT_CoexistType == BT_CSR_BC4)
		{
			RTPRINT(FBT, BT_TRACE, ("[BC4]\n"));
			btdm_PANActionBC42Ant(padapter);
		}
		else if (pHalData->bt_coexist.BT_CoexistType == BT_CSR_BC8)
		{
			RTPRINT(FBT, BT_TRACE, ("[BC8]\n"));
			if (IS_HARDWARE_TYPE_8192D(padapter))
				btdm_PANActionBC82Ant92d(padapter);
			else
			btdm_PANActionBC82Ant(padapter);
		}
		return _TRUE;
	}
	else
	{
		return _FALSE;
	}
}

void btdm_HIDActionBC42Ant(PADAPTER padapter)
{
//	PMGNT_INFO		pMgntInfo = &padapter->MgntInfo;
	struct mlme_priv *pmlmepriv = &padapter->mlmepriv;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (pHalData->bt_coexist.PreviousState == pHalData->bt_coexist.CurrentState)
		return;

	if (BTDM_Legacy(padapter))
	{
		RTPRINT(FBT, BT_TRACE, ("Current Wireless Mode is B/G\n"));
		btdm_WLANActBTPrecedence(padapter);
	}
	else if (pmlmepriv->LinkDetectInfo.bTxBusyTraffic)
	{
		RTPRINT(FBT, BT_TRACE, ("Wifi Uplink\n"));
		btdm_WLANActBTPrecedence(padapter);
	}
	else if (pmlmepriv->LinkDetectInfo.bRxBusyTraffic)
	{
		RTPRINT(FBT, BT_TRACE, ("Wifi Downlink\n"));
		btdm_WLANActOff(padapter);
	}
	else if (!pmlmepriv->LinkDetectInfo.bBusyTraffic)
	{
		RTPRINT(FBT, BT_TRACE, ("Wifi Idel \n"));
		btdm_WLANActOff(padapter);
	}
	BTDM_SWCoexAllOff(padapter);
}

void btdm_HIDActionBC82Ant(PADAPTER padapter)
{
//	PMGNT_INFO		pMgntInfo = &padapter->MgntInfo;
	struct mlme_priv *pmlmepriv = &padapter->mlmepriv;
	PBT30Info		pBTInfo = GET_BT_INFO(padapter)	;
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u8			btRssiState;

#ifdef CONFIG_USB_HCI
	if (pHalData->CustomerID == RT_CID_PLANEX)
	{
		if (pHalData->bt_coexist.PreviousState == pHalData->bt_coexist.CurrentState)
			return;
		btdm_HIDActionBC42Ant(padapter);
		return;
	}
#endif

	if (pmlmepriv->LinkDetectInfo.bTxBusyTraffic)
	{
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, BT_FW_COEX_THRESH_45, 0);
	}
	else if (pmlmepriv->LinkDetectInfo.bRxBusyTraffic)
	{
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, BT_FW_COEX_THRESH_20, 0);
	}

	if (pHalData->bt_coexist.PreviousState == pHalData->bt_coexist.CurrentState)
		return;

	if (pBtMgnt->ExtConfig.bBTBusy && pmlmepriv->LinkDetectInfo.bBusyTraffic)
	{
		RTPRINT(FBT, BT_TRACE, ("BT is non-idle && Wifi is non-idle!\n"));
		// Do the FW mechanism first
		if ((btRssiState == BT_RSSI_STATE_HIGH) ||
			(btRssiState == BT_RSSI_STATE_STAY_HIGH))
		{
			BTDM_FWCoexAllOff(padapter);
		}
		else
		{
			if (pmlmepriv->LinkDetectInfo.bTxBusyTraffic)
			{
				RTPRINT(FBT, BT_TRACE, ("Wifi Uplink\n"));
				BTDM_Balance(padapter, _FALSE, 0, 0);
				BTDM_DiminishWiFi(padapter, _TRUE, _TRUE, 0x18, BT_FW_NAV_OFF);
			}
			else if (pmlmepriv->LinkDetectInfo.bRxBusyTraffic)
			{
				RTPRINT(FBT, BT_TRACE, ("Wifi Downlink\n"));
				BTDM_Balance(padapter, _TRUE, 0x15, 0x15);
				BTDM_DiminishWiFi(padapter, _TRUE, _FALSE, 0x30, BT_FW_NAV_OFF);
			}
		}
		// Then do the SW mechanism
		BTDM_SWCoexAllOff(padapter);
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("BT is idle or Wifi is idle!\n"));
		BTDM_CoexAllOff(padapter);
	}
}

void btdm_HIDActionBC82Ant92d(PADAPTER padapter)
{
//	PMGNT_INFO		pMgntInfo = &padapter->MgntInfo;
	struct mlme_priv *pmlmepriv = &padapter->mlmepriv;
	PBT30Info		pBTInfo = GET_BT_INFO(padapter)	;
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u8			btRssiState;

	if (pmlmepriv->LinkDetectInfo.bTxBusyTraffic)
	{
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, BT_FW_COEX_THRESH_45, 0);
	}
	else if (pmlmepriv->LinkDetectInfo.bRxBusyTraffic)
	{
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, BT_FW_COEX_THRESH_20, 0);
	}

	if (pHalData->bt_coexist.PreviousState == pHalData->bt_coexist.CurrentState)
		return;

	if (pBtMgnt->ExtConfig.bBTBusy && pmlmepriv->LinkDetectInfo.bBusyTraffic)
	{
		RTPRINT(FBT, BT_TRACE, ("BT is non-idle && Wifi is non-idle!\n"));
		if ((btRssiState == BT_RSSI_STATE_HIGH) ||
			(btRssiState == BT_RSSI_STATE_STAY_HIGH))
		{
			// Do the FW mechanism first
			BTDM_FWCoexAllOff(padapter);

			// Then do the SW mechanism
			BTDM_AGCTable(padapter, BT_AGCTABLE_OFF);
			BTDM_BBBackOffLevel(padapter, BT_BB_BACKOFF_OFF);
			btdm_DacSwing(padapter, BT_DACSWING_M4);
		}
		else
		{
			// Do the FW mechanism first
			if (pmlmepriv->LinkDetectInfo.bTxBusyTraffic)
			{
				RTPRINT(FBT, BT_TRACE, ("Wifi Uplink\n"));
				BTDM_Balance(padapter, _FALSE, 0, 0);
				BTDM_DiminishWiFi(padapter, _TRUE, _TRUE, 0x18, BT_FW_NAV_OFF);
			}
			else if (pmlmepriv->LinkDetectInfo.bRxBusyTraffic)
			{
				RTPRINT(FBT, BT_TRACE, ("Wifi Downlink\n"));
				BTDM_Balance(padapter, _TRUE, 0x15, 0x15);
				BTDM_DiminishWiFi(padapter, _TRUE, _FALSE, 0x30, BT_FW_NAV_OFF);
			}
			// Then do the SW mechanism
			BTDM_SWCoexAllOff(padapter);
		}
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("BT is idle or Wifi is idle!\n"));
		BTDM_CoexAllOff(padapter);
	}
}

u8 btdm_HIDAction2Ant(PADAPTER padapter)
{
	PBT30Info		pBTInfo = GET_BT_INFO(padapter)	;
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	PBT_DBG			pBtDbg = &pBTInfo->BtDbg;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u8			bEnter = _FALSE;

	if (pBtDbg->dbgCtrl == _TRUE )
	{
		if (pBtDbg->dbgProfile == BT_DBG_PROFILE_HID)
			bEnter = _TRUE;
	}
	else
	{
		if (BTHCI_CheckProfileExist(padapter,BT_PROFILE_HID) && pBtMgnt->ExtConfig.NumberOfHandle==1)
			bEnter = _TRUE;
	}

	if (bEnter)
	{
		RTPRINT(FBT, BT_TRACE, ("[DM][BT], btdm_HIDAction2Ant(), "));
		pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_PROFILE_HID;
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_PROFILE_PAN;
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_PROFILE_A2DP;

		if (pHalData->bt_coexist.BT_CoexistType == BT_CSR_BC4)
		{
			RTPRINT(FBT, BT_TRACE, ("[BC4]\n"));
			btdm_HIDActionBC42Ant(padapter);
		}
		else if (pHalData->bt_coexist.BT_CoexistType == BT_CSR_BC8)
		{
			RTPRINT(FBT, BT_TRACE, ("[BC8]\n"));
			if (IS_HARDWARE_TYPE_8192D(padapter))
				btdm_HIDActionBC82Ant92d(padapter);
			else
			btdm_HIDActionBC42Ant(padapter);
		}
		return _TRUE;
	}
	else
	{
		return _FALSE;
	}
}

void btdm_SCOActionBC42Ant(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (pHalData->bt_coexist.PreviousState == pHalData->bt_coexist.CurrentState)
		return;

	btdm_WLANActOff(padapter);
	BTDM_SWCoexAllOff(padapter);
}

