acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
	if ((pHalData->bt_coexist.CurrentState & BT_COEX_STATE_BT_RSSI_LOW) &&
		(DACSwingLevel == 0x20))
	{
		RTPRINT(FBT, BT_TRACE, ("[BT]DiminishWiFi 0x20 original, but set 0x18 for Low RSSI!\n"));
		DACSwingLevel = 0x18;
	}

	H2C_Parameter[2] = 0;
	H2C_Parameter[1] = DACSwingLevel;
	H2C_Parameter[0] = 0;
	if (bDACOn)
	{
		H2C_Parameter[2] |= 0x01;	//BIT0
		if (bInterruptOn)
		{
			H2C_Parameter[2] |= 0x02;	//BIT1
		}
		pHalData->bt_coexist.bFWCoexistAllOff = _FALSE;
	}
	if (bNAVOn)
	{
		H2C_Parameter[2] |= 0x08;	//BIT3
		pHalData->bt_coexist.bFWCoexistAllOff = _FALSE;
	}

	RTPRINT(FBT, BT_TRACE, ("[DM][BT], bDACOn = %s, bInterruptOn = %s, write 0xe = 0x%x\n",
		bDACOn?"ON":"OFF", bInterruptOn?"ON":"OFF",
		H2C_Parameter[0]<<16|H2C_Parameter[1]<<8|H2C_Parameter[2]));
	RTPRINT(FBT, BT_TRACE, ("[DM][BT], bNAVOn = %s\n",
		bNAVOn?"ON":"OFF"));

	if (IS_HARDWARE_TYPE_8192C(padapter))
	{
		FillH2CCmd(padapter, 0xe, 3, H2C_Parameter);
	}
	else if (IS_HARDWARE_TYPE_8192D(padapter))
	{
		FillH2CCmd(padapter, 0x12, 3, H2C_Parameter);
	}
}

void BTDM_BTCoexistWithProfile2Ant(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;

	if (pBtMgnt->ExtConfig.bManualControl)
		return;

	RTPRINT(FIOCTL, IOCTL_BT_FLAG_MON, ("CurrentBTConnectionCnt=%d, BtOperationOn=%d, bBTConnectInProgress=%d !!\n",
		pBtMgnt->CurrentBTConnectionCnt, pBtMgnt->BtOperationOn, pBtMgnt->bBTConnectInProgress));

	if ((pHalData->bt_coexist.BluetoothCoexist) &&
		((pHalData->bt_coexist.BT_CoexistType == BT_CSR_BC4) ||
		(pHalData->bt_coexist.BT_CoexistType == BT_CSR_BC8)))
	{
		BTHCI_GetProfileNameMoto(padapter);
		BTHCI_GetBTRSSI(padapter);
		btdm_CheckBTState2Ant(padapter);
		BTDM_CheckWiFiState(padapter);

		if (btdm_SCOAction2Ant(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("Action SCO\n"));
		}
		else if (btdm_HIDAction2Ant(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("Action HID\n"));
		}
		else if (btdm_A2DPAction2Ant(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("Action A2DP\n"));
		}
		else if (btdm_PANAction2Ant(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("Action PAN\n"));
		}
		else if (btdm_HIDA2DPAction2Ant(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("Action HID_A2DP\n"));
		}
		else if (btdm_HIDPANAction2Ant(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("Action HID_PAN\n"));
		}
		else if (btdm_PANA2DPAction2Ant(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("Action PAN_A2DP\n"));
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("No Action Matched \n"));
		}

		if (pHalData->bt_coexist.PreviousState != pHalData->bt_coexist.CurrentState)
		{
			RTPRINT(FBT, BT_TRACE, ("Coexist State change from 0x%"i64fmt"x to 0x%"i64fmt"x\n",
				pHalData->bt_coexist.PreviousState,
				pHalData->bt_coexist.CurrentState));
			pHalData->bt_coexist.PreviousState = pHalData->bt_coexist.CurrentState;

			RTPRINT(FBT, BT_TRACE, ("["));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_BT30)
				RTPRINT(FBT, BT_TRACE, ("BT 3.0, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_HT20)
				RTPRINT(FBT, BT_TRACE, ("HT20, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_HT40)
				RTPRINT(FBT, BT_TRACE, ("HT40, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_LEGACY)
				RTPRINT(FBT, BT_TRACE, ("Legacy, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_RSSI_LOW)
				RTPRINT(FBT, BT_TRACE, ("Rssi_Low, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_RSSI_MEDIUM)
				RTPRINT(FBT, BT_TRACE, ("Rssi_Mid, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_RSSI_HIGH)
				RTPRINT(FBT, BT_TRACE, ("Rssi_High, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_IDLE)
				RTPRINT(FBT, BT_TRACE, ("Wifi_Idle, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_UPLINK)
				RTPRINT(FBT, BT_TRACE, ("Wifi_Uplink, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_DOWNLINK)
				RTPRINT(FBT, BT_TRACE, ("Wifi_Downlink, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_BT_IDLE)
				RTPRINT(FBT, BT_TRACE, ("BT_idle, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_BT_PAN_IDLE)
				RTPRINT(FBT, BT_TRACE, ("BT_PAN_idle, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_BT_PAN_UPLINK)
				RTPRINT(FBT, BT_TRACE, ("BT_PAN_uplink, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_BT_PAN_DOWNLINK)
				RTPRINT(FBT, BT_TRACE, ("BT_PAN_downlink, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_PROFILE_HID)
				RTPRINT(FBT, BT_TRACE, ("PRO_HID, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_PROFILE_A2DP)
				RTPRINT(FBT, BT_TRACE, ("PRO_A2DP, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_PROFILE_PAN)
				RTPRINT(FBT, BT_TRACE, ("PRO_PAN, "));
			if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_PROFILE_SCO)
				RTPRINT(FBT, BT_TRACE, ("PRO_SCO, "));
			RTPRINT(FBT, BT_TRACE, ("]\n"));
		}
	}
}

// ===== End of sync from SD7 driver HAL/BTCoexist/HalBtcCsr2Ant.c =====
#endif

#ifdef __HALBTCOEXIST_C__ // HAL/BTCoexist/HalBtCoexist.c
// ===== Below this line is sync from SD7 driver HAL/BTCoexist/HalBtCoexist.c =====

//============================================================
// local function
//============================================================
void btdm_BTCoexistWithProfile(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (pHalData->bt_coexist.BT_Ant_Num == Ant_x2)
	{
		RTPRINT(FBT, BT_TRACE, ("[DM][BT], 2 Ant mechanism\n"));
		BTDM_BTCoexistWithProfile2Ant(padapter);
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("[DM][BT], 1 Ant mechanism\n"));
		BTDM_BTCoexistWithProfile1Ant(padapter);
	}
}

void btdm_ResetFWCoexState(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	pHalData->bt_coexist.CurrentState = 0;
	pHalData->bt_coexist.PreviousState = 0;
}

void btdm_InitBtCoexistDM(PADAPTER padapter)
{
	PHAL_DATA_TYPE pHalData = GET_HAL_DATA(padapter);

	// 20100415 Joseph: Restore RF register 0x1E and 0x1F value for further usage.
	if (IS_HARDWARE_TYPE_8723A(padapter))
	{
		pHalData->bt_coexist.BtRfRegOrigin1E = PHY_QueryRFReg(padapter, PathA, RF_RCK1, bRFRegOffsetMask);
	}
	else if (IS_HARDWARE_TYPE_8192D(padapter))
	{
		pHalData->bt_coexist.BtRfRegOrigin1E = PHY_QueryRFReg(padapter, PathA, RF_RCK1, bRFRegOffsetMask);
	}
	else
	{
		pHalData->bt_coexist.BtRfRegOrigin1E = PHY_QueryRFReg(padapter, PathA, RF_RCK1, 0xf0);
	}
	pHalData->bt_coexist.BtRfRegOrigin1F = PHY_QueryRFReg(padapter, PathA, RF_RCK2, 0xf0);

	pHalData->bt_coexist.CurrentState = 0;
	pHalData->bt_coexist.PreviousState = 0;

