acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
	BTDM_8723AInit(padapter);
	pHalData->bt_coexist.bInitlized = _TRUE;
}
#if 0
void btdm_FWCoexAllOff92C(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (pHalData->bt_coexist.BT_Ant_Num == Ant_x2)
	{
		BTDM_Balance(padapter, _FALSE, 0, 0);
		BTDM_DiminishWiFi(padapter, _FALSE, _FALSE, 0, BT_FW_NAV_OFF);
	}
	else
	{
		BTDM_Balance(padapter, _FALSE, 0, 0);
		BTDM_SingleAnt(padapter, _FALSE, _FALSE, _FALSE);
	}
}

void btdm_FWCoexAllOff92D(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (pHalData->bt_coexist.BT_Ant_Num == Ant_x2)
	{
		BTDM_Balance(padapter, _FALSE, 0, 0);
		BTDM_DiminishWiFi(padapter, _FALSE, _FALSE, 0, BT_FW_NAV_OFF);
	}
	else
	{
		BTDM_Balance(padapter, _FALSE, 0, 0);
		BTDM_SingleAnt(padapter, _FALSE, _FALSE, _FALSE);
	}
}

void
btdm_BTCoexist8192C(
	PADAPTER	padapter
	)
{
	PMGNT_INFO		pMgntInfo = &(padapter->MgntInfo);
	PBT_MGNT		pBtMgnt=GET_BT_INFO(padapter)->BtMgnt;

	if (pBtMgnt->bSupportProfile)
	{
		RTPRINT(FBT, BT_TRACE, ("[DM][BT], profile notification co-exist mechanism\n"));
		btdm_BTCoexistWithProfile(padapter);
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("[DM][BT], No profile notification!!\n"));
	}
}

u8 btdm_IsBTCoexistEnter(PADAPTER padapter)
{
//	PMGNT_INFO		pMgntInfo = &padapter->MgntInfo;
	struct mlme_priv *pmlmepriv;
	struct mlme_ext_priv *pmlmeext;
	PBT_MGNT		pBtMgnt;
	PHAL_DATA_TYPE	pHalData;
	u8			bRet;


	pmlmepriv = &padapter->mlmepriv;
	pmlmeext = &padapter->mlmeextpriv;
	pHalData = GET_HAL_DATA(padapter);
	pBtMgnt = &pHalData->BtInfo.BtMgnt;
	bRet = _TRUE;

	RTPRINT(FBT, BT_TRACE, ("[DM][BT], padapter->interfaceIndex = %d\n",
		padapter->interfaceIndex));

	if (SINGLEMAC_SINGLEPHY == pHalData->MacPhyMode92D)
	{
		RTPRINT(FBT, BT_TRACE, ("[DM][BT], Single Mac & Single Phy\n"));
	}
	else if (DUALMAC_SINGLEPHY == pHalData->MacPhyMode92D)
	{
		RTPRINT(FBT, BT_TRACE, ("[DM][BT], Dual Mac & Single Phy, do nothing!\n"));
		bRet = _FALSE;
	}
	else if (DUALMAC_DUALPHY == pHalData->MacPhyMode92D)
	{
		RTPRINT(FBT, BT_TRACE, ("[DM][BT], Dual Mac & Dual Phy, do nothing!\n"));
		bRet = _FALSE;
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("[DM][BT], Unknown Mac & Phy, do nothing!\n"));
		bRet = _FALSE;
	}

//	switch (pHalData->RF_Type)
	switch (pHalData->rf_type)
	{
		case RF_1T2R:
			RTPRINT(FBT, BT_TRACE, ("[DM][BT], RF 1T2R\n"));
			break;
		case RF_2T4R:
			RTPRINT(FBT, BT_TRACE, ("[DM][BT], RF 2T4R\n"));
			break;
		case RF_2T2R:
			RTPRINT(FBT, BT_TRACE, ("[DM][BT], RF 2T2R\n"));
			break;
		case RF_1T1R:
			RTPRINT(FBT, BT_TRACE, ("[DM][BT], RF 1T1R\n"));
			break;
		default:
			RTPRINT(FBT, BT_TRACE, ("[DM][BT], Unknown RF type!\n"));
			bRet = _FALSE;
			break;
	}

	RTPRINT(FBT, BT_TRACE, ("[DM][BT], CurrentBssWirelessMode=%d, \
		dot11CurrentWirelessMode=%d, Hal CurrentWirelessMode=%d \n", \
		pMgntInfo->CurrentBssWirelessMode, pMgntInfo->dot11CurrentWirelessMode,
		pHalData->CurrentWirelessMode));

	if (WIRELESS_MODE_N_5G == pMgntInfo->dot11CurrentWirelessMode ||
		WIRELESS_MODE_A == pMgntInfo->dot11CurrentWirelessMode)
	{
		RTPRINT(FBT, BT_TRACE, ("[DM][BT], 5G or A band, do nothing and disable all bt coex mechanism!\n"));
		BTDM_CoexAllOff(padapter);
		bRet = _FALSE;
	}

	return bRet;
}

void btdm_BTCoexist8192D(PADAPTER padapter)
{
	PMGNT_INFO		pMgntInfo = &(padapter->MgntInfo);
	PBT_MGNT		pBtMgnt=GET_BT_INFO(padapter)->BtMgnt;
	PHAL_DATA_TYPE pHalData = GET_HAL_DATA(padapter);

	if (!btdm_IsBTCoexistEnter(padapter))
		return;

	if ((pBtMgnt->bSupportProfile) ||
		(pHalData->bt_coexist.BT_CoexistType == BT_CSR_BC8))
	{
		if (pHalData->bt_coexist.BT_CoexistType == BT_CSR_BC8 &&
			!pBtMgnt->bSupportProfile)
		{
			RTPRINT(FBT, BT_TRACE, ("[DM][BT], BTDM_Coexist(): Not specify condition\n"));
		}

		RTPRINT(FBT, BT_TRACE, ("[DM][BT], BTDM_CoexistWithProfile()\n"));
		btdm_BTCoexistWithProfile(padapter);
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("[DM][BT], No profile notification!!\n"));
	}
}

void
btdm_AgcTable92d(
	PADAPTER	padapter,
	u8		type
	)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (type == BT_AGCTABLE_OFF)
	{
		RTPRINT(FBT, BT_TRACE, ("[BT]AGCTable Off!\n"));
		PHY_SetRFReg(padapter, PathA, RF_RX_G1, bRFRegOffsetMask, 0x30a99);
		PHY_SetRFReg(padapter, PathA, RF_RX_AGC_HP, bRFRegOffsetMask, 0xdc000);

		rtw_write32(padapter, 0xc78, 0x7B000001);
		rtw_write32(padapter, 0xc78, 0x7B010001);
		rtw_write32(padapter, 0xc78, 0x7B020001);
		rtw_write32(padapter, 0xc78, 0x7B030001);
		rtw_write32(padapter, 0xc78, 0x7B040001);
		rtw_write32(padapter, 0xc78, 0x7B050001);
		rtw_write32(padapter, 0xc78, 0x7B060001);
		rtw_write32(padapter, 0xc78, 0x7A070001);
		rtw_write32(padapter, 0xc78, 0x79080001);
		rtw_write32(padapter, 0xc78, 0x78090001);
		rtw_write32(padapter, 0xc78, 0x770A0001);
		rtw_write32(padapter, 0xc78, 0x760B0001);
		rtw_write32(padapter, 0xc78, 0x750C0001);
		rtw_write32(padapter, 0xc78, 0x740D0001);
		rtw_write32(padapter, 0xc78, 0x730E0001);
		rtw_write32(padapter, 0xc78, 0x720F0001);
		rtw_write32(padapter, 0xc78, 0x71100001);
		rtw_write32(padapter, 0xc78, 0x70110001);
		rtw_write32(padapter, 0xc78, 0x6F120001);
		rtw_write32(padapter, 0xc78, 0x6E130001);
		rtw_write32(padapter, 0xc78, 0x6D140001);
		rtw_write32(padapter, 0xc78, 0x6C150001);
		rtw_write32(padapter, 0xc78, 0x6B160001);
		rtw_write32(padapter, 0xc78, 0x6A170001);
		rtw_write32(padapter, 0xc78, 0x69180001);
		rtw_write32(padapter, 0xc78, 0x68190001);
		rtw_write32(padapter, 0xc78, 0x671A0001);
		rtw_write32(padapter, 0xc78, 0x661B0001);
		rtw_write32(padapter, 0xc78, 0x651C0001);
		rtw_write32(padapter, 0xc78, 0x641D0001);
		rtw_write32(padapter, 0xc78, 0x631E0001);
		rtw_write32(padapter, 0xc78, 0x621F0001);
		rtw_write32(padapter, 0xc78, 0x61200001);
		rtw_write32(padapter, 0xc78, 0x60210001);
		rtw_write32(padapter, 0xc78, 0x49220001);
		rtw_write32(padapter, 0xc78, 0x48230001);
		rtw_write32(padapter, 0xc78, 0x47240001);
		rtw_write32(padapter, 0xc78, 0x46250001);
		rtw_write32(padapter, 0xc78, 0x45260001);
		rtw_write32(padapter, 0xc78, 0x44270001);
		rtw_write32(padapter, 0xc78, 0x43280001);
		rtw_write32(padapter, 0xc78, 0x42290001);
		rtw_write32(padapter, 0xc78, 0x412A0001);
		rtw_write32(padapter, 0xc78, 0x402B0001);

		pHalData->bt_coexist.b92DAgcTableOn = _FALSE;
	}
	else if (type == BT_AGCTABLE_ON)
	{
		RTPRINT(FBT, BT_TRACE, ("[BT]AGCTable ON!\n"));
		PHY_SetRFReg(padapter, PathA, RF_RX_G1, bRFRegOffsetMask, 0xa99);
		PHY_SetRFReg(padapter, PathA, RF_RX_AGC_HP, bRFRegOffsetMask, 0xd4000);

		rtw_write32(padapter, 0xc78, 0x7b000001);
		rtw_write32(padapter, 0xc78, 0x7b010001);
		rtw_write32(padapter, 0xc78, 0x7b020001);
		rtw_write32(padapter, 0xc78, 0x7b030001);
		rtw_write32(padapter, 0xc78, 0x7b040001);
		rtw_write32(padapter, 0xc78, 0x7b050001);
		rtw_write32(padapter, 0xc78, 0x7b060001);
		rtw_write32(padapter, 0xc78, 0x7b070001);
		rtw_write32(padapter, 0xc78, 0x7b080001);
		rtw_write32(padapter, 0xc78, 0x7b090001);
		rtw_write32(padapter, 0xc78, 0x7b0A0001);
		rtw_write32(padapter, 0xc78, 0x7b0B0001);
		rtw_write32(padapter, 0xc78, 0x7a0C0001);
		rtw_write32(padapter, 0xc78, 0x790D0001);
		rtw_write32(padapter, 0xc78, 0x780E0001);
		rtw_write32(padapter, 0xc78, 0x770F0001);
		rtw_write32(padapter, 0xc78, 0x76100001);
		rtw_write32(padapter, 0xc78, 0x75110001);
		rtw_write32(padapter, 0xc78, 0x74120001);
		rtw_write32(padapter, 0xc78, 0x73130001);
		rtw_write32(padapter, 0xc78, 0x72140001);
		rtw_write32(padapter, 0xc78, 0x71150001);
		rtw_write32(padapter, 0xc78, 0x70160001);
		rtw_write32(padapter, 0xc78, 0x6f170001);
		rtw_write32(padapter, 0xc78, 0x6e180001);
		rtw_write32(padapter, 0xc78, 0x6d190001);
		rtw_write32(padapter, 0xc78, 0x6c1A0001);
		rtw_write32(padapter, 0xc78, 0x6b1B0001);
		rtw_write32(padapter, 0xc78, 0x6a1C0001);
		rtw_write32(padapter, 0xc78, 0x691D0001);
		rtw_write32(padapter, 0xc78, 0x4f1E0001);
		rtw_write32(padapter, 0xc78, 0x4e1F0001);
		rtw_write32(padapter, 0xc78, 0x4d200001);
		rtw_write32(padapter, 0xc78, 0x4c210001);
		rtw_write32(padapter, 0xc78, 0x4b220001);
		rtw_write32(padapter, 0xc78, 0x4a230001);
		rtw_write32(padapter, 0xc78, 0x49240001);
		rtw_write32(padapter, 0xc78, 0x48250001);
		rtw_write32(padapter, 0xc78, 0x47260001);
		rtw_write32(padapter, 0xc78, 0x46270001);
		rtw_write32(padapter, 0xc78, 0x45280001);
		rtw_write32(padapter, 0xc78, 0x44290001);
		rtw_write32(padapter, 0xc78, 0x432A0001);
		rtw_write32(padapter, 0xc78, 0x422B0001);

		pHalData->bt_coexist.b92DAgcTableOn = _TRUE;
		pHalData->bt_coexist.bSWCoexistAllOff = _FALSE;
	}
}
#endif
//============================================================
// extern function
//============================================================
void BTDM_CheckAntSelMode(PADAPTER padapter)
{
#if 0
	if (!IS_HARDWARE_TYPE_8192C(padapter))
		return;
	BTDM_CheckBTIdleChange1Ant(padapter);
#endif
}

