acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
#ifdef CONFIG_PCI_HCI
	if (IS_HARDWARE_TYPE_8192C(padapter))
	{
		// When BT is non idle
		if (!(pHalData->bt_coexist.CurrentState & BT_COEX_STATE_BT_IDLE))
		{
			aggr_num = 0x0909;
		}
		else
		{
			aggr_num = 0x0A0A;
		}

		if ((pHalData->bt_coexist.last_aggr_num != aggr_num) || !pHalData->bt_coexist.bEDCAInitialized)
		{
			RTPRINT(FBT, BT_TRACE, ("BT write AGGR NUM = 0x%x\n", aggr_num));
			rtw_write16(padapter, REG_MAX_AGGR_NUM, aggr_num);
			pHalData->bt_coexist.last_aggr_num = aggr_num;
		}
	}
#endif

	return bRet;
}

void
BTDM_Balance(
	PADAPTER	padapter,
	u8			bBalanceOn,
	u8			ms0,
	u8			ms1
	)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u8	H2C_Parameter[3] = {0};

	if (bBalanceOn)
	{
		H2C_Parameter[2] = 1;
		H2C_Parameter[1] = ms1;
		H2C_Parameter[0] = ms0;
		pHalData->bt_coexist.bFWCoexistAllOff = _FALSE;
	}
	else
	{
		H2C_Parameter[2] = 0;
		H2C_Parameter[1] = 0;
		H2C_Parameter[0] = 0;
	}
	pHalData->bt_coexist.bBalanceOn = bBalanceOn;

	RTPRINT(FBT, BT_TRACE, ("[DM][BT], Balance=[%s:%dms:%dms], write 0xc=0x%x\n",
		bBalanceOn?"ON":"OFF", ms0, ms1,
		H2C_Parameter[0]<<16|H2C_Parameter[1]<<8|H2C_Parameter[2]));

	FillH2CCmd(padapter, 0xc, 3, H2C_Parameter);
}

void BTDM_AGCTable(PADAPTER padapter, u8 type)
{
	PHAL_DATA_TYPE pHalData = GET_HAL_DATA(padapter);
#if 0
	if (IS_HARDWARE_TYPE_8192D(padapter))
	{
		btdm_AgcTable92d(padapter, type);
		return;
	}
#endif
	if (type == BT_AGCTABLE_OFF)
	{
		RTPRINT(FBT, BT_TRACE, ("[BT]AGCTable Off!\n"));
		rtw_write32(padapter, 0xc78,0x641c0001);
		rtw_write32(padapter, 0xc78,0x631d0001);
		rtw_write32(padapter, 0xc78,0x621e0001);
		rtw_write32(padapter, 0xc78,0x611f0001);
		rtw_write32(padapter, 0xc78,0x60200001);

		PHY_SetRFReg(padapter, PathA, RF_RX_AGC_HP, bRFRegOffsetMask, 0x32000);
		PHY_SetRFReg(padapter, PathA, RF_RX_AGC_HP, bRFRegOffsetMask, 0x71000);
		PHY_SetRFReg(padapter, PathA, RF_RX_AGC_HP, bRFRegOffsetMask, 0xb0000);
		PHY_SetRFReg(padapter, PathA, RF_RX_AGC_HP, bRFRegOffsetMask, 0xfc000);
		if (IS_HARDWARE_TYPE_8723A(padapter))
			PHY_SetRFReg(padapter, PathA, RF_RX_G1, bRFRegOffsetMask, 0x30355);
		else
			PHY_SetRFReg(padapter, PathA, RF_RX_G1, bRFRegOffsetMask, 0x10255);

		if (IS_HARDWARE_TYPE_8723A(padapter))
			pHalData->bt_coexist.b8723aAgcTableOn = _FALSE;
	}
	else if (type == BT_AGCTABLE_ON)
	{
		RTPRINT(FBT, BT_TRACE, ("[BT]AGCTable On!\n"));
		rtw_write32(padapter, 0xc78,0x4e1c0001);
		rtw_write32(padapter, 0xc78,0x4d1d0001);
		rtw_write32(padapter, 0xc78,0x4c1e0001);
		rtw_write32(padapter, 0xc78,0x4b1f0001);
		rtw_write32(padapter, 0xc78,0x4a200001);

		PHY_SetRFReg(padapter, PathA, RF_RX_AGC_HP, bRFRegOffsetMask, 0xdc000);
		PHY_SetRFReg(padapter, PathA, RF_RX_AGC_HP, bRFRegOffsetMask, 0x90000);
		PHY_SetRFReg(padapter, PathA, RF_RX_AGC_HP, bRFRegOffsetMask, 0x51000);
		PHY_SetRFReg(padapter, PathA, RF_RX_AGC_HP, bRFRegOffsetMask, 0x12000);
		if (IS_HARDWARE_TYPE_8723A(padapter))
			PHY_SetRFReg(padapter, PathA, RF_RX_G1, bRFRegOffsetMask, 0x00355);
		else
			PHY_SetRFReg(padapter, PathA, RF_RX_G1, bRFRegOffsetMask, 0x00255);

		if (IS_HARDWARE_TYPE_8723A(padapter))
			pHalData->bt_coexist.b8723aAgcTableOn = _TRUE;

		pHalData->bt_coexist.bSWCoexistAllOff = _FALSE;
	}
}

void BTDM_BBBackOffLevel(PADAPTER padapter, u8 type)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (type == BT_BB_BACKOFF_OFF)
	{
		RTPRINT(FBT, BT_TRACE, ("[BT]BBBackOffLevel Off!\n"));
		rtw_write32(padapter, 0xc04,0x3a05611);
	}
	else if (type == BT_BB_BACKOFF_ON)
	{
		RTPRINT(FBT, BT_TRACE, ("[BT]BBBackOffLevel On!\n"));
		rtw_write32(padapter, 0xc04,0x3a07611);
		pHalData->bt_coexist.bSWCoexistAllOff = _FALSE;
	}
}

void BTDM_FWCoexAllOff(PADAPTER padapter)
{
//	PMGNT_INFO		pMgntInfo = &padapter->MgntInfo;
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);;


	RTPRINT(FBT, BT_TRACE, ("BTDM_FWCoexAllOff()\n"));
#if 0
	if (!pBtMgnt->bSupportProfile)
		return;
#endif
	if (pHalData->bt_coexist.bFWCoexistAllOff)
		return;
	RTPRINT(FBT, BT_TRACE, ("BTDM_FWCoexAllOff(), real Do\n"));

#if 0
	if (IS_HARDWARE_TYPE_8192C(padapter))
	{
		btdm_FWCoexAllOff92C(padapter);
	}
	else if (IS_HARDWARE_TYPE_8192D(padapter))
	{
		btdm_FWCoexAllOff92D(padapter);
	}
	else if (IS_HARDWARE_TYPE_8723A(padapter))
	{
		BTDM_FWCoexAllOff8723A(padapter);
	}
#else
	BTDM_FWCoexAllOff8723A(padapter);
#endif

	pHalData->bt_coexist.bFWCoexistAllOff = _TRUE;
}

void BTDM_SWCoexAllOff(PADAPTER padapter)
{
//	PMGNT_INFO		pMgntInfo = &padapter->MgntInfo;
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);;


	RTPRINT(FBT, BT_TRACE, ("BTDM_SWCoexAllOff()\n"));
#if 0
	if (!pBtMgnt->bSupportProfile)
		return;
#endif
	if (pHalData->bt_coexist.bSWCoexistAllOff)
		return;
	RTPRINT(FBT, BT_TRACE, ("BTDM_SWCoexAllOff(), real Do\n"));
#if 0
	if (IS_HARDWARE_TYPE_8192C(padapter))
	{
		BTDM_SwCoexAllOff92C(padapter);
	}
	else if (IS_HARDWARE_TYPE_8192D(padapter))
	{
		BTDM_SwCoexAllOff92D(padapter);
	}
	else if (IS_HARDWARE_TYPE_8723A(padapter))
	{
		BTDM_SWCoexAllOff8723A(padapter);
	}
#else
	BTDM_SWCoexAllOff8723A(padapter);
#endif

	pHalData->bt_coexist.bSWCoexistAllOff = _TRUE;
}

void BTDM_HWCoexAllOff(PADAPTER padapter)
{
//	PMGNT_INFO		pMgntInfo = &padapter->MgntInfo;
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);;


	RTPRINT(FBT, BT_TRACE, ("BTDM_HWCoexAllOff()\n"));
#if 0
	if (!pBtMgnt->bSupportProfile)
		return;
#endif
	if (pHalData->bt_coexist.bHWCoexistAllOff)
		return;
	RTPRINT(FBT, BT_TRACE, ("BTDM_HWCoexAllOff(), real Do\n"));

	if (IS_HARDWARE_TYPE_8723A(padapter))
	{
		BTDM_HWCoexAllOff8723A(padapter);
	}

	pHalData->bt_coexist.bHWCoexistAllOff = _TRUE;
}

void BTDM_CoexAllOff(PADAPTER padapter)
{
	BTDM_FWCoexAllOff(padapter);
	BTDM_SWCoexAllOff(padapter);
	BTDM_HWCoexAllOff(padapter);
}

void BTDM_TurnOffBtCoexistBeforeEnterLPS(PADAPTER padapter)
{
//	PMGNT_INFO		pMgntInfo = &padapter->MgntInfo;
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
//	PRT_POWER_SAVE_CONTROL	pPSC = GET_POWER_SAVE_CONTROL(pMgntInfo);
	struct pwrctrl_priv *ppwrctrl = &padapter->pwrctrlpriv;


	// Add temporarily.
	if ((!pHalData->bt_coexist.BluetoothCoexist) ||(!pBtMgnt->bSupportProfile))
		return;

