acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
u8 BTDM_IsActionA2DP(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData;
	PBT30Info		pBTInfo;
	PBT_MGNT		pBtMgnt;
	PBT_DBG			pBtDbg;
	u8			bRet;


	pHalData = GET_HAL_DATA(padapter);
	pBTInfo = GET_BT_INFO(padapter);
	pBtMgnt = &pBTInfo->BtMgnt;
	pBtDbg = &pBTInfo->BtDbg;
	bRet = _FALSE;

	if (pBtDbg->dbgCtrl == _TRUE )
	{
		if (pBtDbg->dbgProfile == BT_DBG_PROFILE_A2DP)
		{
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_PROFILE_A2DP;
			bRet = _TRUE;
		}
	}
	else
	{
		if (BTHCI_CheckProfileExist(padapter,BT_PROFILE_A2DP) && pBtMgnt->ExtConfig.NumberOfHandle==1)
		{
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_PROFILE_A2DP;
			bRet = _TRUE;
		}
	}
	return bRet;
}

u8 BTDM_IsActionPAN(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData;
	PBT30Info		pBTInfo;
	PBT_MGNT		pBtMgnt;
	PBT_DBG			pBtDbg;
	u8			bRet;


	pHalData = GET_HAL_DATA(padapter);
	pBTInfo = GET_BT_INFO(padapter);
	pBtMgnt = &pBTInfo->BtMgnt;
	pBtDbg = &pBTInfo->BtDbg;
	bRet = _FALSE;

	if (pBtDbg->dbgCtrl == _TRUE)
	{
		if (pBtDbg->dbgProfile == BT_DBG_PROFILE_PAN)
		{
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_PROFILE_PAN;
			bRet = _TRUE;
		}
	}
	else
	{
		if (BTHCI_CheckProfileExist(padapter,BT_PROFILE_PAN) && pBtMgnt->ExtConfig.NumberOfHandle==1)
		{
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_PROFILE_PAN;
			bRet = _TRUE;
		}
	}
	return bRet;
}

u8 BTDM_IsActionHIDA2DP(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData;
	PBT30Info		pBTInfo;
	PBT_MGNT		pBtMgnt;
	PBT_DBG			pBtDbg;
	u8			bRet;


	pHalData = GET_HAL_DATA(padapter);
	pBTInfo = GET_BT_INFO(padapter);
	pBtMgnt = &pBTInfo->BtMgnt;
	pBtDbg = &pBTInfo->BtDbg;
	bRet = _FALSE;

	if (pBtDbg->dbgCtrl == _TRUE)
	{
		if (pBtDbg->dbgProfile == BT_DBG_PROFILE_HID_A2DP)
		{
			pHalData->bt_coexist.CurrentState |= (BT_COEX_STATE_PROFILE_HID|BT_COEX_STATE_PROFILE_A2DP);
			bRet = _TRUE;
		}
	}
	else
	{
		if (BTHCI_CheckProfileExist(padapter,BT_PROFILE_HID) && BTHCI_CheckProfileExist(padapter,BT_PROFILE_A2DP))
		{
			pHalData->bt_coexist.CurrentState |= (BT_COEX_STATE_PROFILE_HID|BT_COEX_STATE_PROFILE_A2DP);
			bRet = _TRUE;
		}
	}
	return bRet;
}

u8 BTDM_IsActionHIDPAN(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData;
	PBT30Info		pBTInfo;
	PBT_DBG			pBtDbg;
	u8			bRet;


	pHalData = GET_HAL_DATA(padapter);
	pBTInfo = GET_BT_INFO(padapter);
	pBtDbg = &pBTInfo->BtDbg;
	bRet = _FALSE;

	if (pBtDbg->dbgCtrl == _TRUE )
	{
		if (pBtDbg->dbgProfile == BT_DBG_PROFILE_HID_PAN)
		{
			pHalData->bt_coexist.CurrentState |= (BT_COEX_STATE_PROFILE_HID|BT_COEX_STATE_PROFILE_PAN);
			bRet = _TRUE;
		}
	}
	else
	{
		if (BTHCI_CheckProfileExist(padapter,BT_PROFILE_HID) && BTHCI_CheckProfileExist(padapter,BT_PROFILE_PAN))
		{
			pHalData->bt_coexist.CurrentState |= (BT_COEX_STATE_PROFILE_HID|BT_COEX_STATE_PROFILE_PAN);
			bRet = _TRUE;
		}
	}
	return bRet;
}

u8 BTDM_IsActionPANA2DP(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData;
	PBT30Info		pBTInfo;
	PBT_DBG			pBtDbg;
	u8			bRet;


	pHalData = GET_HAL_DATA(padapter);
	pBTInfo = GET_BT_INFO(padapter);
	pBtDbg = &pBTInfo->BtDbg;
	bRet = _FALSE;

	if (pBtDbg->dbgCtrl == _TRUE )
	{
		if (pBtDbg->dbgProfile == BT_DBG_PROFILE_PAN_A2DP)
		{
			pHalData->bt_coexist.CurrentState |= (BT_COEX_STATE_PROFILE_PAN|BT_COEX_STATE_PROFILE_A2DP);
			bRet = _TRUE;
		}
	}
	else
	{
		if (BTHCI_CheckProfileExist(padapter,BT_PROFILE_PAN) && BTHCI_CheckProfileExist(padapter,BT_PROFILE_A2DP))
		{
			pHalData->bt_coexist.CurrentState |= (BT_COEX_STATE_PROFILE_PAN|BT_COEX_STATE_PROFILE_A2DP);
			bRet = _TRUE;
		}
	}
	return bRet;
}

u8 BTDM_IsBtDisabled(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (pHalData->bt_coexist.bCurBtDisabled)
		return _TRUE;
	else
		return _FALSE;
}

//============================================
// Started with "WA_" means this is a work around function.
// Because fw need to count bt HW counters
//(BT_ACTIVE/BT_STATE/BT_POLLING)
// in beacon related interrupt, so we have to write beacon control
// register now.
//============================================
void WA_BTDM_EnableBTFwCounterPolling(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	// Currently, only 88cu and 92de need to enter the function
	if (!IS_HARDWARE_TYPE_8192CU(padapter) &&
		!IS_HARDWARE_TYPE_8192DE(padapter))
		return;

	if (!pHalData->bt_coexist.BluetoothCoexist)
	{
		return;
	}
	else
	{
		//
		// Enable BT firmware counter statistics.
		// We have to set 0x550[3]=1 to enable it.
		// Advised by Scott.
		//
		u8	u1val = 0;
		u1val = rtw_read8(padapter, REG_BCN_CTRL);
		u1val |= BIT3;
		rtw_write8(padapter, REG_BCN_CTRL, u1val);
	}
}

// ===== End of sync from SD7 driver HAL/BTCoexist/HalBtCoexist.c =====
#endif

#ifdef __HALBT_C__ // HAL/HalBT.c
// ===== Below this line is sync from SD7 driver HAL/HalBT.c =====

//==================================================
//	local function
//==================================================
#if 0
static void halbt_SetBTSwitchCtrl(PADAPTER padapter)
{
	// switch control, here we set pathA to control
	// 0x878[13] = 1, 0:pathB, 1:pathA(default)
	PHY_SetBBReg(padapter, rFPGA0_XAB_RFParameter, BIT(13), 0x1);

	// antsel control, here we use phy0 and enable antsel.
	// 0x87c[16:15] = b'11, enable antsel, antsel output pin
	// 0x87c[30] = 0, 0: phy0, 1:phy 1
	PHY_SetBBReg(padapter, rFPGA0_XCD_RFParameter, bMaskDWord, 0x1fff8);

	// antsel to Bt or Wifi, it depends Bt on/off.
	// 0x860[9:8] = 'b10, b10:Bt On, WL2G off(default), b01:Bt off, WL2G on.
	PHY_SetBBReg(padapter, rFPGA0_XA_RFInterfaceOE, BIT(9)|BIT(8), 0x2);

	// sw/hw control switch, here we set sw control
	// 0x870[9:8] = 'b11 sw control, 'b00 hw control
	PHY_SetBBReg(padapter, rFPGA0_XAB_RFInterfaceSW, BIT(9)|BIT(8), 0x3);
}
#endif

static void halbt_InitHwConfig8723A(PADAPTER padapter)
{
}

//==================================================
//	extern function
//==================================================
u8 HALBT_GetPGAntNum(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	return pHalData->bt_coexist.BT_Ant_Num;
}

void HALBT_SetKey(PADAPTER padapter, u8 EntryNum)
{
	PBT30Info		pBTinfo;
	PBT_ASOC_ENTRY	pBtAssocEntry;
	u16				usConfig = 0;


