acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/狡籹 -rtl8723a_bt-coexist.c
//	RT_TRACE(COMP_SEC , DBG_LOUD , (" ==> HALBT_SetKey\n"));

	pBTinfo = GET_BT_INFO(padapter);
	pBtAssocEntry = &(pBTinfo->BtAsocEntry[EntryNum]);

	pBtAssocEntry->HwCAMIndex = BT_HWCAM_STAR + EntryNum;

	usConfig = CAM_VALID | (CAM_AES << 2);
//	CAM_program_entry(padapter, pBtAssocEntry->HwCAMIndex, pBtAssocEntry->BTRemoteMACAddr, pBtAssocEntry->PTK + TKIP_ENC_KEY_POS, usConfig);
	write_cam(padapter, pBtAssocEntry->HwCAMIndex, usConfig, pBtAssocEntry->BTRemoteMACAddr, pBtAssocEntry->PTK + TKIP_ENC_KEY_POS);
}

void HALBT_RemoveKey(PADAPTER padapter, u8 EntryNum)
{
	PBT30Info		pBTinfo;
	PBT_ASOC_ENTRY	pBtAssocEntry;


//	RT_TRACE(COMP_SEC , DBG_LOUD , (" ==> HALBT_RemoveKey\n"));

	pBTinfo = GET_BT_INFO(padapter);
	pBtAssocEntry = &(pBTinfo->BtAsocEntry[EntryNum]);

	if (pBTinfo->BtAsocEntry[EntryNum].HwCAMIndex != 0)
	{
		// ToDo : add New HALBT_RemoveKey function !!
		if (pBtAssocEntry->HwCAMIndex >= BT_HWCAM_STAR && pBtAssocEntry->HwCAMIndex < HALF_CAM_ENTRY)
		{
//			CamDeleteOneEntry(padapter, pBtAssocEntry->BTRemoteMACAddr , pBtAssocEntry->HwCAMIndex);
			CAM_empty_entry(padapter, pBtAssocEntry->HwCAMIndex);
//			RT_TRACE(COMP_SEC , DBG_LOUD , (" BT_ResetEntry Remove Key Index : %d \n",pBtAssocEntry->HwCAMIndex));
		}
		pBTinfo->BtAsocEntry[EntryNum].HwCAMIndex = 0;
	}
}

void HALBT_InitBTVars8723A(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData;


	pHalData = GET_HAL_DATA(padapter);

	pHalData->bt_coexist.BluetoothCoexist = pHalData->EEPROMBluetoothCoexist;
	pHalData->bt_coexist.BT_Ant_Num = pHalData->EEPROMBluetoothAntNum;
	pHalData->bt_coexist.BT_CoexistType = pHalData->EEPROMBluetoothType;
	pHalData->bt_coexist.BT_Ant_isolation = pHalData->EEPROMBluetoothAntIsolation;
	pHalData->bt_coexist.BT_RadioSharedType = pHalData->EEPROMBluetoothRadioShared;

	RT_TRACE(_module_hal_init_c_, _drv_info_, ("BT Coexistance = 0x%x\n", pHalData->bt_coexist.BluetoothCoexist));
	if (pHalData->bt_coexist.BluetoothCoexist)
	{
		if (pHalData->bt_coexist.BT_Ant_Num == Ant_x2)
		{
			BTDM_SetBtCoexCurrAntNum(padapter, 2);
			RT_TRACE(_module_hal_init_c_, _drv_info_,("BlueTooth BT_Ant_Num = Antx2\n"));
			DBG_871X("%s WiFi BT coexist Ant_Num = Antx2\n",__func__);
		}
		else if (pHalData->bt_coexist.BT_Ant_Num == Ant_x1)
		{
			BTDM_SetBtCoexCurrAntNum(padapter, 1);
			RT_TRACE(_module_hal_init_c_, _drv_info_,("BlueTooth BT_Ant_Num = Antx1\n"));
			DBG_871X("%s WiFi BT coexist Ant_Num Ant_Num = Antx1\n",__func__);
		}
		pHalData->bt_coexist.bBTBusyTraffic = _FALSE;
		pHalData->bt_coexist.bBTTrafficModeSet = _FALSE;
		pHalData->bt_coexist.bBTNonTrafficModeSet = _FALSE;
		pHalData->bt_coexist.CurrentState = 0;
		pHalData->bt_coexist.PreviousState = 0;

		RT_TRACE(_module_hal_init_c_, _drv_info_,("BT_RadioSharedType = 0x%x\n", pHalData->bt_coexist.BT_RadioSharedType));
	}
}

u8 HALBT_IsBTExist(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (pHalData->bt_coexist.BluetoothCoexist)
		return _TRUE;
	else
		return _FALSE;
}

u8 HALBT_BTChipType(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	return pHalData->bt_coexist.BT_CoexistType;
}

void HALBT_InitHwConfig(PADAPTER padapter)
{
#if 0
	if (IS_HARDWARE_TYPE_8192C(padapter))
	{
		halbt_InitHwConfig92C(padapter);
	}
	else if (IS_HARDWARE_TYPE_8192D(padapter))
	{
		halbt_InitHwConfig92D(padapter);
	}
	else if (IS_HARDWARE_TYPE_8723A(padapter))
#endif
	{
		halbt_InitHwConfig8723A(padapter);
		BTDM_Coexist(padapter);
	}
}

void HALBT_IPSRFOffCheck(PADAPTER padapter)
{
	PBT30Info		pBTinfo;
	PBT_MGNT		pBtMgnt;
	PHAL_DATA_TYPE	pHalData;


	pBTinfo = GET_BT_INFO(padapter);
	pBtMgnt = &pBTinfo->BtMgnt;
	pHalData = GET_HAL_DATA(padapter);

	if (IS_HARDWARE_TYPE_8192C(padapter) ||
		IS_HARDWARE_TYPE_8192D(padapter) ||
		IS_HARDWARE_TYPE_8723A(padapter))
	{
		if ((pHalData->bt_coexist.BluetoothCoexist) &&
			(pBtMgnt->bSupportProfile))
		{
			RTPRINT(FBT, BT_TRACE, ("[BT][DM], HALBT_IPSRFOffCheck(), turn off all Coexist DM\n"));
			BTDM_CoexAllOff(padapter);
		}
	}
}

void HALBT_LPSRFOffCheck(PADAPTER padapter)
{
	PBT30Info		pBTinfo;
	PBT_MGNT		pBtMgnt;
	PHAL_DATA_TYPE	pHalData;


	pBTinfo = GET_BT_INFO(padapter);
	pBtMgnt = &pBTinfo->BtMgnt;
	pHalData = GET_HAL_DATA(padapter);

	if (IS_HARDWARE_TYPE_8192C(padapter) ||
		IS_HARDWARE_TYPE_8192D(padapter) ||
		IS_HARDWARE_TYPE_8723A(padapter))
	{
		if ((pHalData->bt_coexist.BluetoothCoexist) &&
			(pBtMgnt->bSupportProfile))
		{
			RTPRINT(FBT, BT_TRACE, ("[BT][DM], HALBT_LPSRFOffCheck(), turn off all Coexist DM\n"));
			BTDM_CoexAllOff(padapter);
		}
	}
}

void HALBT_SetRtsCtsNoLenLimit(PADAPTER padapter)
{
#if (RTS_CTS_NO_LEN_LIMIT == 1)
	rtw_write32(padapter, 0x4c8, 0xc140402);
#endif
}

u8 HALBT_OnlySupport1T(PADAPTER padapter)
{
#if 0
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (IS_HARDWARE_TYPE_8192DE(padapter))
	{
		if ((SINGLEMAC_SINGLEPHY == pHalData->MacPhyMode92D) &&
			(pHalData->bt_coexist.BluetoothCoexist) &&
			(pHalData->CurrentBandType92D==BAND_ON_2_4G) &&
			(!pHalData->bt_coexist.bCurBtDisabled))
		{
			RTPRINT(FIOCTL, IOCTL_STATE, ("[92d], 1T condition!!\n"));
			return _TRUE;
		}
	}
	RTPRINT(FIOCTL, IOCTL_STATE, ("[92d], 2T condition!!\n"));
#endif
	return _FALSE;
}

u8
HALBT_BtRegAccess(
	PADAPTER	padapter,
	u32			accessType,
	u32			regType,
	u32			regOffset,
	u32			wValue,
	u32			*pRetVal
	)
{
	u8	H2C_Parameter[5] = {0};

	if (IS_HARDWARE_TYPE_8723A(padapter))
	{
		*pRetVal = 0x223;
		//FillH2CCmd(padapter, 0xaf, 5, H2C_Parameter);
	}
	else
	{
		*pRetVal = 0xffffffff;
		return _FALSE;
	}

	return _TRUE;
}

void HALBT_SwitchWirelessMode(PADAPTER padapter, u8 targetWirelessMode)
{
#if 0
	PMGNT_INFO	pMgntInfo = &padapter->MgntInfo;
	u8	band;

	if (!IS_HARDWARE_TYPE_8192D(padapter))
		return;

	RTPRINT(FIOCTL, IOCTL_STATE, ("switch to wireless mode = 0x%x!!\n", targetWirelessMode));
	pMgntInfo->dot11CurrentWirelessMode = targetWirelessMode;
	pMgntInfo->SettingBeforeScan.WirelessMode = pMgntInfo->dot11CurrentWirelessMode;//For N solution won't be change the wireless mode in scan
	padapter->HalFunc.SetWirelessModeHandler(padapter, pMgntInfo->dot11CurrentWirelessMode);

	if ((targetWirelessMode == WIRELESS_MODE_N_5G) ||
		(targetWirelessMode == WIRELESS_MODE_A))
		band = BAND_ON_5G;
	else
		band = BAND_ON_2_4G;
	rtw_hal_set_hwreg(padapter, HW_VAR_DUAL_SWITCH_BAND, &band);
	rtw_mdelay_os(50);
#endif
}

// ===== End of sync from SD7 driver HAL/HalBT.c =====
#endif
